#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryFortItemTileButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaInventoryFortItemTileButton.AthenaInventoryFortItemTileButton_C
// 0x0030 (0x0900 - 0x08D0)
class UAthenaInventoryFortItemTileButton_C final : public UAthenaInventoryFortItemTileButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08D0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 DropTarget;                                        // 0x08D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EquipSlotBorder;                                   // 0x08E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EquipSlotOverlay;                                  // 0x08E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               InputActionWrapper;                                // 0x08F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ItemWidgetHolder;                                  // 0x08F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaInventoryFortItemTileButton(int32 EntryPoint);
	void OnSelected();
	void Destruct();
	void Construct();
	void OnInventoryItemSelected_Event_0(class UFortItem* Item_0);
	void HandleEquipSlotChanged(int32 EquipSlot);
	void UpdateStyle();
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	void SetEquipSlotOverlay(int32 EquipSlot);
	void UpdateInteractionWidgetVisibility();
	struct FEventReply On_ItemWidgetHolder_MouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaInventoryFortItemTileButton_C">();
	}
	static class UAthenaInventoryFortItemTileButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryFortItemTileButton_C>();
	}
};
static_assert(alignof(UAthenaInventoryFortItemTileButton_C) == 0x000008, "Wrong alignment on UAthenaInventoryFortItemTileButton_C");
static_assert(sizeof(UAthenaInventoryFortItemTileButton_C) == 0x000900, "Wrong size on UAthenaInventoryFortItemTileButton_C");
static_assert(offsetof(UAthenaInventoryFortItemTileButton_C, UberGraphFrame) == 0x0008D0, "Member 'UAthenaInventoryFortItemTileButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryFortItemTileButton_C, DropTarget) == 0x0008D8, "Member 'UAthenaInventoryFortItemTileButton_C::DropTarget' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryFortItemTileButton_C, EquipSlotBorder) == 0x0008E0, "Member 'UAthenaInventoryFortItemTileButton_C::EquipSlotBorder' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryFortItemTileButton_C, EquipSlotOverlay) == 0x0008E8, "Member 'UAthenaInventoryFortItemTileButton_C::EquipSlotOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryFortItemTileButton_C, InputActionWrapper) == 0x0008F0, "Member 'UAthenaInventoryFortItemTileButton_C::InputActionWrapper' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryFortItemTileButton_C, ItemWidgetHolder) == 0x0008F8, "Member 'UAthenaInventoryFortItemTileButton_C::ItemWidgetHolder' has a wrong offset!");

}

