#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryEquipSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaInventoryEquipSlot.AthenaInventoryEquipSlot_C
// 0x0050 (0x0290 - 0x0240)
class UAthenaInventoryEquipSlot_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 DropTarget;                                        // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EmptyImage;                                        // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               InputActionOverlay;                                // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    InputActionWidget;                                 // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 ItemCard;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Selection;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnEquipRequested;                                  // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_AthenaInventoryEquipSlot(int32 EntryPoint);
	void OnQuickbarContentsChanged_Event_0(EFortQuickBars QuickbarIndex);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__InputActionWidget_K2Node_ComponentBoundEvent_6_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void Construct();
	void RefreshItem();
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	void SetSelected(bool Selected);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void IsSelected(bool* Selected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaInventoryEquipSlot_C">();
	}
	static class UAthenaInventoryEquipSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryEquipSlot_C>();
	}
};
static_assert(alignof(UAthenaInventoryEquipSlot_C) == 0x000008, "Wrong alignment on UAthenaInventoryEquipSlot_C");
static_assert(sizeof(UAthenaInventoryEquipSlot_C) == 0x000290, "Wrong size on UAthenaInventoryEquipSlot_C");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, UberGraphFrame) == 0x000240, "Member 'UAthenaInventoryEquipSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, DropTarget) == 0x000248, "Member 'UAthenaInventoryEquipSlot_C::DropTarget' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, EmptyImage) == 0x000250, "Member 'UAthenaInventoryEquipSlot_C::EmptyImage' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, InputActionOverlay) == 0x000258, "Member 'UAthenaInventoryEquipSlot_C::InputActionOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, InputActionWidget) == 0x000260, "Member 'UAthenaInventoryEquipSlot_C::InputActionWidget' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, ItemCard) == 0x000268, "Member 'UAthenaInventoryEquipSlot_C::ItemCard' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, Selection) == 0x000270, "Member 'UAthenaInventoryEquipSlot_C::Selection' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, SlotIndex) == 0x000278, "Member 'UAthenaInventoryEquipSlot_C::SlotIndex' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryEquipSlot_C, OnEquipRequested) == 0x000280, "Member 'UAthenaInventoryEquipSlot_C::OnEquipRequested' has a wrong offset!");

}

