#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLobbyPlayerPanel

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLobbyPlayerPanel.AthenaLobbyPlayerPanel_C
// 0x01C8 (0x0400 - 0x0238)
class UAthenaLobbyPlayerPanel_C final : public UCommonUserWidget
{
public:
	class UAthenaLobbyPlayerPanelActions_C*       Actions;                                           // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Border_TabM;                                       // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaLobbyPlayerPanelDetails_C*       Details;                                           // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x0250(0x0190)(Edit, BlueprintVisible, DisableEditOnInstance)
	UMulticastDelegateProperty_                   OnGadgetsClicked;                                  // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnClosed;                                          // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Initialize();
	void SetTeamMemberInfo(const struct FFortTeamMemberInfo& TeamMemberInfo_0);
	void Refresh();
	void Focus();
	void InitializeContextEvents();
	void OnTeamMemberStateChanged(const struct FFortTeamMemberInfo& TeamMemberInfo_0);
	void Cancel();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLobbyPlayerPanel_C">();
	}
	static class UAthenaLobbyPlayerPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLobbyPlayerPanel_C>();
	}
};
static_assert(alignof(UAthenaLobbyPlayerPanel_C) == 0x000008, "Wrong alignment on UAthenaLobbyPlayerPanel_C");
static_assert(sizeof(UAthenaLobbyPlayerPanel_C) == 0x000400, "Wrong size on UAthenaLobbyPlayerPanel_C");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, Actions) == 0x000238, "Member 'UAthenaLobbyPlayerPanel_C::Actions' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, Border_TabM) == 0x000240, "Member 'UAthenaLobbyPlayerPanel_C::Border_TabM' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, Details) == 0x000248, "Member 'UAthenaLobbyPlayerPanel_C::Details' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, TeamMemberInfo) == 0x000250, "Member 'UAthenaLobbyPlayerPanel_C::TeamMemberInfo' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, OnGadgetsClicked) == 0x0003E0, "Member 'UAthenaLobbyPlayerPanel_C::OnGadgetsClicked' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, OnClosed) == 0x0003F0, "Member 'UAthenaLobbyPlayerPanel_C::OnClosed' has a wrong offset!");

}

