#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLeaderboardTab

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.ExecuteUbergraph_AthenaLeaderboardTab
// 0x01B0 (0x01B0 - 0x0000)
struct AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLeaderboardContext*                CallFunc_GetContext_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanShowLeaderboards_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_ComponentBoundEvent_TabId2;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton2;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_ActiveWidget;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ActiveWidgetIndex;      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Value2;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Value;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Add_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_Event_Button;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAthenaPlaylistLeaderboardData         K2Node_Event_PlaylistTabData2;                     // 0x0070(0x0048)(ConstParm)
	bool                                          K2Node_Event_bWasSuccessful;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLeaderboardRowProxyInstance*       K2Node_Event_LocalUserRow;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_ErrorStr;                             // 0x00C8(0x0018)(ConstParm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00E0(0x0018)()
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaLeaderboardTabButton_C*          K2Node_DynamicCast_AsAthena_Leaderboard_Tab_Button; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAthenaPlaylistLeaderboardData         K2Node_Event_PlaylistTabData;                      // 0x0110(0x0048)(ConstParm)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate2;             // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanShowFriendsOnlyLeaderboard_ReturnValue; // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLeaderboardContext*                CallFunc_GetContext_ReturnValue3;                  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanShowLeaderboards_ReturnValue2;         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select4_Default;                            // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0190(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select5_Default;                            // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab");
static_assert(sizeof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab) == 0x0001B0, "Wrong size on AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, EntryPoint) == 0x000000, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_int_Variable) == 0x000004, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_bool_Variable) == 0x000010, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable) == 0x000011, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable2) == 0x000012, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_bool_Variable2) == 0x000013, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable3) == 0x000014, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable4) == 0x000015, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_GetContext_ReturnValue2) == 0x000018, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_bool_Variable3) == 0x000020, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_CanShowLeaderboards_ReturnValue) == 0x000021, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_CanShowLeaderboards_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable5) == 0x000022, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable6) == 0x000023, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_bool_Variable4) == 0x000024, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable7) == 0x000025, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Select_Default) == 0x000026, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable8) == 0x000027, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_TabId2) == 0x000028, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_TabId2' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_TabButton2) == 0x000030, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_TabButton2' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_ActiveWidget) == 0x000038, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_ActiveWidget' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_ActiveWidgetIndex) == 0x000040, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_ActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_Value2) == 0x000044, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_Value2' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_Value) == 0x000048, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_TabId) == 0x000050, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_TabButton) == 0x000058, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_Map_Add_ReturnValue) == 0x000060, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_Map_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_Map_Remove_ReturnValue) == 0x000061, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Event_Button) == 0x000068, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Event_Button' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Event_PlaylistTabData2) == 0x000070, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Event_PlaylistTabData2' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Event_bWasSuccessful) == 0x0000B8, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Event_bWasSuccessful' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Event_LocalUserRow) == 0x0000C0, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Event_LocalUserRow' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Event_ErrorStr) == 0x0000C8, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Event_ErrorStr' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_TextToUpper_ReturnValue) == 0x0000E0, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Select2_Default) == 0x0000F8, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_DynamicCast_AsAthena_Leaderboard_Tab_Button) == 0x000100, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_DynamicCast_AsAthena_Leaderboard_Tab_Button' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Select3_Default) == 0x000109, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_int_Variable2) == 0x00010C, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Event_PlaylistTabData) == 0x000110, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Event_PlaylistTabData' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_CreateDelegate_OutputDelegate) == 0x000158, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_CreateDelegate_OutputDelegate2) == 0x000168, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_bool_Variable5) == 0x000178, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_CanShowFriendsOnlyLeaderboard_ReturnValue) == 0x000179, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_CanShowFriendsOnlyLeaderboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_GetContext_ReturnValue3) == 0x000180, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_CanShowLeaderboards_ReturnValue2) == 0x000188, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_CanShowLeaderboards_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Select4_Default) == 0x00018C, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_GetText_ReturnValue) == 0x000190, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_TextIsEmpty_ReturnValue) == 0x0001A8, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Select5_Default) == 0x0001A9, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Select5_Default' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.OnUpdateListHeader
// 0x0048 (0x0048 - 0x0000)
struct AthenaLeaderboardTab_C_OnUpdateListHeader final
{
public:
	struct FAthenaPlaylistLeaderboardData         PlaylistTabData;                                   // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaLeaderboardTab_C_OnUpdateListHeader) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_OnUpdateListHeader");
static_assert(sizeof(AthenaLeaderboardTab_C_OnUpdateListHeader) == 0x000048, "Wrong size on AthenaLeaderboardTab_C_OnUpdateListHeader");
static_assert(offsetof(AthenaLeaderboardTab_C_OnUpdateListHeader, PlaylistTabData) == 0x000000, "Member 'AthenaLeaderboardTab_C_OnUpdateListHeader::PlaylistTabData' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.OnUpdateLeaderboardListUI
// 0x0028 (0x0028 - 0x0000)
struct AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLeaderboardRowProxyInstance*       LocalUserRow_0;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ErrorStr;                                          // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI");
static_assert(sizeof(AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI) == 0x000028, "Wrong size on AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI");
static_assert(offsetof(AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI, bWasSuccessful) == 0x000000, "Member 'AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI::bWasSuccessful' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI, LocalUserRow_0) == 0x000008, "Member 'AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI::LocalUserRow_0' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI, ErrorStr) == 0x000010, "Member 'AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI::ErrorStr' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.OnUpdateTabButtonText
// 0x0050 (0x0050 - 0x0000)
struct AthenaLeaderboardTab_C_OnUpdateTabButtonText final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAthenaPlaylistLeaderboardData         PlaylistTabData;                                   // 0x0008(0x0048)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaLeaderboardTab_C_OnUpdateTabButtonText) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_OnUpdateTabButtonText");
static_assert(sizeof(AthenaLeaderboardTab_C_OnUpdateTabButtonText) == 0x000050, "Wrong size on AthenaLeaderboardTab_C_OnUpdateTabButtonText");
static_assert(offsetof(AthenaLeaderboardTab_C_OnUpdateTabButtonText, Button) == 0x000000, "Member 'AthenaLeaderboardTab_C_OnUpdateTabButtonText::Button' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnUpdateTabButtonText, PlaylistTabData) == 0x000008, "Member 'AthenaLeaderboardTab_C_OnUpdateTabButtonText::PlaylistTabData' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature");
static_assert(sizeof(AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature) == 0x000010, "Wrong size on AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature, TabId) == 0x000000, "Member 'AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature, TabButton) == 0x000008, "Member 'AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature::TabButton' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct AthenaLeaderboardTab_C_BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaderboardTab_C_BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature) == 0x000004, "Wrong alignment on AthenaLeaderboardTab_C_BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature");
static_assert(sizeof(AthenaLeaderboardTab_C_BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature) == 0x000004, "Wrong size on AthenaLeaderboardTab_C_BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature, Value) == 0x000000, "Member 'AthenaLeaderboardTab_C_BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature::Value' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct AthenaLeaderboardTab_C_BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaderboardTab_C_BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature) == 0x000004, "Wrong alignment on AthenaLeaderboardTab_C_BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature");
static_assert(sizeof(AthenaLeaderboardTab_C_BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature) == 0x000004, "Wrong size on AthenaLeaderboardTab_C_BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature, Value) == 0x000000, "Member 'AthenaLeaderboardTab_C_BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature::Value' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature final
{
public:
	class UWidget*                                ActiveWidget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveWidgetIndex;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature");
static_assert(sizeof(AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature) == 0x000010, "Wrong size on AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature, ActiveWidget) == 0x000000, "Member 'AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature::ActiveWidget' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature, ActiveWidgetIndex) == 0x000008, "Member 'AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature::ActiveWidgetIndex' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.OnPlaylistChangeGamepad
// 0x0028 (0x0028 - 0x0000)
struct AthenaLeaderboardTab_C_OnPlaylistChangeGamepad final
{
public:
	bool                                          bCommitted;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaRotator_C*                       K2Node_DynamicCast_AsAthena_Rotator;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLeaderboardTab_C_OnPlaylistChangeGamepad) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_OnPlaylistChangeGamepad");
static_assert(sizeof(AthenaLeaderboardTab_C_OnPlaylistChangeGamepad) == 0x000028, "Wrong size on AthenaLeaderboardTab_C_OnPlaylistChangeGamepad");
static_assert(offsetof(AthenaLeaderboardTab_C_OnPlaylistChangeGamepad, bCommitted) == 0x000000, "Member 'AthenaLeaderboardTab_C_OnPlaylistChangeGamepad::bCommitted' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnPlaylistChangeGamepad, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaLeaderboardTab_C_OnPlaylistChangeGamepad::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnPlaylistChangeGamepad, CallFunc_IsUsingGamepad_ReturnValue) == 0x000010, "Member 'AthenaLeaderboardTab_C_OnPlaylistChangeGamepad::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnPlaylistChangeGamepad, K2Node_DynamicCast_AsAthena_Rotator) == 0x000018, "Member 'AthenaLeaderboardTab_C_OnPlaylistChangeGamepad::K2Node_DynamicCast_AsAthena_Rotator' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnPlaylistChangeGamepad, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AthenaLeaderboardTab_C_OnPlaylistChangeGamepad::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.OnFriendTypeChangeGamepad
// 0x0020 (0x0020 - 0x0000)
struct AthenaLeaderboardTab_C_OnFriendTypeChangeGamepad final
{
public:
	bool                                          bCommitted;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaRotator_C*                       K2Node_DynamicCast_AsAthena_Rotator;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLeaderboardTab_C_OnFriendTypeChangeGamepad) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_OnFriendTypeChangeGamepad");
static_assert(sizeof(AthenaLeaderboardTab_C_OnFriendTypeChangeGamepad) == 0x000020, "Wrong size on AthenaLeaderboardTab_C_OnFriendTypeChangeGamepad");
static_assert(offsetof(AthenaLeaderboardTab_C_OnFriendTypeChangeGamepad, bCommitted) == 0x000000, "Member 'AthenaLeaderboardTab_C_OnFriendTypeChangeGamepad::bCommitted' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnFriendTypeChangeGamepad, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaLeaderboardTab_C_OnFriendTypeChangeGamepad::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnFriendTypeChangeGamepad, K2Node_DynamicCast_AsAthena_Rotator) == 0x000010, "Member 'AthenaLeaderboardTab_C_OnFriendTypeChangeGamepad::K2Node_DynamicCast_AsAthena_Rotator' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnFriendTypeChangeGamepad, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaLeaderboardTab_C_OnFriendTypeChangeGamepad::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnFriendTypeChangeGamepad, CallFunc_IsUsingGamepad_ReturnValue) == 0x000019, "Member 'AthenaLeaderboardTab_C_OnFriendTypeChangeGamepad::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.OnQueryStateChanged
// 0x0020 (0x0020 - 0x0000)
struct AthenaLeaderboardTab_C_OnQueryStateChanged final
{
public:
	bool                                          bQueryInProgress;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanShowFriendsOnlyLeaderboard_ReturnValue; // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor)
};
static_assert(alignof(AthenaLeaderboardTab_C_OnQueryStateChanged) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_OnQueryStateChanged");
static_assert(sizeof(AthenaLeaderboardTab_C_OnQueryStateChanged) == 0x000020, "Wrong size on AthenaLeaderboardTab_C_OnQueryStateChanged");
static_assert(offsetof(AthenaLeaderboardTab_C_OnQueryStateChanged, bQueryInProgress) == 0x000000, "Member 'AthenaLeaderboardTab_C_OnQueryStateChanged::bQueryInProgress' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnQueryStateChanged, Temp_bool_Variable) == 0x000001, "Member 'AthenaLeaderboardTab_C_OnQueryStateChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnQueryStateChanged, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'AthenaLeaderboardTab_C_OnQueryStateChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnQueryStateChanged, Temp_byte_Variable) == 0x000003, "Member 'AthenaLeaderboardTab_C_OnQueryStateChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnQueryStateChanged, Temp_byte_Variable2) == 0x000004, "Member 'AthenaLeaderboardTab_C_OnQueryStateChanged::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnQueryStateChanged, K2Node_Select_Default) == 0x000005, "Member 'AthenaLeaderboardTab_C_OnQueryStateChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnQueryStateChanged, CallFunc_CanShowFriendsOnlyLeaderboard_ReturnValue) == 0x000006, "Member 'AthenaLeaderboardTab_C_OnQueryStateChanged::CallFunc_CanShowFriendsOnlyLeaderboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnQueryStateChanged, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'AthenaLeaderboardTab_C_OnQueryStateChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnQueryStateChanged, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AthenaLeaderboardTab_C_OnQueryStateChanged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnQueryStateChanged, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'AthenaLeaderboardTab_C_OnQueryStateChanged::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.ToggleDisabledTabVisuals
// 0x0002 (0x0002 - 0x0000)
struct AthenaLeaderboardTab_C_ToggleDisabledTabVisuals final
{
public:
	bool                                          bShouldBeDisabled;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLeaderboardTab_C_ToggleDisabledTabVisuals) == 0x000001, "Wrong alignment on AthenaLeaderboardTab_C_ToggleDisabledTabVisuals");
static_assert(sizeof(AthenaLeaderboardTab_C_ToggleDisabledTabVisuals) == 0x000002, "Wrong size on AthenaLeaderboardTab_C_ToggleDisabledTabVisuals");
static_assert(offsetof(AthenaLeaderboardTab_C_ToggleDisabledTabVisuals, bShouldBeDisabled) == 0x000000, "Member 'AthenaLeaderboardTab_C_ToggleDisabledTabVisuals::bShouldBeDisabled' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ToggleDisabledTabVisuals, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'AthenaLeaderboardTab_C_ToggleDisabledTabVisuals::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

