#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDeathWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaDeathWidget.AthenaDeathWidget_C
// 0x00F8 (0x04D8 - 0x03E0)
class UAthenaDeathWidget_C final : public UCommonActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(Transient, DuplicateTransient)
	class UAthenaGamePhaseWidget_C*               AthenaGamePhaseWidget;                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaKillerPortraitWidget_C*          AthenaKillerPortraitWidget;                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaKillFeedWidget_C*                AthenaKillFeedWidget;                              // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaKillsWidget_C*                   AthenaKillsWidget_102;                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaPlayersLeftWidget_C*             AthenaPlayersLeftWidget;                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaSessionId_C*                     AthenaSessionId;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaViewTargetHitPointInfo_C*        AthenaViewTargetHitPointInfo;                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_PrimaryDeathText;                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      FollowNextTeammate;                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      LeaveButton;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaMinimapContainer_C*              MinimapContainer;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlaceText;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReportSpectatingPlayerButton_C*        ReportPlayer;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaTeamInfo_C*                      TeamInfo;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortActorCanvas*                       TeamMembersActorCanvas;                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         WinnerBox;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       WinnerPlayerName;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             YouDiedOrSpectating;                               // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         YouPlacedBox;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             YouPlacedText;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   YouDied;                                           // 0x0490(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Spectating;                                        // 0x04A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsWaitingForTeamEliminationForPlacement;           // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAthenaTeamMemberIndicator_C*>   TeamMemberIndicators;                              // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaDeathWidget(int32 EntryPoint);
	void BndEvt__FollowNextTeammate_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void PreConstruct(bool IsDesignTime);
	void TeamMemberChanged();
	void On_Kill_Feed_Updated();
	void Construct();
	void OnActivated();
	void BndEvt__LeaveButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnPawnDied(struct FFortPlayerDeathReport& DeathReport);
	void OnPlaceChanged();
	void OnViewTargetChanged();
	void HideExtraStuffForSpectating();
	void OnWinnerAnnounced(const class FString& Winner);
	void AnyTeamMembersStillAlive(class AFortPlayerControllerAthena* PlayerController, bool* AnyAlive);
	void AddTeamMemberIndicator(class AFortPlayerStateAthena* Player_State, int32 Team_Member_Index);
	void UpdateFollowNextTeammateVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaDeathWidget_C">();
	}
	static class UAthenaDeathWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaDeathWidget_C>();
	}
};
static_assert(alignof(UAthenaDeathWidget_C) == 0x000008, "Wrong alignment on UAthenaDeathWidget_C");
static_assert(sizeof(UAthenaDeathWidget_C) == 0x0004D8, "Wrong size on UAthenaDeathWidget_C");
static_assert(offsetof(UAthenaDeathWidget_C, UberGraphFrame) == 0x0003E0, "Member 'UAthenaDeathWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, AthenaGamePhaseWidget) == 0x0003E8, "Member 'UAthenaDeathWidget_C::AthenaGamePhaseWidget' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, AthenaKillerPortraitWidget) == 0x0003F0, "Member 'UAthenaDeathWidget_C::AthenaKillerPortraitWidget' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, AthenaKillFeedWidget) == 0x0003F8, "Member 'UAthenaDeathWidget_C::AthenaKillFeedWidget' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, AthenaKillsWidget_102) == 0x000400, "Member 'UAthenaDeathWidget_C::AthenaKillsWidget_102' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, AthenaPlayersLeftWidget) == 0x000408, "Member 'UAthenaDeathWidget_C::AthenaPlayersLeftWidget' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, AthenaSessionId) == 0x000410, "Member 'UAthenaDeathWidget_C::AthenaSessionId' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, AthenaViewTargetHitPointInfo) == 0x000418, "Member 'UAthenaDeathWidget_C::AthenaViewTargetHitPointInfo' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, CommonTextBlock_PrimaryDeathText) == 0x000420, "Member 'UAthenaDeathWidget_C::CommonTextBlock_PrimaryDeathText' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, FollowNextTeammate) == 0x000428, "Member 'UAthenaDeathWidget_C::FollowNextTeammate' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, InvalidationBox_0) == 0x000430, "Member 'UAthenaDeathWidget_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, LeaveButton) == 0x000438, "Member 'UAthenaDeathWidget_C::LeaveButton' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, MinimapContainer) == 0x000440, "Member 'UAthenaDeathWidget_C::MinimapContainer' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, PlaceText) == 0x000448, "Member 'UAthenaDeathWidget_C::PlaceText' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, ReportPlayer) == 0x000450, "Member 'UAthenaDeathWidget_C::ReportPlayer' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, TeamInfo) == 0x000458, "Member 'UAthenaDeathWidget_C::TeamInfo' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, TeamMembersActorCanvas) == 0x000460, "Member 'UAthenaDeathWidget_C::TeamMembersActorCanvas' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, WinnerBox) == 0x000468, "Member 'UAthenaDeathWidget_C::WinnerBox' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, WinnerPlayerName) == 0x000470, "Member 'UAthenaDeathWidget_C::WinnerPlayerName' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, YouDiedOrSpectating) == 0x000478, "Member 'UAthenaDeathWidget_C::YouDiedOrSpectating' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, YouPlacedBox) == 0x000480, "Member 'UAthenaDeathWidget_C::YouPlacedBox' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, YouPlacedText) == 0x000488, "Member 'UAthenaDeathWidget_C::YouPlacedText' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, YouDied) == 0x000490, "Member 'UAthenaDeathWidget_C::YouDied' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, Spectating) == 0x0004A8, "Member 'UAthenaDeathWidget_C::Spectating' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, IsWaitingForTeamEliminationForPlacement) == 0x0004C0, "Member 'UAthenaDeathWidget_C::IsWaitingForTeamEliminationForPlacement' has a wrong offset!");
static_assert(offsetof(UAthenaDeathWidget_C, TeamMemberIndicators) == 0x0004C8, "Member 'UAthenaDeathWidget_C::TeamMemberIndicators' has a wrong offset!");

}

