#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaMatchmakingWidget.AthenaMatchmakingWidget_C.ExecuteUbergraph_AthenaMatchmakingWidget
// 0x0180 (0x0180 - 0x0000)
struct AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Value;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0018)()
	EFortAthenaPlaylist                           Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable2;                               // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable4;                               // 0x0060(0x0018)()
	EFortAthenaPlaylist                           Temp_byte_Variable2;                               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable5;                               // 0x0080(0x0018)()
	class FText                                   Temp_text_Variable6;                               // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable7;                               // 0x00B0(0x0018)()
	bool                                          Temp_bool_Variable2;                               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable8;                               // 0x00D0(0x0018)()
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCanMatchmake;                        // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsMatchmaking;                       // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0110(0x0018)()
	class FText                                   K2Node_Select2_Default;                            // 0x0128(0x0018)()
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button2;            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Value2;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select3_Default;                            // 0x0150(0x0018)()
	class FText                                   K2Node_Select4_Default;                            // 0x0168(0x0018)()
};
static_assert(alignof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget) == 0x000008, "Wrong alignment on AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget");
static_assert(sizeof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget) == 0x000180, "Wrong size on AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, EntryPoint) == 0x000000, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, K2Node_ComponentBoundEvent_Value) == 0x000004, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, Temp_bool_Variable) == 0x000008, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, CallFunc_Conv_IntToBool_ReturnValue) == 0x000009, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, Temp_text_Variable) == 0x000010, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, Temp_byte_Variable) == 0x000028, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, Temp_text_Variable2) == 0x000030, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, Temp_text_Variable3) == 0x000048, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, Temp_text_Variable4) == 0x000060, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::Temp_text_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, Temp_byte_Variable2) == 0x000078, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, Temp_text_Variable5) == 0x000080, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::Temp_text_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, Temp_text_Variable6) == 0x000098, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::Temp_text_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, Temp_text_Variable7) == 0x0000B0, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::Temp_text_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, Temp_bool_Variable2) == 0x0000C8, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, Temp_text_Variable8) == 0x0000D0, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::Temp_text_Variable8' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, K2Node_ComponentBoundEvent_Button2) == 0x0000E8, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, K2Node_ComponentBoundEvent_Button) == 0x0000F0, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, K2Node_Event_bCanMatchmake) == 0x0000F8, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::K2Node_Event_bCanMatchmake' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000100, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, K2Node_Event_bIsMatchmaking) == 0x000109, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::K2Node_Event_bIsMatchmaking' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, K2Node_Select_Default) == 0x000110, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, K2Node_Select2_Default) == 0x000128, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, K2Node_DynamicCast_AsIcon_Text_Button2) == 0x000140, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::K2Node_DynamicCast_AsIcon_Text_Button2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, K2Node_DynamicCast_bSuccess2) == 0x000148, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, K2Node_ComponentBoundEvent_Value2) == 0x00014C, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::K2Node_ComponentBoundEvent_Value2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, K2Node_Select3_Default) == 0x000150, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget, K2Node_Select4_Default) == 0x000168, "Member 'AthenaMatchmakingWidget_C_ExecuteUbergraph_AthenaMatchmakingWidget::K2Node_Select4_Default' has a wrong offset!");

// Function AthenaMatchmakingWidget.AthenaMatchmakingWidget_C.BndEvt__TeamFillRotator_K2Node_ComponentBoundEvent_128_OnRotated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct AthenaMatchmakingWidget_C_BndEvt__TeamFillRotator_K2Node_ComponentBoundEvent_128_OnRotated__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingWidget_C_BndEvt__TeamFillRotator_K2Node_ComponentBoundEvent_128_OnRotated__DelegateSignature) == 0x000004, "Wrong alignment on AthenaMatchmakingWidget_C_BndEvt__TeamFillRotator_K2Node_ComponentBoundEvent_128_OnRotated__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingWidget_C_BndEvt__TeamFillRotator_K2Node_ComponentBoundEvent_128_OnRotated__DelegateSignature) == 0x000004, "Wrong size on AthenaMatchmakingWidget_C_BndEvt__TeamFillRotator_K2Node_ComponentBoundEvent_128_OnRotated__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingWidget_C_BndEvt__TeamFillRotator_K2Node_ComponentBoundEvent_128_OnRotated__DelegateSignature, Value) == 0x000000, "Member 'AthenaMatchmakingWidget_C_BndEvt__TeamFillRotator_K2Node_ComponentBoundEvent_128_OnRotated__DelegateSignature::Value' has a wrong offset!");

// Function AthenaMatchmakingWidget.AthenaMatchmakingWidget_C.BndEvt__PlaylistRotator_K2Node_ComponentBoundEvent_83_OnRotated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct AthenaMatchmakingWidget_C_BndEvt__PlaylistRotator_K2Node_ComponentBoundEvent_83_OnRotated__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingWidget_C_BndEvt__PlaylistRotator_K2Node_ComponentBoundEvent_83_OnRotated__DelegateSignature) == 0x000004, "Wrong alignment on AthenaMatchmakingWidget_C_BndEvt__PlaylistRotator_K2Node_ComponentBoundEvent_83_OnRotated__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingWidget_C_BndEvt__PlaylistRotator_K2Node_ComponentBoundEvent_83_OnRotated__DelegateSignature) == 0x000004, "Wrong size on AthenaMatchmakingWidget_C_BndEvt__PlaylistRotator_K2Node_ComponentBoundEvent_83_OnRotated__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingWidget_C_BndEvt__PlaylistRotator_K2Node_ComponentBoundEvent_83_OnRotated__DelegateSignature, Value) == 0x000000, "Member 'AthenaMatchmakingWidget_C_BndEvt__PlaylistRotator_K2Node_ComponentBoundEvent_83_OnRotated__DelegateSignature::Value' has a wrong offset!");

// Function AthenaMatchmakingWidget.AthenaMatchmakingWidget_C.SetCancelButtonState
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingWidget_C_SetCancelButtonState final
{
public:
	bool                                          bIsMatchmaking;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingWidget_C_SetCancelButtonState) == 0x000001, "Wrong alignment on AthenaMatchmakingWidget_C_SetCancelButtonState");
static_assert(sizeof(AthenaMatchmakingWidget_C_SetCancelButtonState) == 0x000001, "Wrong size on AthenaMatchmakingWidget_C_SetCancelButtonState");
static_assert(offsetof(AthenaMatchmakingWidget_C_SetCancelButtonState, bIsMatchmaking) == 0x000000, "Member 'AthenaMatchmakingWidget_C_SetCancelButtonState::bIsMatchmaking' has a wrong offset!");

// Function AthenaMatchmakingWidget.AthenaMatchmakingWidget_C.SetPlayButtonState
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingWidget_C_SetPlayButtonState final
{
public:
	bool                                          bCanMatchmake;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingWidget_C_SetPlayButtonState) == 0x000001, "Wrong alignment on AthenaMatchmakingWidget_C_SetPlayButtonState");
static_assert(sizeof(AthenaMatchmakingWidget_C_SetPlayButtonState) == 0x000001, "Wrong size on AthenaMatchmakingWidget_C_SetPlayButtonState");
static_assert(offsetof(AthenaMatchmakingWidget_C_SetPlayButtonState, bCanMatchmake) == 0x000000, "Member 'AthenaMatchmakingWidget_C_SetPlayButtonState::bCanMatchmake' has a wrong offset!");

// Function AthenaMatchmakingWidget.AthenaMatchmakingWidget_C.BndEvt__BP_CancelButton_K2Node_ComponentBoundEvent_19_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingWidget_C_BndEvt__BP_CancelButton_K2Node_ComponentBoundEvent_19_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingWidget_C_BndEvt__BP_CancelButton_K2Node_ComponentBoundEvent_19_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMatchmakingWidget_C_BndEvt__BP_CancelButton_K2Node_ComponentBoundEvent_19_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingWidget_C_BndEvt__BP_CancelButton_K2Node_ComponentBoundEvent_19_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMatchmakingWidget_C_BndEvt__BP_CancelButton_K2Node_ComponentBoundEvent_19_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingWidget_C_BndEvt__BP_CancelButton_K2Node_ComponentBoundEvent_19_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMatchmakingWidget_C_BndEvt__BP_CancelButton_K2Node_ComponentBoundEvent_19_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMatchmakingWidget.AthenaMatchmakingWidget_C.BndEvt__BP_PlayButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingWidget_C_BndEvt__BP_PlayButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingWidget_C_BndEvt__BP_PlayButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMatchmakingWidget_C_BndEvt__BP_PlayButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingWidget_C_BndEvt__BP_PlayButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMatchmakingWidget_C_BndEvt__BP_PlayButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingWidget_C_BndEvt__BP_PlayButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMatchmakingWidget_C_BndEvt__BP_PlayButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMatchmakingWidget.AthenaMatchmakingWidget_C.SetAutoFillOptions
// 0x0010 (0x0010 - 0x0000)
struct AthenaMatchmakingWidget_C_SetAutoFillOptions final
{
public:
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(AthenaMatchmakingWidget_C_SetAutoFillOptions) == 0x000008, "Wrong alignment on AthenaMatchmakingWidget_C_SetAutoFillOptions");
static_assert(sizeof(AthenaMatchmakingWidget_C_SetAutoFillOptions) == 0x000010, "Wrong size on AthenaMatchmakingWidget_C_SetAutoFillOptions");
static_assert(offsetof(AthenaMatchmakingWidget_C_SetAutoFillOptions, K2Node_MakeArray_Array) == 0x000000, "Member 'AthenaMatchmakingWidget_C_SetAutoFillOptions::K2Node_MakeArray_Array' has a wrong offset!");

// Function AthenaMatchmakingWidget.AthenaMatchmakingWidget_C.PlaylistChange
// 0x0018 (0x0018 - 0x0000)
struct AthenaMatchmakingWidget_C_PlaylistChange final
{
public:
	bool                                          bDirection;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaRotator_C*                       K2Node_DynamicCast_AsAthena_Rotator;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingWidget_C_PlaylistChange) == 0x000008, "Wrong alignment on AthenaMatchmakingWidget_C_PlaylistChange");
static_assert(sizeof(AthenaMatchmakingWidget_C_PlaylistChange) == 0x000018, "Wrong size on AthenaMatchmakingWidget_C_PlaylistChange");
static_assert(offsetof(AthenaMatchmakingWidget_C_PlaylistChange, bDirection) == 0x000000, "Member 'AthenaMatchmakingWidget_C_PlaylistChange::bDirection' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_PlaylistChange, K2Node_DynamicCast_AsAthena_Rotator) == 0x000008, "Member 'AthenaMatchmakingWidget_C_PlaylistChange::K2Node_DynamicCast_AsAthena_Rotator' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_PlaylistChange, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AthenaMatchmakingWidget_C_PlaylistChange::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaMatchmakingWidget.AthenaMatchmakingWidget_C.FillChange
// 0x0018 (0x0018 - 0x0000)
struct AthenaMatchmakingWidget_C_FillChange final
{
public:
	bool                                          bDirection;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaRotator_C*                       K2Node_DynamicCast_AsAthena_Rotator;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingWidget_C_FillChange) == 0x000008, "Wrong alignment on AthenaMatchmakingWidget_C_FillChange");
static_assert(sizeof(AthenaMatchmakingWidget_C_FillChange) == 0x000018, "Wrong size on AthenaMatchmakingWidget_C_FillChange");
static_assert(offsetof(AthenaMatchmakingWidget_C_FillChange, bDirection) == 0x000000, "Member 'AthenaMatchmakingWidget_C_FillChange::bDirection' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_FillChange, K2Node_DynamicCast_AsAthena_Rotator) == 0x000008, "Member 'AthenaMatchmakingWidget_C_FillChange::K2Node_DynamicCast_AsAthena_Rotator' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingWidget_C_FillChange, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AthenaMatchmakingWidget_C_FillChange::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

