#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaAerialFeedback

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaAerialFeedback.AthenaAerialFeedback_C.ExecuteUbergraph_AthenaAerialFeedback
// 0x0138 (0x0138 - 0x0000)
struct AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaAerialPhase                            Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x003C(0x0034)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_GameState_C*                    K2Node_DynamicCast_AsAthena_Game_State;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0090(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue2;             // 0x00A8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue3;             // 0x00C0(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue4;             // 0x00E0(0x0018)()
	class AAthena_PlayerController_C*             K2Node_DynamicCast_AsAthena_Player_Controller;     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAthenaAerialPhase                            CallFunc_GetAerialPhase_ReturnValue;               // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0108(0x0018)()
	class FText                                   K2Node_Select2_Default;                            // 0x0120(0x0018)()
};
static_assert(alignof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback) == 0x000008, "Wrong alignment on AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback");
static_assert(sizeof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback) == 0x000138, "Wrong size on AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, EntryPoint) == 0x000000, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, Temp_byte_Variable) == 0x000004, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, Temp_text_Variable) == 0x000008, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, Temp_text_Variable2) == 0x000020, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, Temp_bool_Variable) == 0x000038, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, K2Node_Event_MyGeometry) == 0x00003C, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, K2Node_Event_InDeltaTime) == 0x000070, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, CallFunc_GetGameState_ReturnValue) == 0x000078, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, K2Node_DynamicCast_AsAthena_Game_State) == 0x000080, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::K2Node_DynamicCast_AsAthena_Game_State' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, CallFunc_MakeLiteralText_ReturnValue) == 0x000090, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, CallFunc_MakeLiteralText_ReturnValue2) == 0x0000A8, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::CallFunc_MakeLiteralText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, CallFunc_MakeLiteralText_ReturnValue3) == 0x0000C0, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::CallFunc_MakeLiteralText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000D8, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, CallFunc_MakeLiteralText_ReturnValue4) == 0x0000E0, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::CallFunc_MakeLiteralText_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, K2Node_DynamicCast_AsAthena_Player_Controller) == 0x0000F8, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::K2Node_DynamicCast_AsAthena_Player_Controller' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, K2Node_DynamicCast_bSuccess2) == 0x000100, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, CallFunc_GetAerialPhase_ReturnValue) == 0x000101, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::CallFunc_GetAerialPhase_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000102, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000103, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, K2Node_SwitchEnum_CmpSuccess) == 0x000104, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, CallFunc_BooleanOR_ReturnValue) == 0x000105, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, K2Node_Select_Default) == 0x000108, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback, K2Node_Select2_Default) == 0x000120, "Member 'AthenaAerialFeedback_C_ExecuteUbergraph_AthenaAerialFeedback::K2Node_Select2_Default' has a wrong offset!");

// Function AthenaAerialFeedback.AthenaAerialFeedback_C.Tick
// 0x0038 (0x0038 - 0x0000)
struct AthenaAerialFeedback_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaAerialFeedback_C_Tick) == 0x000004, "Wrong alignment on AthenaAerialFeedback_C_Tick");
static_assert(sizeof(AthenaAerialFeedback_C_Tick) == 0x000038, "Wrong size on AthenaAerialFeedback_C_Tick");
static_assert(offsetof(AthenaAerialFeedback_C_Tick, MyGeometry) == 0x000000, "Member 'AthenaAerialFeedback_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaAerialFeedback_C_Tick, InDeltaTime) == 0x000034, "Member 'AthenaAerialFeedback_C_Tick::InDeltaTime' has a wrong offset!");

}

