#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryDropSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaInventoryDropSlot.AthenaInventoryDropSlot_C
// 0x0050 (0x0290 - 0x0240)
class UAthenaInventoryDropSlot_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 DropTarget;                                        // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DropTargetOverlay;                                 // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EmptyImage;                                        // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               InputActionOverlay;                                // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    InputActionWidget;                                 // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Selection;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnEquipRequested;                                  // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_AthenaInventoryDropSlot(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaInventoryDropSlot_C">();
	}
	static class UAthenaInventoryDropSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryDropSlot_C>();
	}
};
static_assert(alignof(UAthenaInventoryDropSlot_C) == 0x000008, "Wrong alignment on UAthenaInventoryDropSlot_C");
static_assert(sizeof(UAthenaInventoryDropSlot_C) == 0x000290, "Wrong size on UAthenaInventoryDropSlot_C");
static_assert(offsetof(UAthenaInventoryDropSlot_C, UberGraphFrame) == 0x000240, "Member 'UAthenaInventoryDropSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDropSlot_C, DropTarget) == 0x000248, "Member 'UAthenaInventoryDropSlot_C::DropTarget' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDropSlot_C, DropTargetOverlay) == 0x000250, "Member 'UAthenaInventoryDropSlot_C::DropTargetOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDropSlot_C, EmptyImage) == 0x000258, "Member 'UAthenaInventoryDropSlot_C::EmptyImage' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDropSlot_C, InputActionOverlay) == 0x000260, "Member 'UAthenaInventoryDropSlot_C::InputActionOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDropSlot_C, InputActionWidget) == 0x000268, "Member 'UAthenaInventoryDropSlot_C::InputActionWidget' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDropSlot_C, Selection) == 0x000270, "Member 'UAthenaInventoryDropSlot_C::Selection' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDropSlot_C, SlotIndex) == 0x000278, "Member 'UAthenaInventoryDropSlot_C::SlotIndex' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDropSlot_C, OnEquipRequested) == 0x000280, "Member 'UAthenaInventoryDropSlot_C::OnEquipRequested' has a wrong offset!");

}

