#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuickbarPrimary

#include "Basic.hpp"

#include "QuickbarBase_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaQuickbarPrimary.AthenaQuickbarPrimary_C
// 0x0078 (0x0300 - 0x0288)
class UAthenaQuickbarPrimary_C final : public UQuickbarBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AthenaQuickbarPrimary_C;            // 0x0288(0x0008)(Transient, DuplicateTransient)
	class UQuickbarSlot_C*                        Quickbar_Slot_1;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuickbarSlot_C*                        Quickbar_Slot_2;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuickbarSlot_C*                        Quickbar_Slot_3;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuickbarSlot_C*                        Quickbar_Slot_4;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlot5;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlot6;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_WeaponsRail;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBP1;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBP2;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBP3;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBP4;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBP5;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBP6;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentWeaponSlot;                                 // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaQuickbarPrimary(int32 EntryPoint);
	void OnQuickbarContentsChanged(EFortQuickBars QuickbarIndex);
	void Construct();
	void Minimize();
	void Maximize();
	void OnQuickBarSlotFocusChanged_Bind(EFortQuickBars QuickbarIndex, int32 Slot_0);
	void Destruct();
	void HandleInputMethodChanged_Bind(bool bUsingGamepad);
	void HandleKeybindsChanged();
	void Show_Primary_Quickbar_Rail(bool Show);
	void HasOneNonHarvestWeapon(bool* HasNonHarvestWeapon);
	void HandleUpdateSlots();
	void HandleShowHideWeaponRail();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaQuickbarPrimary_C">();
	}
	static class UAthenaQuickbarPrimary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaQuickbarPrimary_C>();
	}
};
static_assert(alignof(UAthenaQuickbarPrimary_C) == 0x000008, "Wrong alignment on UAthenaQuickbarPrimary_C");
static_assert(sizeof(UAthenaQuickbarPrimary_C) == 0x000300, "Wrong size on UAthenaQuickbarPrimary_C");
static_assert(offsetof(UAthenaQuickbarPrimary_C, UberGraphFrame_AthenaQuickbarPrimary_C) == 0x000288, "Member 'UAthenaQuickbarPrimary_C::UberGraphFrame_AthenaQuickbarPrimary_C' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, Quickbar_Slot_1) == 0x000290, "Member 'UAthenaQuickbarPrimary_C::Quickbar_Slot_1' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, Quickbar_Slot_2) == 0x000298, "Member 'UAthenaQuickbarPrimary_C::Quickbar_Slot_2' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, Quickbar_Slot_3) == 0x0002A0, "Member 'UAthenaQuickbarPrimary_C::Quickbar_Slot_3' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, Quickbar_Slot_4) == 0x0002A8, "Member 'UAthenaQuickbarPrimary_C::Quickbar_Slot_4' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, QuickbarSlot5) == 0x0002B0, "Member 'UAthenaQuickbarPrimary_C::QuickbarSlot5' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, QuickbarSlot6) == 0x0002B8, "Member 'UAthenaQuickbarPrimary_C::QuickbarSlot6' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, SizeBox_WeaponsRail) == 0x0002C0, "Member 'UAthenaQuickbarPrimary_C::SizeBox_WeaponsRail' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, TutorialQBP1) == 0x0002C8, "Member 'UAthenaQuickbarPrimary_C::TutorialQBP1' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, TutorialQBP2) == 0x0002D0, "Member 'UAthenaQuickbarPrimary_C::TutorialQBP2' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, TutorialQBP3) == 0x0002D8, "Member 'UAthenaQuickbarPrimary_C::TutorialQBP3' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, TutorialQBP4) == 0x0002E0, "Member 'UAthenaQuickbarPrimary_C::TutorialQBP4' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, TutorialQBP5) == 0x0002E8, "Member 'UAthenaQuickbarPrimary_C::TutorialQBP5' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, TutorialQBP6) == 0x0002F0, "Member 'UAthenaQuickbarPrimary_C::TutorialQBP6' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, CurrentWeaponSlot) == 0x0002F8, "Member 'UAthenaQuickbarPrimary_C::CurrentWeaponSlot' has a wrong offset!");

}

