#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLeaderboardTabButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLeaderboardTabButton.AthenaLeaderboardTabButton_C
// 0x0100 (0x09A0 - 0x08A0)
class UAthenaLeaderboardTabButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08A0(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x08A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentHB;                                         // 0x08B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftSideImage;                                     // 0x08B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x08C0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateBrush                            IconBrush;                                         // 0x08D8(0x0090)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          UseText;                                           // 0x0968(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_969[0x3];                                      // 0x0969(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           SelectedIconTint;                                  // 0x096C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DeselectedIconTint;                                // 0x097C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoveredIconTint;                                   // 0x098C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBangEnabled;                                      // 0x099C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AthenaLeaderboardTabButton(int32 EntryPoint);
	void OnUnhovered();
	void OnHovered();
	void Construct();
	void OnDeselected();
	void OnSelected();
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);
	void OnCurrentTextStyleChanged();
	void PreConstruct(bool IsDesignTime);
	void Set_Text(const class FText& ButtonText_0);
	void Set_Icon(const struct FSlateBrush& IconBrush_0);
	void ShowText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLeaderboardTabButton_C">();
	}
	static class UAthenaLeaderboardTabButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLeaderboardTabButton_C>();
	}
};
static_assert(alignof(UAthenaLeaderboardTabButton_C) == 0x000008, "Wrong alignment on UAthenaLeaderboardTabButton_C");
static_assert(sizeof(UAthenaLeaderboardTabButton_C) == 0x0009A0, "Wrong size on UAthenaLeaderboardTabButton_C");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, UberGraphFrame) == 0x0008A0, "Member 'UAthenaLeaderboardTabButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, CenterButtonTextWidget) == 0x0008A8, "Member 'UAthenaLeaderboardTabButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, ContentHB) == 0x0008B0, "Member 'UAthenaLeaderboardTabButton_C::ContentHB' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, LeftSideImage) == 0x0008B8, "Member 'UAthenaLeaderboardTabButton_C::LeftSideImage' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, ButtonText) == 0x0008C0, "Member 'UAthenaLeaderboardTabButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, IconBrush) == 0x0008D8, "Member 'UAthenaLeaderboardTabButton_C::IconBrush' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, UseText) == 0x000968, "Member 'UAthenaLeaderboardTabButton_C::UseText' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, SelectedIconTint) == 0x00096C, "Member 'UAthenaLeaderboardTabButton_C::SelectedIconTint' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, DeselectedIconTint) == 0x00097C, "Member 'UAthenaLeaderboardTabButton_C::DeselectedIconTint' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, HoveredIconTint) == 0x00098C, "Member 'UAthenaLeaderboardTabButton_C::HoveredIconTint' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, bBangEnabled) == 0x00099C, "Member 'UAthenaLeaderboardTabButton_C::bBangEnabled' has a wrong offset!");

}

