#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaWinWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaWinWidget.AthenaWinWidget_C
// 0x0088 (0x0468 - 0x03E0)
class UAthenaWinWidget_C final : public UCommonActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(Transient, DuplicateTransient)
	class UAthenaKillFeedWidget_C*                AthenaKillFeedWidget;                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaKillsWidget_C*                   AthenaKillsWidget_78;                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaPlayersLeftWidget_C*             AthenaPlayersLeftWidget_65;                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_PrimaryDeathText;                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      LeaveButton;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           RespawnTimerHandle;                                // 0x0418(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                         ReleaseTimeRemaining;                              // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReadyToRespawnText;                                // 0x0428(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           ShowExtraLivesTimerHandle;                         // 0x0440(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                         ResurrectTimeRemaining;                            // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PlacePrefixText;                                   // 0x0450(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaWinWidget(int32 EntryPoint);
	void OnActivated();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__LeaveButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaWinWidget_C">();
	}
	static class UAthenaWinWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWinWidget_C>();
	}
};
static_assert(alignof(UAthenaWinWidget_C) == 0x000008, "Wrong alignment on UAthenaWinWidget_C");
static_assert(sizeof(UAthenaWinWidget_C) == 0x000468, "Wrong size on UAthenaWinWidget_C");
static_assert(offsetof(UAthenaWinWidget_C, UberGraphFrame) == 0x0003E0, "Member 'UAthenaWinWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaWinWidget_C, AthenaKillFeedWidget) == 0x0003E8, "Member 'UAthenaWinWidget_C::AthenaKillFeedWidget' has a wrong offset!");
static_assert(offsetof(UAthenaWinWidget_C, AthenaKillsWidget_78) == 0x0003F0, "Member 'UAthenaWinWidget_C::AthenaKillsWidget_78' has a wrong offset!");
static_assert(offsetof(UAthenaWinWidget_C, AthenaPlayersLeftWidget_65) == 0x0003F8, "Member 'UAthenaWinWidget_C::AthenaPlayersLeftWidget_65' has a wrong offset!");
static_assert(offsetof(UAthenaWinWidget_C, CommonTextBlock_PrimaryDeathText) == 0x000400, "Member 'UAthenaWinWidget_C::CommonTextBlock_PrimaryDeathText' has a wrong offset!");
static_assert(offsetof(UAthenaWinWidget_C, Image_0) == 0x000408, "Member 'UAthenaWinWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(UAthenaWinWidget_C, LeaveButton) == 0x000410, "Member 'UAthenaWinWidget_C::LeaveButton' has a wrong offset!");
static_assert(offsetof(UAthenaWinWidget_C, RespawnTimerHandle) == 0x000418, "Member 'UAthenaWinWidget_C::RespawnTimerHandle' has a wrong offset!");
static_assert(offsetof(UAthenaWinWidget_C, ReleaseTimeRemaining) == 0x000420, "Member 'UAthenaWinWidget_C::ReleaseTimeRemaining' has a wrong offset!");
static_assert(offsetof(UAthenaWinWidget_C, ReadyToRespawnText) == 0x000428, "Member 'UAthenaWinWidget_C::ReadyToRespawnText' has a wrong offset!");
static_assert(offsetof(UAthenaWinWidget_C, ShowExtraLivesTimerHandle) == 0x000440, "Member 'UAthenaWinWidget_C::ShowExtraLivesTimerHandle' has a wrong offset!");
static_assert(offsetof(UAthenaWinWidget_C, ResurrectTimeRemaining) == 0x000448, "Member 'UAthenaWinWidget_C::ResurrectTimeRemaining' has a wrong offset!");
static_assert(offsetof(UAthenaWinWidget_C, PlacePrefixText) == 0x000450, "Member 'UAthenaWinWidget_C::PlacePrefixText' has a wrong offset!");

}

