#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaStatsTab

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AthenaStatsTab.AthenaStatsTab_C.ExecuteUbergraph_AthenaStatsTab
// 0x00C8 (0x00C8 - 0x0000)
struct AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortLeaderboardContext*                CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanShowStats_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasSuccessful;                       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetWinsTag_ReturnValue;                   // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSecondTierPlaceTag_ReturnValue;        // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetThirdTierPlaceTag_ReturnValue;         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0068(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value2;                          // 0x0088(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue2;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value3;                          // 0x00A8(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue3;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab) == 0x000008, "Wrong alignment on AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab");
static_assert(sizeof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab) == 0x0000C8, "Wrong size on AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, EntryPoint) == 0x000000, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_IsActivated_ReturnValue) == 0x000004, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, Temp_bool_Variable) == 0x000005, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, Temp_int_Variable) == 0x000008, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, Temp_int_Variable2) == 0x00000C, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_CanShowStats_ReturnValue) == 0x000018, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_CanShowStats_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetContext_ReturnValue2) == 0x000020, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_Select_Default) == 0x000028, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_Event_bWasSuccessful) == 0x00002C, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_Event_bWasSuccessful' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_ComponentBoundEvent_TabId) == 0x000030, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetWinsTag_ReturnValue) == 0x000038, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetWinsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetSecondTierPlaceTag_ReturnValue) == 0x000048, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetSecondTierPlaceTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetThirdTierPlaceTag_ReturnValue) == 0x000058, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetThirdTierPlaceTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_Map_Find_Value) == 0x000068, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_Map_Find_ReturnValue) == 0x000080, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_Map_Find_Value2) == 0x000088, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_Map_Find_Value2' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_Map_Find_ReturnValue2) == 0x0000A0, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_Map_Find_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_Map_Find_Value3) == 0x0000A8, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_Map_Find_Value3' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_Map_Find_ReturnValue3) == 0x0000C0, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_Map_Find_ReturnValue3' has a wrong offset!");

// Function AthenaStatsTab.AthenaStatsTab_C.BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) AthenaStatsTab_C_BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaStatsTab_C_BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature) == 0x000008, "Wrong alignment on AthenaStatsTab_C_BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature");
static_assert(sizeof(AthenaStatsTab_C_BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature) == 0x000008, "Wrong size on AthenaStatsTab_C_BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature");
static_assert(offsetof(AthenaStatsTab_C_BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature, TabId) == 0x000000, "Member 'AthenaStatsTab_C_BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature::TabId' has a wrong offset!");

// Function AthenaStatsTab.AthenaStatsTab_C.OnQueryFinished
// 0x0001 (0x0001 - 0x0000)
struct AthenaStatsTab_C_OnQueryFinished final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaStatsTab_C_OnQueryFinished) == 0x000001, "Wrong alignment on AthenaStatsTab_C_OnQueryFinished");
static_assert(sizeof(AthenaStatsTab_C_OnQueryFinished) == 0x000001, "Wrong size on AthenaStatsTab_C_OnQueryFinished");
static_assert(offsetof(AthenaStatsTab_C_OnQueryFinished, bWasSuccessful) == 0x000000, "Member 'AthenaStatsTab_C_OnQueryFinished::bWasSuccessful' has a wrong offset!");

// Function AthenaStatsTab.AthenaStatsTab_C.UpdateStats
// 0x00F8 (0x00F8 - 0x0000)
struct AthenaStatsTab_C_UpdateStats final
{
public:
	int32                                         CallFunc_GetStatValue_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue;                 // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStatValue_ReturnValue2;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatStatValueAsElapsedTime_ReturnValue; // 0x0018(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	int32                                         CallFunc_GetStatValue_ReturnValue3;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue2;              // 0x0050(0x0018)()
	class FString                                 CallFunc_GetThirdTierPlaceTag_ReturnValue;         // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStatValue_ReturnValue4;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSecondTierPlaceTag_ReturnValue;        // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue3;              // 0x0090(0x0018)()
	int32                                         CallFunc_GetStatValue_ReturnValue5;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue4;              // 0x00B0(0x0018)()
	class FString                                 CallFunc_GetWinsTag_ReturnValue;                   // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStatValue_ReturnValue6;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue5;              // 0x00E0(0x0018)()
};
static_assert(alignof(AthenaStatsTab_C_UpdateStats) == 0x000008, "Wrong alignment on AthenaStatsTab_C_UpdateStats");
static_assert(sizeof(AthenaStatsTab_C_UpdateStats) == 0x0000F8, "Wrong size on AthenaStatsTab_C_UpdateStats");
static_assert(offsetof(AthenaStatsTab_C_UpdateStats, CallFunc_GetStatValue_ReturnValue) == 0x000000, "Member 'AthenaStatsTab_C_UpdateStats::CallFunc_GetStatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_UpdateStats, CallFunc_MakeTimespan_ReturnValue) == 0x000008, "Member 'AthenaStatsTab_C_UpdateStats::CallFunc_MakeTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_UpdateStats, CallFunc_GetStatValue_ReturnValue2) == 0x000010, "Member 'AthenaStatsTab_C_UpdateStats::CallFunc_GetStatValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_UpdateStats, CallFunc_FormatStatValueAsElapsedTime_ReturnValue) == 0x000018, "Member 'AthenaStatsTab_C_UpdateStats::CallFunc_FormatStatValueAsElapsedTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_UpdateStats, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'AthenaStatsTab_C_UpdateStats::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_UpdateStats, CallFunc_GetStatValue_ReturnValue3) == 0x000048, "Member 'AthenaStatsTab_C_UpdateStats::CallFunc_GetStatValue_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_UpdateStats, CallFunc_Conv_IntToText_ReturnValue2) == 0x000050, "Member 'AthenaStatsTab_C_UpdateStats::CallFunc_Conv_IntToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_UpdateStats, CallFunc_GetThirdTierPlaceTag_ReturnValue) == 0x000068, "Member 'AthenaStatsTab_C_UpdateStats::CallFunc_GetThirdTierPlaceTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_UpdateStats, CallFunc_GetStatValue_ReturnValue4) == 0x000078, "Member 'AthenaStatsTab_C_UpdateStats::CallFunc_GetStatValue_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_UpdateStats, CallFunc_GetSecondTierPlaceTag_ReturnValue) == 0x000080, "Member 'AthenaStatsTab_C_UpdateStats::CallFunc_GetSecondTierPlaceTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_UpdateStats, CallFunc_Conv_IntToText_ReturnValue3) == 0x000090, "Member 'AthenaStatsTab_C_UpdateStats::CallFunc_Conv_IntToText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_UpdateStats, CallFunc_GetStatValue_ReturnValue5) == 0x0000A8, "Member 'AthenaStatsTab_C_UpdateStats::CallFunc_GetStatValue_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_UpdateStats, CallFunc_Conv_IntToText_ReturnValue4) == 0x0000B0, "Member 'AthenaStatsTab_C_UpdateStats::CallFunc_Conv_IntToText_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_UpdateStats, CallFunc_GetWinsTag_ReturnValue) == 0x0000C8, "Member 'AthenaStatsTab_C_UpdateStats::CallFunc_GetWinsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_UpdateStats, CallFunc_GetStatValue_ReturnValue6) == 0x0000D8, "Member 'AthenaStatsTab_C_UpdateStats::CallFunc_GetStatValue_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_UpdateStats, CallFunc_Conv_IntToText_ReturnValue5) == 0x0000E0, "Member 'AthenaStatsTab_C_UpdateStats::CallFunc_Conv_IntToText_ReturnValue5' has a wrong offset!");

// Function AthenaStatsTab.AthenaStatsTab_C.UpdateLastUpdatedTime
// 0x0020 (0x0020 - 0x0000)
struct AthenaStatsTab_C_UpdateLastUpdatedTime final
{
public:
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLastUpdateTime_ReturnValue;            // 0x0008(0x0018)()
};
static_assert(alignof(AthenaStatsTab_C_UpdateLastUpdatedTime) == 0x000008, "Wrong alignment on AthenaStatsTab_C_UpdateLastUpdatedTime");
static_assert(sizeof(AthenaStatsTab_C_UpdateLastUpdatedTime) == 0x000020, "Wrong size on AthenaStatsTab_C_UpdateLastUpdatedTime");
static_assert(offsetof(AthenaStatsTab_C_UpdateLastUpdatedTime, CallFunc_IsActivated_ReturnValue) == 0x000000, "Member 'AthenaStatsTab_C_UpdateLastUpdatedTime::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_UpdateLastUpdatedTime, CallFunc_GetLastUpdateTime_ReturnValue) == 0x000008, "Member 'AthenaStatsTab_C_UpdateLastUpdatedTime::CallFunc_GetLastUpdateTime_ReturnValue' has a wrong offset!");

}

