#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTeamInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaTeamInfo.AthenaTeamInfo_C
// 0x0020 (0x0280 - 0x0260)
class UAthenaTeamInfo_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(Transient, DuplicateTransient)
	class UVerticalBox*                           _Vertical_Box__Team_Members;                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UAthenaTeamMemberInfo_C*>        TeamMembers;                                       // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaTeamInfo(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void HandlePartyLeft();
	void Construct();
	void AppendTeamMember(class AFortPlayerStateAthena* PlayerState, int32 PlayerIndex);
	void ClearContents();
	void HandleTeamHitInfoChanged(TArray<float>& HealthFractions, TArray<float>& ShieldFractions);
	void HandleTeamMemberAdded();
	void HandleTeamDBNOChanged(TArray<bool>& TeamDBNO);
	void HandleTeamDeadChanged(TArray<bool>& TeamDead);
	void HandleTeamMemberPlayerNamesChanged();
	void HandleTeamRevivingChanged(TArray<bool>& TeamReviving);
	void HandleTeamMemberRemoved();
	void HandleTeamTalkingChanged(TArray<bool>& TeamTalking);
	void HandleTeamMutedChanged(TArray<bool>& TeamMuted);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaTeamInfo_C">();
	}
	static class UAthenaTeamInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaTeamInfo_C>();
	}
};
static_assert(alignof(UAthenaTeamInfo_C) == 0x000008, "Wrong alignment on UAthenaTeamInfo_C");
static_assert(sizeof(UAthenaTeamInfo_C) == 0x000280, "Wrong size on UAthenaTeamInfo_C");
static_assert(offsetof(UAthenaTeamInfo_C, UberGraphFrame) == 0x000260, "Member 'UAthenaTeamInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaTeamInfo_C, _Vertical_Box__Team_Members) == 0x000268, "Member 'UAthenaTeamInfo_C::_Vertical_Box__Team_Members' has a wrong offset!");
static_assert(offsetof(UAthenaTeamInfo_C, TeamMembers) == 0x000270, "Member 'UAthenaTeamInfo_C::TeamMembers' has a wrong offset!");

}

