#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLobby

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaLobby.AthenaLobby_C.ExecuteUbergraph_AthenaLobby
// 0x00A0 (0x00A0 - 0x0000)
struct AthenaLobby_C_ExecuteUbergraph_AthenaLobby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue4;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue5;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_ActiveWidget;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ActiveWidgetIndex;      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerIndex3;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue6;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerIndex2;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PlayerIndex;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby) == 0x000008, "Wrong alignment on AthenaLobby_C_ExecuteUbergraph_AthenaLobby");
static_assert(sizeof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby) == 0x0000A0, "Wrong size on AthenaLobby_C_ExecuteUbergraph_AthenaLobby");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, EntryPoint) == 0x000000, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue3) == 0x000018, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue4) == 0x000020, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_IsUsingGamepad_ReturnValue) == 0x000028, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue5) == 0x000030, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_ComponentBoundEvent_ActiveWidget) == 0x000038, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_ComponentBoundEvent_ActiveWidget' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_ComponentBoundEvent_ActiveWidgetIndex) == 0x000040, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_ComponentBoundEvent_ActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_Event_PlayerIndex3) == 0x000044, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_Event_PlayerIndex3' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue6) == 0x000048, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue) == 0x000050, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000058, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, Temp_byte_Variable) == 0x00005A, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_SwitchEnum_CmpSuccess) == 0x00005B, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, Temp_name_Variable) == 0x000060, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_ComponentBoundEvent_Button) == 0x000068, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_CustomEvent_Result) == 0x000070, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_CustomEvent_ResultName) == 0x000078, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_Event_PlayerIndex2) == 0x000080, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_Event_PlayerIndex2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_CreateDelegate_OutputDelegate) == 0x000088, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000098, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_Event_PlayerIndex) == 0x00009C, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_Event_PlayerIndex' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnBeginCursorOverPlayer
// 0x0004 (0x0004 - 0x0000)
struct AthenaLobby_C_OnBeginCursorOverPlayer final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_OnBeginCursorOverPlayer) == 0x000004, "Wrong alignment on AthenaLobby_C_OnBeginCursorOverPlayer");
static_assert(sizeof(AthenaLobby_C_OnBeginCursorOverPlayer) == 0x000004, "Wrong size on AthenaLobby_C_OnBeginCursorOverPlayer");
static_assert(offsetof(AthenaLobby_C_OnBeginCursorOverPlayer, PlayerIndex) == 0x000000, "Member 'AthenaLobby_C_OnBeginCursorOverPlayer::PlayerIndex' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnPlayerClicked
// 0x0004 (0x0004 - 0x0000)
struct AthenaLobby_C_OnPlayerClicked final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_OnPlayerClicked) == 0x000004, "Wrong alignment on AthenaLobby_C_OnPlayerClicked");
static_assert(sizeof(AthenaLobby_C_OnPlayerClicked) == 0x000004, "Wrong size on AthenaLobby_C_OnPlayerClicked");
static_assert(offsetof(AthenaLobby_C_OnPlayerClicked, PlayerIndex) == 0x000000, "Member 'AthenaLobby_C_OnPlayerClicked::PlayerIndex' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaLobby_C_BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLobby_C_BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaLobby_C_BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaLobby_C_BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaLobby_C_BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaLobby_C_BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnEndCursorOverPlayer
// 0x0004 (0x0004 - 0x0000)
struct AthenaLobby_C_OnEndCursorOverPlayer final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_OnEndCursorOverPlayer) == 0x000004, "Wrong alignment on AthenaLobby_C_OnEndCursorOverPlayer");
static_assert(sizeof(AthenaLobby_C_OnEndCursorOverPlayer) == 0x000004, "Wrong size on AthenaLobby_C_OnEndCursorOverPlayer");
static_assert(offsetof(AthenaLobby_C_OnEndCursorOverPlayer, PlayerIndex) == 0x000000, "Member 'AthenaLobby_C_OnEndCursorOverPlayer::PlayerIndex' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature final
{
public:
	class UWidget*                                ActiveWidget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveWidgetIndex;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature");
static_assert(sizeof(AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature) == 0x000010, "Wrong size on AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature");
static_assert(offsetof(AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature, ActiveWidget) == 0x000000, "Member 'AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature::ActiveWidget' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature, ActiveWidgetIndex) == 0x000008, "Member 'AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature::ActiveWidgetIndex' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.DialogResult_156754AE468EF93DCA2009A412591BA7
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7 final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7) == 0x000008, "Wrong alignment on AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7");
static_assert(sizeof(AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7) == 0x000010, "Wrong size on AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7");
static_assert(offsetof(AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7, Result) == 0x000000, "Member 'AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7::Result' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7, ResultName) == 0x000008, "Member 'AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7::ResultName' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnTeamMemberAdded
// 0x0198 (0x0198 - 0x0000)
struct AthenaLobby_C_OnTeamMemberAdded final
{
public:
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x0000(0x0190)(Parm)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_OnTeamMemberAdded) == 0x000008, "Wrong alignment on AthenaLobby_C_OnTeamMemberAdded");
static_assert(sizeof(AthenaLobby_C_OnTeamMemberAdded) == 0x000198, "Wrong size on AthenaLobby_C_OnTeamMemberAdded");
static_assert(offsetof(AthenaLobby_C_OnTeamMemberAdded, TeamMemberInfo) == 0x000000, "Member 'AthenaLobby_C_OnTeamMemberAdded::TeamMemberInfo' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnTeamMemberAdded, CallFunc_IsActivated_ReturnValue) == 0x000190, "Member 'AthenaLobby_C_OnTeamMemberAdded::CallFunc_IsActivated_ReturnValue' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnTeamMemberRemoved
// 0x0008 (0x0008 - 0x0000)
struct AthenaLobby_C_OnTeamMemberRemoved final
{
public:
	int32                                         EmptySlot;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_OnTeamMemberRemoved) == 0x000004, "Wrong alignment on AthenaLobby_C_OnTeamMemberRemoved");
static_assert(sizeof(AthenaLobby_C_OnTeamMemberRemoved) == 0x000008, "Wrong size on AthenaLobby_C_OnTeamMemberRemoved");
static_assert(offsetof(AthenaLobby_C_OnTeamMemberRemoved, EmptySlot) == 0x000000, "Member 'AthenaLobby_C_OnTeamMemberRemoved::EmptySlot' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnTeamMemberRemoved, CallFunc_IsActivated_ReturnValue) == 0x000004, "Member 'AthenaLobby_C_OnTeamMemberRemoved::CallFunc_IsActivated_ReturnValue' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnTeamMemberStateChanged
// 0x0190 (0x0190 - 0x0000)
struct AthenaLobby_C_OnTeamMemberStateChanged final
{
public:
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x0000(0x0190)(Parm)
};
static_assert(alignof(AthenaLobby_C_OnTeamMemberStateChanged) == 0x000008, "Wrong alignment on AthenaLobby_C_OnTeamMemberStateChanged");
static_assert(sizeof(AthenaLobby_C_OnTeamMemberStateChanged) == 0x000190, "Wrong size on AthenaLobby_C_OnTeamMemberStateChanged");
static_assert(offsetof(AthenaLobby_C_OnTeamMemberStateChanged, TeamMemberInfo) == 0x000000, "Member 'AthenaLobby_C_OnTeamMemberStateChanged::TeamMemberInfo' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.RefreshPlayerHeroes
// 0x01E8 (0x01E8 - 0x0000)
struct AthenaLobby_C_RefreshPlayerHeroes final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    CallFunc_Array_Get_Item;                           // 0x0018(0x0190)()
	class UFortHero*                              K2Node_DynamicCast_AsFort_Hero;                    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortTeamMemberInfo>            CallFunc_GetTeamMembers_TeamMembers;               // 0x01D0(0x0010)(ZeroConstructor, ReferenceParm)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_RefreshPlayerHeroes) == 0x000008, "Wrong alignment on AthenaLobby_C_RefreshPlayerHeroes");
static_assert(sizeof(AthenaLobby_C_RefreshPlayerHeroes) == 0x0001E8, "Wrong size on AthenaLobby_C_RefreshPlayerHeroes");
static_assert(offsetof(AthenaLobby_C_RefreshPlayerHeroes, Index_0) == 0x000000, "Member 'AthenaLobby_C_RefreshPlayerHeroes::Index_0' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshPlayerHeroes, Temp_int_Variable) == 0x000004, "Member 'AthenaLobby_C_RefreshPlayerHeroes::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshPlayerHeroes, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaLobby_C_RefreshPlayerHeroes::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshPlayerHeroes, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'AthenaLobby_C_RefreshPlayerHeroes::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshPlayerHeroes, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'AthenaLobby_C_RefreshPlayerHeroes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshPlayerHeroes, CallFunc_Array_Get_Item) == 0x000018, "Member 'AthenaLobby_C_RefreshPlayerHeroes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshPlayerHeroes, K2Node_DynamicCast_AsFort_Hero) == 0x0001A8, "Member 'AthenaLobby_C_RefreshPlayerHeroes::K2Node_DynamicCast_AsFort_Hero' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshPlayerHeroes, K2Node_DynamicCast_bSuccess) == 0x0001B0, "Member 'AthenaLobby_C_RefreshPlayerHeroes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshPlayerHeroes, CallFunc_GetContext_ReturnValue2) == 0x0001B8, "Member 'AthenaLobby_C_RefreshPlayerHeroes::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshPlayerHeroes, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x0001C0, "Member 'AthenaLobby_C_RefreshPlayerHeroes::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshPlayerHeroes, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0001C8, "Member 'AthenaLobby_C_RefreshPlayerHeroes::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshPlayerHeroes, CallFunc_GetTeamMembers_TeamMembers) == 0x0001D0, "Member 'AthenaLobby_C_RefreshPlayerHeroes::CallFunc_GetTeamMembers_TeamMembers' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshPlayerHeroes, CallFunc_GetContext_ReturnValue3) == 0x0001E0, "Member 'AthenaLobby_C_RefreshPlayerHeroes::CallFunc_GetContext_ReturnValue3' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnInputCancel
// 0x0002 (0x0002 - 0x0000)
struct AthenaLobby_C_OnInputCancel final
{
public:
	bool                                          bCommited;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_OnInputCancel) == 0x000001, "Wrong alignment on AthenaLobby_C_OnInputCancel");
static_assert(sizeof(AthenaLobby_C_OnInputCancel) == 0x000002, "Wrong size on AthenaLobby_C_OnInputCancel");
static_assert(offsetof(AthenaLobby_C_OnInputCancel, bCommited) == 0x000000, "Member 'AthenaLobby_C_OnInputCancel::bCommited' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnInputCancel, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'AthenaLobby_C_OnInputCancel::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.Focus
// 0x0018 (0x0018 - 0x0000)
struct AthenaLobby_C_Focus final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_Focus) == 0x000008, "Wrong alignment on AthenaLobby_C_Focus");
static_assert(sizeof(AthenaLobby_C_Focus) == 0x000018, "Wrong size on AthenaLobby_C_Focus");
static_assert(offsetof(AthenaLobby_C_Focus, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'AthenaLobby_C_Focus::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_Focus, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaLobby_C_Focus::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_Focus, CallFunc_IsVisible_ReturnValue) == 0x000010, "Member 'AthenaLobby_C_Focus::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.InitializeContextEvents
// 0x00B8 (0x00B8 - 0x0000)
struct AthenaLobby_C_InitializeContextEvents final
{
public:
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate2;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate3;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate4;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue2;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFortTeamMemberInfo& TeamMemberInfo)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate7;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FFortTeamMemberInfo& NewTeamMemberInfo)> K2Node_CreateDelegate_OutputDelegate8;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue4;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue5;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue6;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_InitializeContextEvents) == 0x000008, "Wrong alignment on AthenaLobby_C_InitializeContextEvents");
static_assert(sizeof(AthenaLobby_C_InitializeContextEvents) == 0x0000B8, "Wrong size on AthenaLobby_C_InitializeContextEvents");
static_assert(offsetof(AthenaLobby_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaLobby_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate2) == 0x000010, "Member 'AthenaLobby_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate3) == 0x000020, "Member 'AthenaLobby_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate4) == 0x000030, "Member 'AthenaLobby_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue) == 0x000040, "Member 'AthenaLobby_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate5) == 0x000048, "Member 'AthenaLobby_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_InitializeContextEvents, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000058, "Member 'AthenaLobby_C_InitializeContextEvents::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue2) == 0x000060, "Member 'AthenaLobby_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate6) == 0x000068, "Member 'AthenaLobby_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate7) == 0x000078, "Member 'AthenaLobby_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate8) == 0x000088, "Member 'AthenaLobby_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue3) == 0x000098, "Member 'AthenaLobby_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue4) == 0x0000A0, "Member 'AthenaLobby_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue5) == 0x0000A8, "Member 'AthenaLobby_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue6) == 0x0000B0, "Member 'AthenaLobby_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue6' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnInputAbandon
// 0x0001 (0x0001 - 0x0000)
struct AthenaLobby_C_OnInputAbandon final
{
public:
	bool                                          bCommited;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_OnInputAbandon) == 0x000001, "Wrong alignment on AthenaLobby_C_OnInputAbandon");
static_assert(sizeof(AthenaLobby_C_OnInputAbandon) == 0x000001, "Wrong size on AthenaLobby_C_OnInputAbandon");
static_assert(offsetof(AthenaLobby_C_OnInputAbandon, bCommited) == 0x000000, "Member 'AthenaLobby_C_OnInputAbandon::bCommited' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.RefreshInput
// 0x000F (0x000F - 0x0000)
struct AthenaLobby_C_RefreshInput final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             Temp_byte_Variable5;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             Temp_byte_Variable6;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldAddCancel_bShouldAdd;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldAddScroll_bShouldAdd;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             K2Node_Select2_Default;                            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldAddCancel_bShouldAdd2;              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             K2Node_Select3_Default;                            // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_RefreshInput) == 0x000001, "Wrong alignment on AthenaLobby_C_RefreshInput");
static_assert(sizeof(AthenaLobby_C_RefreshInput) == 0x00000F, "Wrong size on AthenaLobby_C_RefreshInput");
static_assert(offsetof(AthenaLobby_C_RefreshInput, Temp_bool_Variable) == 0x000000, "Member 'AthenaLobby_C_RefreshInput::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshInput, Temp_byte_Variable) == 0x000001, "Member 'AthenaLobby_C_RefreshInput::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshInput, Temp_byte_Variable2) == 0x000002, "Member 'AthenaLobby_C_RefreshInput::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshInput, Temp_bool_Variable2) == 0x000003, "Member 'AthenaLobby_C_RefreshInput::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshInput, Temp_byte_Variable3) == 0x000004, "Member 'AthenaLobby_C_RefreshInput::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshInput, Temp_byte_Variable4) == 0x000005, "Member 'AthenaLobby_C_RefreshInput::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshInput, Temp_bool_Variable3) == 0x000006, "Member 'AthenaLobby_C_RefreshInput::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshInput, Temp_byte_Variable5) == 0x000007, "Member 'AthenaLobby_C_RefreshInput::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshInput, Temp_byte_Variable6) == 0x000008, "Member 'AthenaLobby_C_RefreshInput::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshInput, CallFunc_ShouldAddCancel_bShouldAdd) == 0x000009, "Member 'AthenaLobby_C_RefreshInput::CallFunc_ShouldAddCancel_bShouldAdd' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshInput, CallFunc_ShouldAddScroll_bShouldAdd) == 0x00000A, "Member 'AthenaLobby_C_RefreshInput::CallFunc_ShouldAddScroll_bShouldAdd' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshInput, K2Node_Select_Default) == 0x00000B, "Member 'AthenaLobby_C_RefreshInput::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshInput, K2Node_Select2_Default) == 0x00000C, "Member 'AthenaLobby_C_RefreshInput::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshInput, CallFunc_ShouldAddCancel_bShouldAdd2) == 0x00000D, "Member 'AthenaLobby_C_RefreshInput::CallFunc_ShouldAddCancel_bShouldAdd2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_RefreshInput, K2Node_Select3_Default) == 0x00000E, "Member 'AthenaLobby_C_RefreshInput::K2Node_Select3_Default' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.ShouldAddCancel
// 0x0002 (0x0002 - 0x0000)
struct AthenaLobby_C_ShouldAddCancel final
{
public:
	bool                                          bShouldAdd;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_ShouldAddCancel) == 0x000001, "Wrong alignment on AthenaLobby_C_ShouldAddCancel");
static_assert(sizeof(AthenaLobby_C_ShouldAddCancel) == 0x000002, "Wrong size on AthenaLobby_C_ShouldAddCancel");
static_assert(offsetof(AthenaLobby_C_ShouldAddCancel, bShouldAdd) == 0x000000, "Member 'AthenaLobby_C_ShouldAddCancel::bShouldAdd' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ShouldAddCancel, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'AthenaLobby_C_ShouldAddCancel::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.ShouldAddScroll
// 0x0001 (0x0001 - 0x0000)
struct AthenaLobby_C_ShouldAddScroll final
{
public:
	bool                                          bShouldAdd;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_ShouldAddScroll) == 0x000001, "Wrong alignment on AthenaLobby_C_ShouldAddScroll");
static_assert(sizeof(AthenaLobby_C_ShouldAddScroll) == 0x000001, "Wrong size on AthenaLobby_C_ShouldAddScroll");
static_assert(offsetof(AthenaLobby_C_ShouldAddScroll, bShouldAdd) == 0x000000, "Member 'AthenaLobby_C_ShouldAddScroll::bShouldAdd' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnMouseButtonDown
// 0x0248 (0x0248 - 0x0000)
struct AthenaLobby_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_ShouldAddCancel_bShouldAdd;               // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0170(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnInputCancel_bCommited;                  // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0190(0x00B8)()
};
static_assert(alignof(AthenaLobby_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on AthenaLobby_C_OnMouseButtonDown");
static_assert(sizeof(AthenaLobby_C_OnMouseButtonDown) == 0x000248, "Wrong size on AthenaLobby_C_OnMouseButtonDown");
static_assert(offsetof(AthenaLobby_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'AthenaLobby_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'AthenaLobby_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'AthenaLobby_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnMouseButtonDown, CallFunc_ShouldAddCancel_bShouldAdd) == 0x000168, "Member 'AthenaLobby_C_OnMouseButtonDown::CallFunc_ShouldAddCancel_bShouldAdd' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000170, "Member 'AthenaLobby_C_OnMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnMouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000188, "Member 'AthenaLobby_C_OnMouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnMouseButtonDown, CallFunc_OnInputCancel_bCommited) == 0x000189, "Member 'AthenaLobby_C_OnMouseButtonDown::CallFunc_OnInputCancel_bCommited' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000190, "Member 'AthenaLobby_C_OnMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnLobbyDisconnected
// 0x0010 (0x0010 - 0x0000)
struct AthenaLobby_C_OnLobbyDisconnected final
{
public:
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_OnLobbyDisconnected) == 0x000008, "Wrong alignment on AthenaLobby_C_OnLobbyDisconnected");
static_assert(sizeof(AthenaLobby_C_OnLobbyDisconnected) == 0x000010, "Wrong size on AthenaLobby_C_OnLobbyDisconnected");
static_assert(offsetof(AthenaLobby_C_OnLobbyDisconnected, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'AthenaLobby_C_OnLobbyDisconnected::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnLobbyDisconnected, CallFunc_IsVisible_ReturnValue) == 0x000008, "Member 'AthenaLobby_C_OnLobbyDisconnected::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnLobbyEmptyPlayerClicked
// 0x0004 (0x0004 - 0x0000)
struct AthenaLobby_C_OnLobbyEmptyPlayerClicked final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_OnLobbyEmptyPlayerClicked) == 0x000004, "Wrong alignment on AthenaLobby_C_OnLobbyEmptyPlayerClicked");
static_assert(sizeof(AthenaLobby_C_OnLobbyEmptyPlayerClicked) == 0x000004, "Wrong size on AthenaLobby_C_OnLobbyEmptyPlayerClicked");
static_assert(offsetof(AthenaLobby_C_OnLobbyEmptyPlayerClicked, PlayerIndex) == 0x000000, "Member 'AthenaLobby_C_OnLobbyEmptyPlayerClicked::PlayerIndex' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnLobbyPlayerGadgetsClicked
// 0x0004 (0x0004 - 0x0000)
struct AthenaLobby_C_OnLobbyPlayerGadgetsClicked final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_OnLobbyPlayerGadgetsClicked) == 0x000004, "Wrong alignment on AthenaLobby_C_OnLobbyPlayerGadgetsClicked");
static_assert(sizeof(AthenaLobby_C_OnLobbyPlayerGadgetsClicked) == 0x000004, "Wrong size on AthenaLobby_C_OnLobbyPlayerGadgetsClicked");
static_assert(offsetof(AthenaLobby_C_OnLobbyPlayerGadgetsClicked, PlayerIndex) == 0x000000, "Member 'AthenaLobby_C_OnLobbyPlayerGadgetsClicked::PlayerIndex' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnLobbyPlayerPadHovered
// 0x0010 (0x0010 - 0x0000)
struct AthenaLobby_C_OnLobbyPlayerPadHovered final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_OnLobbyPlayerPadHovered) == 0x000008, "Wrong alignment on AthenaLobby_C_OnLobbyPlayerPadHovered");
static_assert(sizeof(AthenaLobby_C_OnLobbyPlayerPadHovered) == 0x000010, "Wrong size on AthenaLobby_C_OnLobbyPlayerPadHovered");
static_assert(offsetof(AthenaLobby_C_OnLobbyPlayerPadHovered, PlayerIndex) == 0x000000, "Member 'AthenaLobby_C_OnLobbyPlayerPadHovered::PlayerIndex' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnLobbyPlayerPadHovered, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaLobby_C_OnLobbyPlayerPadHovered::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnLobbyPlayerPadUnhovered
// 0x0018 (0x0018 - 0x0000)
struct AthenaLobby_C_OnLobbyPlayerPadUnhovered final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_OnLobbyPlayerPadUnhovered) == 0x000008, "Wrong alignment on AthenaLobby_C_OnLobbyPlayerPadUnhovered");
static_assert(sizeof(AthenaLobby_C_OnLobbyPlayerPadUnhovered) == 0x000018, "Wrong size on AthenaLobby_C_OnLobbyPlayerPadUnhovered");
static_assert(offsetof(AthenaLobby_C_OnLobbyPlayerPadUnhovered, PlayerIndex) == 0x000000, "Member 'AthenaLobby_C_OnLobbyPlayerPadUnhovered::PlayerIndex' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnLobbyPlayerPadUnhovered, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaLobby_C_OnLobbyPlayerPadUnhovered::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnLobbyPlayerPadUnhovered, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000010, "Member 'AthenaLobby_C_OnLobbyPlayerPadUnhovered::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.InitializeInput
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) AthenaLobby_C_InitializeInput final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate2;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate3;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_InitializeInput) == 0x000008, "Wrong alignment on AthenaLobby_C_InitializeInput");
static_assert(sizeof(AthenaLobby_C_InitializeInput) == 0x000030, "Wrong size on AthenaLobby_C_InitializeInput");
static_assert(offsetof(AthenaLobby_C_InitializeInput, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaLobby_C_InitializeInput::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_InitializeInput, K2Node_CreateDelegate_OutputDelegate2) == 0x000010, "Member 'AthenaLobby_C_InitializeInput::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_InitializeInput, K2Node_CreateDelegate_OutputDelegate3) == 0x000020, "Member 'AthenaLobby_C_InitializeInput::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.ShouldAddPlay
// 0x0003 (0x0003 - 0x0000)
struct AthenaLobby_C_ShouldAddPlay final
{
public:
	bool                                          bShouldAdd;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldAddCancel_bShouldAdd;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_ShouldAddPlay) == 0x000001, "Wrong alignment on AthenaLobby_C_ShouldAddPlay");
static_assert(sizeof(AthenaLobby_C_ShouldAddPlay) == 0x000003, "Wrong size on AthenaLobby_C_ShouldAddPlay");
static_assert(offsetof(AthenaLobby_C_ShouldAddPlay, bShouldAdd) == 0x000000, "Member 'AthenaLobby_C_ShouldAddPlay::bShouldAdd' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ShouldAddPlay, CallFunc_ShouldAddCancel_bShouldAdd) == 0x000001, "Member 'AthenaLobby_C_ShouldAddPlay::CallFunc_ShouldAddCancel_bShouldAdd' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ShouldAddPlay, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'AthenaLobby_C_ShouldAddPlay::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.StartMusic
// 0x0020 (0x0020 - 0x0000)
struct AthenaLobby_C_StartMusic final
{
public:
	TArray<class AFort_Entry_Music_Controller_BP_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0000(0x0010)(ZeroConstructor, ReferenceParm)
	class AFort_Entry_Music_Controller_BP_C*      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_StartMusic) == 0x000008, "Wrong alignment on AthenaLobby_C_StartMusic");
static_assert(sizeof(AthenaLobby_C_StartMusic) == 0x000020, "Wrong size on AthenaLobby_C_StartMusic");
static_assert(offsetof(AthenaLobby_C_StartMusic, CallFunc_GetAllActorsOfClass_OutActors) == 0x000000, "Member 'AthenaLobby_C_StartMusic::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_StartMusic, CallFunc_Array_Get_Item) == 0x000010, "Member 'AthenaLobby_C_StartMusic::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_StartMusic, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'AthenaLobby_C_StartMusic::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.HoverPreviousPlayer
// 0x0010 (0x0010 - 0x0000)
struct AthenaLobby_C_HoverPreviousPlayer final
{
public:
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_HoverPreviousPlayer) == 0x000004, "Wrong alignment on AthenaLobby_C_HoverPreviousPlayer");
static_assert(sizeof(AthenaLobby_C_HoverPreviousPlayer) == 0x000010, "Wrong size on AthenaLobby_C_HoverPreviousPlayer");
static_assert(offsetof(AthenaLobby_C_HoverPreviousPlayer, CallFunc_Array_Find_ReturnValue) == 0x000000, "Member 'AthenaLobby_C_HoverPreviousPlayer::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_HoverPreviousPlayer, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'AthenaLobby_C_HoverPreviousPlayer::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_HoverPreviousPlayer, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000008, "Member 'AthenaLobby_C_HoverPreviousPlayer::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_HoverPreviousPlayer, CallFunc_Array_Get_Item) == 0x00000C, "Member 'AthenaLobby_C_HoverPreviousPlayer::CallFunc_Array_Get_Item' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.HoverNextPlayer
// 0x0010 (0x0010 - 0x0000)
struct AthenaLobby_C_HoverNextPlayer final
{
public:
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
