#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaGamePhaseWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaGamePhaseWidget.AthenaGamePhaseWidget_C
// 0x0020 (0x0280 - 0x0260)
class UAthenaGamePhaseWidget_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Icon;                                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TimeText;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AAthena_GameState_C*                    GameState;                                         // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaGamePhaseWidget(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaGamePhaseWidget_C">();
	}
	static class UAthenaGamePhaseWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGamePhaseWidget_C>();
	}
};
static_assert(alignof(UAthenaGamePhaseWidget_C) == 0x000008, "Wrong alignment on UAthenaGamePhaseWidget_C");
static_assert(sizeof(UAthenaGamePhaseWidget_C) == 0x000280, "Wrong size on UAthenaGamePhaseWidget_C");
static_assert(offsetof(UAthenaGamePhaseWidget_C, UberGraphFrame) == 0x000260, "Member 'UAthenaGamePhaseWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseWidget_C, Icon) == 0x000268, "Member 'UAthenaGamePhaseWidget_C::Icon' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseWidget_C, TimeText) == 0x000270, "Member 'UAthenaGamePhaseWidget_C::TimeText' has a wrong offset!");
static_assert(offsetof(UAthenaGamePhaseWidget_C, GameState) == 0x000278, "Member 'UAthenaGamePhaseWidget_C::GameState' has a wrong offset!");

}

