#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryLimitStatusIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaInventoryLimitStatusIndicator.AthenaInventoryLimitStatusIndicator_C
// 0x0020 (0x0258 - 0x0238)
class UAthenaInventoryLimitStatusIndicator_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       InventoryLabel;                                    // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ItemStorageCountLabel;                             // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ItemStorageLimitLabel;                             // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaInventoryLimitStatusIndicator(int32 EntryPoint);
	void HandleWorldItemListChanged(const TArray<class UFortWorldItem*>& ItemsAdded, const TArray<class UFortWorldItem*>& ItemsRemoved);
	void Destruct();
	void Construct();
	void TrackWorldInventory();
	void RefreshWorldInventoryStatus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaInventoryLimitStatusIndicator_C">();
	}
	static class UAthenaInventoryLimitStatusIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryLimitStatusIndicator_C>();
	}
};
static_assert(alignof(UAthenaInventoryLimitStatusIndicator_C) == 0x000008, "Wrong alignment on UAthenaInventoryLimitStatusIndicator_C");
static_assert(sizeof(UAthenaInventoryLimitStatusIndicator_C) == 0x000258, "Wrong size on UAthenaInventoryLimitStatusIndicator_C");
static_assert(offsetof(UAthenaInventoryLimitStatusIndicator_C, UberGraphFrame) == 0x000238, "Member 'UAthenaInventoryLimitStatusIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryLimitStatusIndicator_C, InventoryLabel) == 0x000240, "Member 'UAthenaInventoryLimitStatusIndicator_C::InventoryLabel' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryLimitStatusIndicator_C, ItemStorageCountLabel) == 0x000248, "Member 'UAthenaInventoryLimitStatusIndicator_C::ItemStorageCountLabel' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryLimitStatusIndicator_C, ItemStorageLimitLabel) == 0x000250, "Member 'UAthenaInventoryLimitStatusIndicator_C::ItemStorageLimitLabel' has a wrong offset!");

}

