#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTeamInfo

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaTeamInfo.AthenaTeamInfo_C.ExecuteUbergraph_AthenaTeamInfo
// 0x0168 (0x0168 - 0x0000)
struct AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<bool>& MutedStates)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  CallFunc_GetTeamMuted_MutedStates;                 // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<bool>                                  CallFunc_GetTeamTalking_TalkingStates;             // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<bool>                                  CallFunc_GetTeamReviving_RevivingStates;           // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<bool>                                  CallFunc_GetTeamDBNO_DBNOStates;                   // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<bool>                                  CallFunc_GetTeamDead_DeadStates;                   // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<float>                                 CallFunc_GetTeamHitPointFractions_HealthFractions; // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<float>                                 CallFunc_GetTeamHitPointFractions_ShieldFractions; // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortPlayerStateAthena*                 CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaTeamMemberInfo_C*                CallFunc_Create_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<bool>& DBNOStates)>     K2Node_CreateDelegate_OutputDelegate4;             // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<bool>& DeadStates)>     K2Node_CreateDelegate_OutputDelegate5;             // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<bool>& RevivingStates)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<float>& HealthFractions, TArray<float>& ShieldFractions)> K2Node_CreateDelegate_OutputDelegate8;             // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<bool>& TalkingStates)>  K2Node_CreateDelegate_OutputDelegate9;             // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo");
static_assert(sizeof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo) == 0x000168, "Wrong size on AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, EntryPoint) == 0x000000, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, Temp_int_Array_Index_Variable) == 0x000018, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_Event_IsDesignTime) == 0x00001C, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, Temp_int_Variable) == 0x000028, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000038, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000041, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetTeamMuted_MutedStates) == 0x000048, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetTeamMuted_MutedStates' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetTeamTalking_TalkingStates) == 0x000058, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetTeamTalking_TalkingStates' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetTeamReviving_RevivingStates) == 0x000068, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetTeamReviving_RevivingStates' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetTeamDBNO_DBNOStates) == 0x000078, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetTeamDBNO_DBNOStates' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetTeamDead_DeadStates) == 0x000088, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetTeamDead_DeadStates' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetTeamHitPointFractions_HealthFractions) == 0x000098, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetTeamHitPointFractions_HealthFractions' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetTeamHitPointFractions_ShieldFractions) == 0x0000A8, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetTeamHitPointFractions_ShieldFractions' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Add_IntInt_ReturnValue) == 0x0000C4, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Create_ReturnValue) == 0x0000C8, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_AddChild_ReturnValue) == 0x0000D0, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate2) == 0x0000D8, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate3) == 0x0000E8, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate4) == 0x0000F8, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, Temp_int_Loop_Counter_Variable) == 0x000108, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Less_IntInt_ReturnValue) == 0x00010C, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Add_IntInt_ReturnValue2) == 0x000110, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate5) == 0x000118, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate6) == 0x000128, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate7) == 0x000138, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate8) == 0x000148, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate9) == 0x000158, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaTeamInfo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamInfo_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaTeamInfo_C_PreConstruct");
static_assert(sizeof(AthenaTeamInfo_C_PreConstruct) == 0x000001, "Wrong size on AthenaTeamInfo_C_PreConstruct");
static_assert(offsetof(AthenaTeamInfo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaTeamInfo_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.AppendTeamMember
// 0x0038 (0x0038 - 0x0000)
struct AthenaTeamInfo_C_AppendTeamMember final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaTeamMemberInfo_C*                CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0018(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamInfo_C_AppendTeamMember) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_AppendTeamMember");
static_assert(sizeof(AthenaTeamInfo_C_AppendTeamMember) == 0x000038, "Wrong size on AthenaTeamInfo_C_AppendTeamMember");
static_assert(offsetof(AthenaTeamInfo_C_AppendTeamMember, PlayerState) == 0x000000, "Member 'AthenaTeamInfo_C_AppendTeamMember::PlayerState' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_AppendTeamMember, PlayerIndex) == 0x000008, "Member 'AthenaTeamInfo_C_AppendTeamMember::PlayerIndex' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_AppendTeamMember, CurrentIndex) == 0x00000C, "Member 'AthenaTeamInfo_C_AppendTeamMember::CurrentIndex' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_AppendTeamMember, CallFunc_Create_ReturnValue) == 0x000010, "Member 'AthenaTeamInfo_C_AppendTeamMember::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_AppendTeamMember, K2Node_MakeStruct_Margin) == 0x000018, "Member 'AthenaTeamInfo_C_AppendTeamMember::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_AppendTeamMember, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'AthenaTeamInfo_C_AppendTeamMember::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_AppendTeamMember, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000030, "Member 'AthenaTeamInfo_C_AppendTeamMember::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.HandleTeamHitInfoChanged
// 0x0048 (0x0048 - 0x0000)
struct AthenaTeamInfo_C_HandleTeamHitInfoChanged final
{
public:
	TArray<float>                                 HealthFractions;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<float>                                 ShieldFractions;                                   // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item2;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item3;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamInfo_C_HandleTeamHitInfoChanged) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_HandleTeamHitInfoChanged");
static_assert(sizeof(AthenaTeamInfo_C_HandleTeamHitInfoChanged) == 0x000048, "Wrong size on AthenaTeamInfo_C_HandleTeamHitInfoChanged");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamHitInfoChanged, HealthFractions) == 0x000000, "Member 'AthenaTeamInfo_C_HandleTeamHitInfoChanged::HealthFractions' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamHitInfoChanged, ShieldFractions) == 0x000010, "Member 'AthenaTeamInfo_C_HandleTeamHitInfoChanged::ShieldFractions' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamHitInfoChanged, CallFunc_Array_LastIndex_ReturnValue) == 0x000020, "Member 'AthenaTeamInfo_C_HandleTeamHitInfoChanged::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamHitInfoChanged, Temp_int_Variable) == 0x000024, "Member 'AthenaTeamInfo_C_HandleTeamHitInfoChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamHitInfoChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'AthenaTeamInfo_C_HandleTeamHitInfoChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamHitInfoChanged, CallFunc_Array_Get_Item) == 0x000030, "Member 'AthenaTeamInfo_C_HandleTeamHitInfoChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamHitInfoChanged, CallFunc_Array_Get_Item2) == 0x000038, "Member 'AthenaTeamInfo_C_HandleTeamHitInfoChanged::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamHitInfoChanged, CallFunc_Array_Get_Item3) == 0x00003C, "Member 'AthenaTeamInfo_C_HandleTeamHitInfoChanged::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamHitInfoChanged, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000040, "Member 'AthenaTeamInfo_C_HandleTeamHitInfoChanged::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.HandleTeamMemberAdded
// 0x0058 (0x0058 - 0x0000)
struct AthenaTeamInfo_C_HandleTeamMemberAdded final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_GetTeamHitPointFractions_HealthFractions; // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<float>                                 CallFunc_GetTeamHitPointFractions_ShieldFractions; // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortPlayerStateAthena*                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamInfo_C_HandleTeamMemberAdded) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_HandleTeamMemberAdded");
static_assert(sizeof(AthenaTeamInfo_C_HandleTeamMemberAdded) == 0x000058, "Wrong size on AthenaTeamInfo_C_HandleTeamMemberAdded");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberAdded, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaTeamInfo_C_HandleTeamMemberAdded::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberAdded, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaTeamInfo_C_HandleTeamMemberAdded::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberAdded, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaTeamInfo_C_HandleTeamMemberAdded::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberAdded, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'AthenaTeamInfo_C_HandleTeamMemberAdded::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberAdded, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000018, "Member 'AthenaTeamInfo_C_HandleTeamMemberAdded::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberAdded, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AthenaTeamInfo_C_HandleTeamMemberAdded::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberAdded, CallFunc_GetTeamHitPointFractions_HealthFractions) == 0x000028, "Member 'AthenaTeamInfo_C_HandleTeamMemberAdded::CallFunc_GetTeamHitPointFractions_HealthFractions' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberAdded, CallFunc_GetTeamHitPointFractions_ShieldFractions) == 0x000038, "Member 'AthenaTeamInfo_C_HandleTeamMemberAdded::CallFunc_GetTeamHitPointFractions_ShieldFractions' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberAdded, CallFunc_Array_Get_Item) == 0x000048, "Member 'AthenaTeamInfo_C_HandleTeamMemberAdded::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberAdded, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'AthenaTeamInfo_C_HandleTeamMemberAdded::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberAdded, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'AthenaTeamInfo_C_HandleTeamMemberAdded::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.HandleTeamDBNOChanged
// 0x0030 (0x0030 - 0x0000)
struct AthenaTeamInfo_C_HandleTeamDBNOChanged final
{
public:
	TArray<bool>                                  TeamDBNO;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item2;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamInfo_C_HandleTeamDBNOChanged) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_HandleTeamDBNOChanged");
static_assert(sizeof(AthenaTeamInfo_C_HandleTeamDBNOChanged) == 0x000030, "Wrong size on AthenaTeamInfo_C_HandleTeamDBNOChanged");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamDBNOChanged, TeamDBNO) == 0x000000, "Member 'AthenaTeamInfo_C_HandleTeamDBNOChanged::TeamDBNO' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamDBNOChanged, CallFunc_Array_LastIndex_ReturnValue) == 0x000010, "Member 'AthenaTeamInfo_C_HandleTeamDBNOChanged::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamDBNOChanged, Temp_int_Variable) == 0x000014, "Member 'AthenaTeamInfo_C_HandleTeamDBNOChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamDBNOChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'AthenaTeamInfo_C_HandleTeamDBNOChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamDBNOChanged, CallFunc_Array_Get_Item) == 0x00001C, "Member 'AthenaTeamInfo_C_HandleTeamDBNOChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamDBNOChanged, CallFunc_Array_Get_Item2) == 0x000020, "Member 'AthenaTeamInfo_C_HandleTeamDBNOChanged::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamDBNOChanged, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'AthenaTeamInfo_C_HandleTeamDBNOChanged::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.HandleTeamDeadChanged
// 0x0030 (0x0030 - 0x0000)
struct AthenaTeamInfo_C_HandleTeamDeadChanged final
{
public:
	TArray<bool>                                  TeamDead;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item2;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamInfo_C_HandleTeamDeadChanged) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_HandleTeamDeadChanged");
static_assert(sizeof(AthenaTeamInfo_C_HandleTeamDeadChanged) == 0x000030, "Wrong size on AthenaTeamInfo_C_HandleTeamDeadChanged");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamDeadChanged, TeamDead) == 0x000000, "Member 'AthenaTeamInfo_C_HandleTeamDeadChanged::TeamDead' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamDeadChanged, CallFunc_Array_LastIndex_ReturnValue) == 0x000010, "Member 'AthenaTeamInfo_C_HandleTeamDeadChanged::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamDeadChanged, Temp_int_Variable) == 0x000014, "Member 'AthenaTeamInfo_C_HandleTeamDeadChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamDeadChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'AthenaTeamInfo_C_HandleTeamDeadChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamDeadChanged, CallFunc_Array_Get_Item) == 0x00001C, "Member 'AthenaTeamInfo_C_HandleTeamDeadChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamDeadChanged, CallFunc_Array_Get_Item2) == 0x000020, "Member 'AthenaTeamInfo_C_HandleTeamDeadChanged::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamDeadChanged, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'AthenaTeamInfo_C_HandleTeamDeadChanged::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.HandleTeamMemberPlayerNamesChanged
// 0x0018 (0x0018 - 0x0000)
struct AthenaTeamInfo_C_HandleTeamMemberPlayerNamesChanged final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamInfo_C_HandleTeamMemberPlayerNamesChanged) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_HandleTeamMemberPlayerNamesChanged");
static_assert(sizeof(AthenaTeamInfo_C_HandleTeamMemberPlayerNamesChanged) == 0x000018, "Wrong size on AthenaTeamInfo_C_HandleTeamMemberPlayerNamesChanged");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberPlayerNamesChanged, Temp_int_Variable) == 0x000000, "Member 'AthenaTeamInfo_C_HandleTeamMemberPlayerNamesChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberPlayerNamesChanged, CallFunc_Array_LastIndex_ReturnValue) == 0x000004, "Member 'AthenaTeamInfo_C_HandleTeamMemberPlayerNamesChanged::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberPlayerNamesChanged, CallFunc_Array_Get_Item) == 0x000008, "Member 'AthenaTeamInfo_C_HandleTeamMemberPlayerNamesChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberPlayerNamesChanged, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'AthenaTeamInfo_C_HandleTeamMemberPlayerNamesChanged::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberPlayerNamesChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'AthenaTeamInfo_C_HandleTeamMemberPlayerNamesChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.HandleTeamRevivingChanged
// 0x0038 (0x0038 - 0x0000)
struct AthenaTeamInfo_C_HandleTeamRevivingChanged final
{
public:
	TArray<bool>                                  TeamReviving;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item2;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamInfo_C_HandleTeamRevivingChanged) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_HandleTeamRevivingChanged");
static_assert(sizeof(AthenaTeamInfo_C_HandleTeamRevivingChanged) == 0x000038, "Wrong size on AthenaTeamInfo_C_HandleTeamRevivingChanged");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamRevivingChanged, TeamReviving) == 0x000000, "Member 'AthenaTeamInfo_C_HandleTeamRevivingChanged::TeamReviving' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamRevivingChanged, Temp_int_Array_Index_Variable) == 0x000010, "Member 'AthenaTeamInfo_C_HandleTeamRevivingChanged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamRevivingChanged, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'AthenaTeamInfo_C_HandleTeamRevivingChanged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamRevivingChanged, CallFunc_Array_Get_Item) == 0x000018, "Member 'AthenaTeamInfo_C_HandleTeamRevivingChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamRevivingChanged, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'AthenaTeamInfo_C_HandleTeamRevivingChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamRevivingChanged, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'AthenaTeamInfo_C_HandleTeamRevivingChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamRevivingChanged, CallFunc_Array_Get_Item2) == 0x000028, "Member 'AthenaTeamInfo_C_HandleTeamRevivingChanged::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamRevivingChanged, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'AthenaTeamInfo_C_HandleTeamRevivingChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.HandleTeamMemberRemoved
// 0x0058 (0x0058 - 0x0000)
struct AthenaTeamInfo_C_HandleTeamMemberRemoved final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_GetTeamHitPointFractions_HealthFractions; // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<float>                                 CallFunc_GetTeamHitPointFractions_ShieldFractions; // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortPlayerStateAthena*                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamInfo_C_HandleTeamMemberRemoved) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_HandleTeamMemberRemoved");
static_assert(sizeof(AthenaTeamInfo_C_HandleTeamMemberRemoved) == 0x000058, "Wrong size on AthenaTeamInfo_C_HandleTeamMemberRemoved");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberRemoved, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaTeamInfo_C_HandleTeamMemberRemoved::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberRemoved, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaTeamInfo_C_HandleTeamMemberRemoved::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberRemoved, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaTeamInfo_C_HandleTeamMemberRemoved::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberRemoved, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'AthenaTeamInfo_C_HandleTeamMemberRemoved::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberRemoved, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000018, "Member 'AthenaTeamInfo_C_HandleTeamMemberRemoved::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberRemoved, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AthenaTeamInfo_C_HandleTeamMemberRemoved::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberRemoved, CallFunc_GetTeamHitPointFractions_HealthFractions) == 0x000028, "Member 'AthenaTeamInfo_C_HandleTeamMemberRemoved::CallFunc_GetTeamHitPointFractions_HealthFractions' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberRemoved, CallFunc_GetTeamHitPointFractions_ShieldFractions) == 0x000038, "Member 'AthenaTeamInfo_C_HandleTeamMemberRemoved::CallFunc_GetTeamHitPointFractions_ShieldFractions' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberRemoved, CallFunc_Array_Get_Item) == 0x000048, "Member 'AthenaTeamInfo_C_HandleTeamMemberRemoved::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberRemoved, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'AthenaTeamInfo_C_HandleTeamMemberRemoved::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMemberRemoved, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'AthenaTeamInfo_C_HandleTeamMemberRemoved::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.HandleTeamTalkingChanged
// 0x0030 (0x0030 - 0x0000)
struct AthenaTeamInfo_C_HandleTeamTalkingChanged final
{
public:
	TArray<bool>                                  TeamTalking;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item2;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamInfo_C_HandleTeamTalkingChanged) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_HandleTeamTalkingChanged");
static_assert(sizeof(AthenaTeamInfo_C_HandleTeamTalkingChanged) == 0x000030, "Wrong size on AthenaTeamInfo_C_HandleTeamTalkingChanged");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamTalkingChanged, TeamTalking) == 0x000000, "Member 'AthenaTeamInfo_C_HandleTeamTalkingChanged::TeamTalking' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamTalkingChanged, CallFunc_Array_LastIndex_ReturnValue) == 0x000010, "Member 'AthenaTeamInfo_C_HandleTeamTalkingChanged::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamTalkingChanged, Temp_int_Variable) == 0x000014, "Member 'AthenaTeamInfo_C_HandleTeamTalkingChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamTalkingChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'AthenaTeamInfo_C_HandleTeamTalkingChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamTalkingChanged, CallFunc_Array_Get_Item) == 0x00001C, "Member 'AthenaTeamInfo_C_HandleTeamTalkingChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamTalkingChanged, CallFunc_Array_Get_Item2) == 0x000020, "Member 'AthenaTeamInfo_C_HandleTeamTalkingChanged::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamTalkingChanged, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'AthenaTeamInfo_C_HandleTeamTalkingChanged::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.HandleTeamMutedChanged
// 0x0030 (0x0030 - 0x0000)
struct AthenaTeamInfo_C_HandleTeamMutedChanged final
{
public:
	TArray<bool>                                  TeamMuted;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item2;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamInfo_C_HandleTeamMutedChanged) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_HandleTeamMutedChanged");
static_assert(sizeof(AthenaTeamInfo_C_HandleTeamMutedChanged) == 0x000030, "Wrong size on AthenaTeamInfo_C_HandleTeamMutedChanged");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMutedChanged, TeamMuted) == 0x000000, "Member 'AthenaTeamInfo_C_HandleTeamMutedChanged::TeamMuted' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMutedChanged, CallFunc_Array_LastIndex_ReturnValue) == 0x000010, "Member 'AthenaTeamInfo_C_HandleTeamMutedChanged::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleTeamMutedChanged, Temp_int_Variable) == 0x000014, "Member 'AthenaTeamInfo_C_HandleTeamMutedChanged::Temp_int_Variable' has a wrong offset!");
