#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTeamMemberIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C
// 0x0028 (0x02C0 - 0x0298)
class UAthenaTeamMemberIndicator_C final : public UAthenaTeamMemberIndicatorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(Transient, DuplicateTransient)
	class UAthenaTeamMemberDBNOState_C*           DBNOIndicator;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AFortPlayerStateAthena*                 Player_State;                                      // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Team_Member_Index;                                 // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaTeamMemberIndicator(int32 EntryPoint);
	void Update_Pawn();
	void Destruct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void On_Team_DBNO_Changed(TArray<bool>& DBNOStates);
	void On_Team_Reviving_Changed(TArray<bool>& Team_Reviving);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaTeamMemberIndicator_C">();
	}
	static class UAthenaTeamMemberIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaTeamMemberIndicator_C>();
	}
};
static_assert(alignof(UAthenaTeamMemberIndicator_C) == 0x000008, "Wrong alignment on UAthenaTeamMemberIndicator_C");
static_assert(sizeof(UAthenaTeamMemberIndicator_C) == 0x0002C0, "Wrong size on UAthenaTeamMemberIndicator_C");
static_assert(offsetof(UAthenaTeamMemberIndicator_C, UberGraphFrame) == 0x000298, "Member 'UAthenaTeamMemberIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberIndicator_C, DBNOIndicator) == 0x0002A0, "Member 'UAthenaTeamMemberIndicator_C::DBNOIndicator' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberIndicator_C, PlayerName) == 0x0002A8, "Member 'UAthenaTeamMemberIndicator_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberIndicator_C, Player_State) == 0x0002B0, "Member 'UAthenaTeamMemberIndicator_C::Player_State' has a wrong offset!");
static_assert(offsetof(UAthenaTeamMemberIndicator_C, Team_Member_Index) == 0x0002B8, "Member 'UAthenaTeamMemberIndicator_C::Team_Member_Index' has a wrong offset!");

}

