#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHitPointBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"
#include "ProgressBarType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaHitPointBar.AthenaHitPointBar_C
// 0x0340 (0x0578 - 0x0238)
class UAthenaHitPointBar_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UHorizontalBox*                         _Horizontal_Box__Stat_Text;                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 _Image__Baseplate;                                 // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 _Image__Bevel;                                     // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 _Image__Stat_Icon;                                 // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               _Overlay__Bar_Artwork;                             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           _ProgressBar__Delta;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           _ProgressBar__Fill;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               _Size_Box__Bar;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageStatIconShadow;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxHighlight;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextCurrentStat;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextMaxStat;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EProgressBarType                              Type;                                              // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Current_Value;                                     // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max_Value;                                         // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Fill_Texture;                                      // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Gloss_Texture;                                     // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Critical_Color_A;                                  // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Critical_Color_B;                                  // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Critical_Color_C;                                  // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Last_Value;                                        // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeUpdateRate;                                    // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortMultiSizeFont                     MultiFont;                                         // 0x02F8(0x0270)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             Baseplate_Texture;                                 // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Volatile;                                          // 0x0570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DBNOStateCache;                                    // 0x0571(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AthenaHitPointBar(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void UpdateMaxValue(float Max);
	void UpdateCurrentValue(float Current, EFortHitPointModificationReason Reason);
	void Update_Fill_Bar();
	void UpdateCurrentValueWithoutReason(float Current);
	void Initialize_Bar();
	void Update_Delta_Bar();
	void Update();
	void UpdateVolatileForUpdate();
	void UpdateHealthType();
	void UpdateDBNOState(bool bIsDBNO);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaHitPointBar_C">();
	}
	static class UAthenaHitPointBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHitPointBar_C>();
	}
};
static_assert(alignof(UAthenaHitPointBar_C) == 0x000008, "Wrong alignment on UAthenaHitPointBar_C");
static_assert(sizeof(UAthenaHitPointBar_C) == 0x000578, "Wrong size on UAthenaHitPointBar_C");
static_assert(offsetof(UAthenaHitPointBar_C, UberGraphFrame) == 0x000238, "Member 'UAthenaHitPointBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, _Horizontal_Box__Stat_Text) == 0x000240, "Member 'UAthenaHitPointBar_C::_Horizontal_Box__Stat_Text' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, _Image__Baseplate) == 0x000248, "Member 'UAthenaHitPointBar_C::_Image__Baseplate' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, _Image__Bevel) == 0x000250, "Member 'UAthenaHitPointBar_C::_Image__Bevel' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, _Image__Stat_Icon) == 0x000258, "Member 'UAthenaHitPointBar_C::_Image__Stat_Icon' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, _Overlay__Bar_Artwork) == 0x000260, "Member 'UAthenaHitPointBar_C::_Overlay__Bar_Artwork' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, _ProgressBar__Delta) == 0x000268, "Member 'UAthenaHitPointBar_C::_ProgressBar__Delta' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, _ProgressBar__Fill) == 0x000270, "Member 'UAthenaHitPointBar_C::_ProgressBar__Fill' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, _Size_Box__Bar) == 0x000278, "Member 'UAthenaHitPointBar_C::_Size_Box__Bar' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, ImageStatIconShadow) == 0x000280, "Member 'UAthenaHitPointBar_C::ImageStatIconShadow' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, SizeBoxHighlight) == 0x000288, "Member 'UAthenaHitPointBar_C::SizeBoxHighlight' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, TextCurrentStat) == 0x000290, "Member 'UAthenaHitPointBar_C::TextCurrentStat' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, TextMaxStat) == 0x000298, "Member 'UAthenaHitPointBar_C::TextMaxStat' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, Type) == 0x0002A0, "Member 'UAthenaHitPointBar_C::Type' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, Current_Value) == 0x0002A4, "Member 'UAthenaHitPointBar_C::Current_Value' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, Max_Value) == 0x0002A8, "Member 'UAthenaHitPointBar_C::Max_Value' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, Fill_Texture) == 0x0002B0, "Member 'UAthenaHitPointBar_C::Fill_Texture' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, Gloss_Texture) == 0x0002B8, "Member 'UAthenaHitPointBar_C::Gloss_Texture' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, Critical_Color_A) == 0x0002C0, "Member 'UAthenaHitPointBar_C::Critical_Color_A' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, Critical_Color_B) == 0x0002D0, "Member 'UAthenaHitPointBar_C::Critical_Color_B' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, Critical_Color_C) == 0x0002E0, "Member 'UAthenaHitPointBar_C::Critical_Color_C' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, Last_Value) == 0x0002F0, "Member 'UAthenaHitPointBar_C::Last_Value' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, FadeUpdateRate) == 0x0002F4, "Member 'UAthenaHitPointBar_C::FadeUpdateRate' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, MultiFont) == 0x0002F8, "Member 'UAthenaHitPointBar_C::MultiFont' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, Baseplate_Texture) == 0x000568, "Member 'UAthenaHitPointBar_C::Baseplate_Texture' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, Volatile) == 0x000570, "Member 'UAthenaHitPointBar_C::Volatile' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, DBNOStateCache) == 0x000571, "Member 'UAthenaHitPointBar_C::DBNOStateCache' has a wrong offset!");

}

