#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BoostsRoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BoostsRoot.BoostsRoot_C
// 0x0048 (0x0428 - 0x03E0)
class UBoostsRoot_C final : public UCommonActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(Transient, DuplicateTransient)
	class UHorizontalTabList_C*                   BoostsTabs;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CurrentTabSwitcher;                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SelectedOption;                                    // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Current_Tab;                                       // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Accept_Input;                                      // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Video_Tab_Selected;                                // 0x0411(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Apply_Visible;                                     // 0x0412(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_413[0x5];                                      // 0x0413(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortOptionsTab*>                AllTabWidgets;                                     // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BoostsRoot(int32 EntryPoint);
	void BndEvt__CurrentTabSwitcher_K2Node_ComponentBoundEvent_29_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	void BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void OnActivated();
	void Destruct();
	void Construct();
	void HandleBack(bool* PassThrough);
	void Set_Input_Action_Handlers();
	void HandleCursorModeChanging(bool IsEnabled);
	void HandleStore(bool* PassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BoostsRoot_C">();
	}
	static class UBoostsRoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBoostsRoot_C>();
	}
};
static_assert(alignof(UBoostsRoot_C) == 0x000008, "Wrong alignment on UBoostsRoot_C");
static_assert(sizeof(UBoostsRoot_C) == 0x000428, "Wrong size on UBoostsRoot_C");
static_assert(offsetof(UBoostsRoot_C, UberGraphFrame) == 0x0003E0, "Member 'UBoostsRoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBoostsRoot_C, BoostsTabs) == 0x0003E8, "Member 'UBoostsRoot_C::BoostsTabs' has a wrong offset!");
static_assert(offsetof(UBoostsRoot_C, CurrentTabSwitcher) == 0x0003F0, "Member 'UBoostsRoot_C::CurrentTabSwitcher' has a wrong offset!");
static_assert(offsetof(UBoostsRoot_C, Title) == 0x0003F8, "Member 'UBoostsRoot_C::Title' has a wrong offset!");
static_assert(offsetof(UBoostsRoot_C, SelectedOption) == 0x000400, "Member 'UBoostsRoot_C::SelectedOption' has a wrong offset!");
static_assert(offsetof(UBoostsRoot_C, Current_Tab) == 0x000408, "Member 'UBoostsRoot_C::Current_Tab' has a wrong offset!");
static_assert(offsetof(UBoostsRoot_C, Accept_Input) == 0x000410, "Member 'UBoostsRoot_C::Accept_Input' has a wrong offset!");
static_assert(offsetof(UBoostsRoot_C, Video_Tab_Selected) == 0x000411, "Member 'UBoostsRoot_C::Video_Tab_Selected' has a wrong offset!");
static_assert(offsetof(UBoostsRoot_C, Apply_Visible) == 0x000412, "Member 'UBoostsRoot_C::Apply_Visible' has a wrong offset!");
static_assert(offsetof(UBoostsRoot_C, AllTabWidgets) == 0x000418, "Member 'UBoostsRoot_C::AllTabWidgets' has a wrong offset!");

}

