#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FortExpeditionExpiresWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_FortExpeditionExpiresWidget.BP_FortExpeditionExpiresWidget_C
// 0x0018 (0x0260 - 0x0248)
class UBP_FortExpeditionExpiresWidget_C final : public UFortExpeditionExpiresWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       ExpeditionExpires;                                 // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 Style;                                             // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FortExpeditionExpiresWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnExpeditionExpirationUpdated();
	void SetData(class UFortExpeditionItem* InItem);
	void Refresh_Expiration_Timer(class UFortExpeditionItem* Item_0);
	struct FTimespan Get_Utc_Now_Offset();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FortExpeditionExpiresWidget_C">();
	}
	static class UBP_FortExpeditionExpiresWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FortExpeditionExpiresWidget_C>();
	}
};
static_assert(alignof(UBP_FortExpeditionExpiresWidget_C) == 0x000008, "Wrong alignment on UBP_FortExpeditionExpiresWidget_C");
static_assert(sizeof(UBP_FortExpeditionExpiresWidget_C) == 0x000260, "Wrong size on UBP_FortExpeditionExpiresWidget_C");
static_assert(offsetof(UBP_FortExpeditionExpiresWidget_C, UberGraphFrame) == 0x000248, "Member 'UBP_FortExpeditionExpiresWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionExpiresWidget_C, ExpeditionExpires) == 0x000250, "Member 'UBP_FortExpeditionExpiresWidget_C::ExpeditionExpires' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionExpiresWidget_C, Style) == 0x000258, "Member 'UBP_FortExpeditionExpiresWidget_C::Style' has a wrong offset!");

}

