#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LiveStreamerDescription

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_LiveStreamerDescription.BP_LiveStreamerDescription_C
// 0x0048 (0x0278 - 0x0230)
class UBP_LiveStreamerDescription_C final : public UUserWidget
{
public:
	class UCommonTextBlock*                       BroadcasterDescText;                               // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  BroadcasterViewerSwitcher;                         // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LiveStreamTitileText;                              // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StreamerNameText;                                  // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ViewerHorizBox;                                    // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ViewerQuestText;                                   // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortQuestItem*                         Quest;                                             // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               QuestItemDefinition;                               // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuestType                                QuestType;                                         // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Set_Quest(class UFortQuestItem* Quest_0);
	void Update_Visibility(class UFortQuestItemDefinition* Item);
	void Is_Viewer_Quest(bool* ViewerQuest);
	void Setup_Broadcaster_Name();
	void Update_Viewer_Note_Visibility();
	void SetViewerQuestText(const class FText& NewText);
	void GetBroadcasterName(class FText* BroadcasterName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LiveStreamerDescription_C">();
	}
	static class UBP_LiveStreamerDescription_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_LiveStreamerDescription_C>();
	}
};
static_assert(alignof(UBP_LiveStreamerDescription_C) == 0x000008, "Wrong alignment on UBP_LiveStreamerDescription_C");
static_assert(sizeof(UBP_LiveStreamerDescription_C) == 0x000278, "Wrong size on UBP_LiveStreamerDescription_C");
static_assert(offsetof(UBP_LiveStreamerDescription_C, BroadcasterDescText) == 0x000230, "Member 'UBP_LiveStreamerDescription_C::BroadcasterDescText' has a wrong offset!");
static_assert(offsetof(UBP_LiveStreamerDescription_C, BroadcasterViewerSwitcher) == 0x000238, "Member 'UBP_LiveStreamerDescription_C::BroadcasterViewerSwitcher' has a wrong offset!");
static_assert(offsetof(UBP_LiveStreamerDescription_C, LiveStreamTitileText) == 0x000240, "Member 'UBP_LiveStreamerDescription_C::LiveStreamTitileText' has a wrong offset!");
static_assert(offsetof(UBP_LiveStreamerDescription_C, StreamerNameText) == 0x000248, "Member 'UBP_LiveStreamerDescription_C::StreamerNameText' has a wrong offset!");
static_assert(offsetof(UBP_LiveStreamerDescription_C, ViewerHorizBox) == 0x000250, "Member 'UBP_LiveStreamerDescription_C::ViewerHorizBox' has a wrong offset!");
static_assert(offsetof(UBP_LiveStreamerDescription_C, ViewerQuestText) == 0x000258, "Member 'UBP_LiveStreamerDescription_C::ViewerQuestText' has a wrong offset!");
static_assert(offsetof(UBP_LiveStreamerDescription_C, Quest) == 0x000260, "Member 'UBP_LiveStreamerDescription_C::Quest' has a wrong offset!");
static_assert(offsetof(UBP_LiveStreamerDescription_C, QuestItemDefinition) == 0x000268, "Member 'UBP_LiveStreamerDescription_C::QuestItemDefinition' has a wrong offset!");
static_assert(offsetof(UBP_LiveStreamerDescription_C, QuestType) == 0x000270, "Member 'UBP_LiveStreamerDescription_C::QuestType' has a wrong offset!");

}

