#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "CommonUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChatWidget.ChatWidget_C
// 0x0080 (0x0488 - 0x0408)
class UChatWidget_C final : public UFortActivatablePanel
{
public:
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(Transient, DuplicateTransient)
	class UIconTextButton_C*                      ConsoleChatShortcut;                               // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        CursorModeSwitcher;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortChatWidget*                        FortChat;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HudContentHBox;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindWidget;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CloseUserListAction;                               // 0x0440(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    OpenUserListAction;                                // 0x0450(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    CurrentUserListAction;                             // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bEnteringChat;                                     // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   AboutToEnterChat;                                  // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_ChatWidget(int32 EntryPoint);
	void Destruct();
	void HandleInputMethodChanged(bool bUsingGamepad);
	void Construct();
	void BndEvt__FortChat_K2Node_ComponentBoundEvent_0_OnUserListChangedDelegate__DelegateSignature(bool bOpen);
	void BndEvt__FortChat_K2Node_ComponentBoundEvent_66_OnChatEnteredDelegate__DelegateSignature(bool bEnteringChat_0);
	void BndEvt__ConsoleChatShortcut_K2Node_ComponentBoundEvent_14_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Set_Chat_Visibility(ESlateVisibility New_Visibility);
	void Set_Chat_Shortcut_Visibility(ESlateVisibility New_Visibility);
	void UpdateChatUserListIcon(bool Open);
	void HandeChatEnteredEvent(bool bEnteringChat_0);
	void HandleShowChatWindow(EFortUIFeature Feature, EFortUIFeatureState FeatureState);
	void HandleCursorModeChanged(bool bEnabled, class FName ActionName, class UUserWidget* Widget);
	void BindDelegates();
	void InitializeChat();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChatWidget_C">();
	}
	static class UChatWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatWidget_C>();
	}
};
static_assert(alignof(UChatWidget_C) == 0x000008, "Wrong alignment on UChatWidget_C");
static_assert(sizeof(UChatWidget_C) == 0x000488, "Wrong size on UChatWidget_C");
static_assert(offsetof(UChatWidget_C, UberGraphFrame) == 0x000410, "Member 'UChatWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, ConsoleChatShortcut) == 0x000418, "Member 'UChatWidget_C::ConsoleChatShortcut' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, CursorModeSwitcher) == 0x000420, "Member 'UChatWidget_C::CursorModeSwitcher' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, FortChat) == 0x000428, "Member 'UChatWidget_C::FortChat' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, HudContentHBox) == 0x000430, "Member 'UChatWidget_C::HudContentHBox' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, KeybindWidget) == 0x000438, "Member 'UChatWidget_C::KeybindWidget' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, CloseUserListAction) == 0x000440, "Member 'UChatWidget_C::CloseUserListAction' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, OpenUserListAction) == 0x000450, "Member 'UChatWidget_C::OpenUserListAction' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, CurrentUserListAction) == 0x000460, "Member 'UChatWidget_C::CurrentUserListAction' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, bEnteringChat) == 0x000470, "Member 'UChatWidget_C::bEnteringChat' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, AboutToEnterChat) == 0x000478, "Member 'UChatWidget_C::AboutToEnterChat' has a wrong offset!");

}

