#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cinematic_TeamMics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Cinematic-TeamMics.Cinematic-TeamMics_C
// 0x01C0 (0x03F8 - 0x0238)
class UCinematic_TeamMics_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UMicIndicator_C*                        MicIndicator;                                      // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherConnectingStranger;                        // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_6;                                       // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPlayerName;                                    // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    MemberInfo;                                        // 0x0260(0x0190)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          ShowingHealth;                                     // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Cinematic_TeamMics(int32 EntryPoint);
	void Construct();
	void Update(const struct FFortTeamMemberInfo& UpdatedMemberInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cinematic-TeamMics_C">();
	}
	static class UCinematic_TeamMics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCinematic_TeamMics_C>();
	}
};
static_assert(alignof(UCinematic_TeamMics_C) == 0x000008, "Wrong alignment on UCinematic_TeamMics_C");
static_assert(sizeof(UCinematic_TeamMics_C) == 0x0003F8, "Wrong size on UCinematic_TeamMics_C");
static_assert(offsetof(UCinematic_TeamMics_C, UberGraphFrame) == 0x000238, "Member 'UCinematic_TeamMics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCinematic_TeamMics_C, MicIndicator) == 0x000240, "Member 'UCinematic_TeamMics_C::MicIndicator' has a wrong offset!");
static_assert(offsetof(UCinematic_TeamMics_C, SwitcherConnectingStranger) == 0x000248, "Member 'UCinematic_TeamMics_C::SwitcherConnectingStranger' has a wrong offset!");
static_assert(offsetof(UCinematic_TeamMics_C, TextBlock_6) == 0x000250, "Member 'UCinematic_TeamMics_C::TextBlock_6' has a wrong offset!");
static_assert(offsetof(UCinematic_TeamMics_C, TextPlayerName) == 0x000258, "Member 'UCinematic_TeamMics_C::TextPlayerName' has a wrong offset!");
static_assert(offsetof(UCinematic_TeamMics_C, MemberInfo) == 0x000260, "Member 'UCinematic_TeamMics_C::MemberInfo' has a wrong offset!");
static_assert(offsetof(UCinematic_TeamMics_C, ShowingHealth) == 0x0003F0, "Member 'UCinematic_TeamMics_C::ShowingHealth' has a wrong offset!");

}

