#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectionBar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CollectionBounds_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CollectionBar.CollectionBar_C
// 0x00E8 (0x0320 - 0x0238)
class UCollectionBar_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UProgressBar*                           Bar;                                               // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BarSizeBox;                                        // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SideIcon;                                          // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FCollectionBounds                      BarBounds;                                         // 0x0258(0x0008)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         AchievedCount;                                     // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            IconBrush;                                         // 0x0268(0x0090)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bShowSideIcon;                                     // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           BarColor;                                          // 0x02FC(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         BarHeightOverride;                                 // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FMargin                                IconMargin;                                        // 0x0310(0x0010)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_CollectionBar(int32 EntryPoint);
	void Construct();
	void GetProgressBarPercentage(int32 AchievedCount_0, float* Percentage);
	void Update();
	void SetAchievedCount(int32 InAchievedCount);
	void IsAchievedCountInRange(bool* bIsInRange);
	void SetIcon(const struct FSlateBrush& InIcon);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CollectionBar_C">();
	}
	static class UCollectionBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectionBar_C>();
	}
};
static_assert(alignof(UCollectionBar_C) == 0x000008, "Wrong alignment on UCollectionBar_C");
static_assert(sizeof(UCollectionBar_C) == 0x000320, "Wrong size on UCollectionBar_C");
static_assert(offsetof(UCollectionBar_C, UberGraphFrame) == 0x000238, "Member 'UCollectionBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCollectionBar_C, Bar) == 0x000240, "Member 'UCollectionBar_C::Bar' has a wrong offset!");
static_assert(offsetof(UCollectionBar_C, BarSizeBox) == 0x000248, "Member 'UCollectionBar_C::BarSizeBox' has a wrong offset!");
static_assert(offsetof(UCollectionBar_C, SideIcon) == 0x000250, "Member 'UCollectionBar_C::SideIcon' has a wrong offset!");
static_assert(offsetof(UCollectionBar_C, BarBounds) == 0x000258, "Member 'UCollectionBar_C::BarBounds' has a wrong offset!");
static_assert(offsetof(UCollectionBar_C, AchievedCount) == 0x000260, "Member 'UCollectionBar_C::AchievedCount' has a wrong offset!");
static_assert(offsetof(UCollectionBar_C, IconBrush) == 0x000268, "Member 'UCollectionBar_C::IconBrush' has a wrong offset!");
static_assert(offsetof(UCollectionBar_C, bShowSideIcon) == 0x0002F8, "Member 'UCollectionBar_C::bShowSideIcon' has a wrong offset!");
static_assert(offsetof(UCollectionBar_C, BarColor) == 0x0002FC, "Member 'UCollectionBar_C::BarColor' has a wrong offset!");
static_assert(offsetof(UCollectionBar_C, BarHeightOverride) == 0x00030C, "Member 'UCollectionBar_C::BarHeightOverride' has a wrong offset!");
static_assert(offsetof(UCollectionBar_C, IconMargin) == 0x000310, "Member 'UCollectionBar_C::IconMargin' has a wrong offset!");

}

