#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CraftingIngredient

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "EFortUITheme_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CraftingIngredient.CraftingIngredient_C
// 0x0040 (0x02A0 - 0x0260)
class UCraftingIngredient_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 IconImage;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       InventoryText;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Divider;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TotalText;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_831;                                   // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSchematicRequirement                  ingredient;                                        // 0x0290(0x0010)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_CraftingIngredient(int32 EntryPoint);
	void Construct();
	void Refresh();
	class UWidget* Get_Tooltip();
	void ShowDivider(bool Show);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CraftingIngredient_C">();
	}
	static class UCraftingIngredient_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCraftingIngredient_C>();
	}
};
static_assert(alignof(UCraftingIngredient_C) == 0x000008, "Wrong alignment on UCraftingIngredient_C");
static_assert(sizeof(UCraftingIngredient_C) == 0x0002A0, "Wrong size on UCraftingIngredient_C");
static_assert(offsetof(UCraftingIngredient_C, UberGraphFrame) == 0x000260, "Member 'UCraftingIngredient_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCraftingIngredient_C, IconImage) == 0x000268, "Member 'UCraftingIngredient_C::IconImage' has a wrong offset!");
static_assert(offsetof(UCraftingIngredient_C, InventoryText) == 0x000270, "Member 'UCraftingIngredient_C::InventoryText' has a wrong offset!");
static_assert(offsetof(UCraftingIngredient_C, SizeBox_Divider) == 0x000278, "Member 'UCraftingIngredient_C::SizeBox_Divider' has a wrong offset!");
static_assert(offsetof(UCraftingIngredient_C, TotalText) == 0x000280, "Member 'UCraftingIngredient_C::TotalText' has a wrong offset!");
static_assert(offsetof(UCraftingIngredient_C, VerticalBox_831) == 0x000288, "Member 'UCraftingIngredient_C::VerticalBox_831' has a wrong offset!");
static_assert(offsetof(UCraftingIngredient_C, ingredient) == 0x000290, "Member 'UCraftingIngredient_C::ingredient' has a wrong offset!");

}

