#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DailyRewardsSchedule

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function DailyRewardsSchedule.DailyRewardsSchedule_C.ExecuteUbergraph_DailyRewardsSchedule
// 0x0178 (0x0178 - 0x0000)
struct DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0050(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A8(0x0018)()
	class UDailyRewardsEpic_C*                    CallFunc_Create_ReturnValue;                       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue3;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDailyRewardsItem_C*                    CallFunc_Create_ReturnValue2;                      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDailyRewardsItem_C*                    CallFunc_Create_ReturnValue3;                      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue2;     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue3;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x010C(0x0008)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x011C(0x0010)(NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDailyRewardsItemData              CallFunc_Array_Get_Item;                           // 0x0140(0x0010)(NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDailyRewardsItemData              CallFunc_Array_Get_Item2;                          // 0x0158(0x0010)(NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule) == 0x000008, "Wrong alignment on DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule");
static_assert(sizeof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule) == 0x000178, "Wrong size on DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, EntryPoint) == 0x000000, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::EntryPoint' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, K2Node_MakeStruct_FormatArgumentData2) == 0x000050, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, K2Node_MakeArray_Array) == 0x000090, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000A0, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Format_ReturnValue) == 0x0000A8, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Create_ReturnValue) == 0x0000C0, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x0000C8, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_GetOwningPlayer_ReturnValue2) == 0x0000D0, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_GetOwningPlayer_ReturnValue3) == 0x0000D8, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_GetOwningPlayer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Create_ReturnValue2) == 0x0000E0, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Create_ReturnValue3) == 0x0000E8, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Create_ReturnValue3' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_AddChildToHorizontalBox_ReturnValue2) == 0x0000F0, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_AddChildToHorizontalBox_ReturnValue2' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, Temp_int_Loop_Counter_Variable) == 0x0000F8, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Less_IntInt_ReturnValue) == 0x0000FC, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_AddChildToHorizontalBox_ReturnValue3) == 0x000100, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_AddChildToHorizontalBox_ReturnValue3' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Add_IntInt_ReturnValue) == 0x000108, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, K2Node_MakeStruct_SlateChildSize) == 0x00010C, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Array_Length_ReturnValue2) == 0x000114, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Add_IntInt_ReturnValue2) == 0x000118, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, K2Node_MakeStruct_Margin) == 0x00011C, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, K2Node_Event_IsDesignTime) == 0x00012C, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, Temp_int_Variable) == 0x000130, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, Temp_int_Array_Index_Variable) == 0x000134, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000138, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Less_IntInt_ReturnValue2) == 0x000139, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Array_Get_Item) == 0x000140, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Subtract_IntInt_ReturnValue) == 0x000150, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Less_IntInt_ReturnValue3) == 0x000154, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Array_Get_Item2) == 0x000158, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_BooleanOR_ReturnValue) == 0x000168, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Add_IntInt_ReturnValue3) == 0x00016C, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_Subtract_IntInt_ReturnValue2) == 0x000170, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_Subtract_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000174, "Member 'DailyRewardsSchedule_C_ExecuteUbergraph_DailyRewardsSchedule::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function DailyRewardsSchedule.DailyRewardsSchedule_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct DailyRewardsSchedule_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DailyRewardsSchedule_C_PreConstruct) == 0x000001, "Wrong alignment on DailyRewardsSchedule_C_PreConstruct");
static_assert(sizeof(DailyRewardsSchedule_C_PreConstruct) == 0x000001, "Wrong size on DailyRewardsSchedule_C_PreConstruct");
static_assert(offsetof(DailyRewardsSchedule_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'DailyRewardsSchedule_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

