#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_Med_Soldier_01_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_Med_Soldier_01_Skeleton_AnimBP.F_Med_Soldier_01_Skeleton_AnimBP_C
// 0x0B20 (0x0F30 - 0x0410)
class UF_Med_Soldier_01_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_731F596B47445FF9472B5097E71E411C; // 0x0418(0x0048)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_FAD98FF0469710A7BDE0EDBF8A706451; // 0x0460(0x0098)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4BCC3F7145A9FA4683D5FE9E44B0F767; // 0x04F8(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_D20022EC456996650C5FAABD9F94D5EE; // 0x0540(0x0048)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_890FCD7B4F0BC2EEEACB239A83BE5515; // 0x0588(0x0268)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6F4A94024B5C2ABE419876B18771368A; // 0x07F0(0x0268)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7DD61B914A5D12998FBEB0A641F3B55D; // 0x0A58(0x0268)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_F7EDF3B142843689DC3442A6FE1CD5A2; // 0x0CC0(0x0268)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x0F28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_F_Med_Soldier_01_Skeleton_AnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_F_Med_Soldier_01_Skeleton_AnimBP_AnimGraphNode_CopyPoseFromMesh_FAD98FF0469710A7BDE0EDBF8A706451();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_Med_Soldier_01_Skeleton_AnimBP_C">();
	}
	static class UF_Med_Soldier_01_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_Med_Soldier_01_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(UF_Med_Soldier_01_Skeleton_AnimBP_C) == 0x000008, "Wrong alignment on UF_Med_Soldier_01_Skeleton_AnimBP_C");
static_assert(sizeof(UF_Med_Soldier_01_Skeleton_AnimBP_C) == 0x000F30, "Wrong size on UF_Med_Soldier_01_Skeleton_AnimBP_C");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, UberGraphFrame) == 0x000410, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_Root_731F596B47445FF9472B5097E71E411C) == 0x000418, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_Root_731F596B47445FF9472B5097E71E411C' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_CopyPoseFromMesh_FAD98FF0469710A7BDE0EDBF8A706451) == 0x000460, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_CopyPoseFromMesh_FAD98FF0469710A7BDE0EDBF8A706451' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_LocalToComponentSpace_4BCC3F7145A9FA4683D5FE9E44B0F767) == 0x0004F8, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_LocalToComponentSpace_4BCC3F7145A9FA4683D5FE9E44B0F767' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_D20022EC456996650C5FAABD9F94D5EE) == 0x000540, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_D20022EC456996650C5FAABD9F94D5EE' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_890FCD7B4F0BC2EEEACB239A83BE5515) == 0x000588, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_890FCD7B4F0BC2EEEACB239A83BE5515' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_6F4A94024B5C2ABE419876B18771368A) == 0x0007F0, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_6F4A94024B5C2ABE419876B18771368A' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_7DD61B914A5D12998FBEB0A641F3B55D) == 0x000A58, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_7DD61B914A5D12998FBEB0A641F3B55D' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_F7EDF3B142843689DC3442A6FE1CD5A2) == 0x000CC0, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_F7EDF3B142843689DC3442A6FE1CD5A2' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, MeshToCopy) == 0x000F28, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::MeshToCopy' has a wrong offset!");

}

