#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteGame

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Account_structs.hpp"
#include "Account_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "McpProfileSys_structs.hpp"
#include "McpProfileSys_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "Hotfix_classes.hpp"
#include "BlueprintContext_classes.hpp"
#include "PhysXVehicles_classes.hpp"
#include "Party_structs.hpp"
#include "Party_classes.hpp"
#include "Rejoin_classes.hpp"
#include "Lobby_classes.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "OnlineSubsystemUtils_classes.hpp"
#include "Foliage_classes.hpp"
#include "SignificanceManager_classes.hpp"
#include "Gauntlet_classes.hpp"


namespace SDK
{

// Class FortniteGame.AIHotSpotRenderingComponent
// 0x0000 (0x0670 - 0x0670)
class UAIHotSpotRenderingComponent final : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIHotSpotRenderingComponent">();
	}
	static class UAIHotSpotRenderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIHotSpotRenderingComponent>();
	}
};
static_assert(alignof(UAIHotSpotRenderingComponent) == 0x000010, "Wrong alignment on UAIHotSpotRenderingComponent");
static_assert(sizeof(UAIHotSpotRenderingComponent) == 0x000670, "Wrong size on UAIHotSpotRenderingComponent");

// Class FortniteGame.FortInventorySortFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UFortInventorySortFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class FText GetCriterionDisplayNameOfSortType(EInventoryContentSortType SortType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortInventorySortFunctionLibrary">();
	}
	static class UFortInventorySortFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortInventorySortFunctionLibrary>();
	}
};
static_assert(alignof(UFortInventorySortFunctionLibrary) == 0x000008, "Wrong alignment on UFortInventorySortFunctionLibrary");
static_assert(sizeof(UFortInventorySortFunctionLibrary) == 0x000028, "Wrong size on UFortInventorySortFunctionLibrary");

// Class FortniteGame.BuildingStructuralSupportSystem
// 0x0448 (0x0470 - 0x0028)
class UBuildingStructuralSupportSystem final : public UObject
{
public:
	uint8                                         Pad_28[0x240];                                     // 0x0028(0x0240)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABuildingLayoutRequirement*>     LayoutRequirementActorsToRegister;                 // 0x0268(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_278[0x1E8];                                    // 0x0278(0x01E8)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortNavigationGraph*                   NavGraph;                                          // 0x0460(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_468[0x8];                                      // 0x0468(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetLogicalBuildingGroundSupportedActors(int32 LogicalIndex, TArray<class ABuildingSMActor*>* LogicalBuildingGroundSupportedActors);
	void K2_GetLogicalBuildingActors(int32 LogicalIdx, TArray<class ABuildingSMActor*>* LogicalBuildingActors);

	bool IsBuildingActorStructurallySupported(const class ABuildingSMActor* ActorToCheck) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuildingStructuralSupportSystem">();
	}
	static class UBuildingStructuralSupportSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuildingStructuralSupportSystem>();
	}
};
static_assert(alignof(UBuildingStructuralSupportSystem) == 0x000008, "Wrong alignment on UBuildingStructuralSupportSystem");
static_assert(sizeof(UBuildingStructuralSupportSystem) == 0x000470, "Wrong size on UBuildingStructuralSupportSystem");
static_assert(offsetof(UBuildingStructuralSupportSystem, LayoutRequirementActorsToRegister) == 0x000268, "Member 'UBuildingStructuralSupportSystem::LayoutRequirementActorsToRegister' has a wrong offset!");
static_assert(offsetof(UBuildingStructuralSupportSystem, NavGraph) == 0x000460, "Member 'UBuildingStructuralSupportSystem::NavGraph' has a wrong offset!");

// Class FortniteGame.AIHotSpotSlot
// 0x0098 (0x00C0 - 0x0028)
class UAIHotSpotSlot : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalTransform;                                    // 0x0030(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         Height;                                            // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Radius;                                            // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DistanceToFocusActor;                              // 0x0068(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         UserId;                                            // 0x006C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bStartEnabled : 1;                                 // 0x0070(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bHasCachedAgentData : 1;                           // 0x0070(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bHasOverlappingSlots : 1;                          // 0x0070(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bHasDistanceToFocusActor : 1;                      // 0x0070(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsBlockingOthers : 1;                             // 0x0070(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsEnabled : 1;                                    // 0x0070(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          Owner;                                             // 0x0078(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SlotIndex;                                         // 0x0080(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAIHotSpotSlot                                SlotState;                                         // 0x0084(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_85[0x3B];                                      // 0x0085(0x003B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearSlot();
	void OnStateChanged(class AAIController* SlotOwner, EAIHotSpotSlot NewState);
	void SetSlotEnabled(bool bNewEnabled);
	void SetSlotOwnerAndState(class AAIController* NewOwner, EAIHotSpotSlot NewState);
	void SetSlotState(EAIHotSpotSlot NewState);

	class AAIHotSpot* GetHotSpot() const;
	struct FBox GetSlotBounds() const;
	float GetSlotHeight() const;
	int32 GetSlotIndex() const;
	struct FVector GetSlotLocation() const;
	class AAIController* GetSlotOwner() const;
	float GetSlotRadius() const;
	struct FRotator GetSlotRotation() const;
	EAIHotSpotSlot GetSlotState() const;
	int32 GetSlotUserId() const;
	bool HasUserId() const;
	bool IsAIAllowed(const class AAIController* AI) const;
	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIHotSpotSlot">();
	}
	static class UAIHotSpotSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIHotSpotSlot>();
	}
};
static_assert(alignof(UAIHotSpotSlot) == 0x000010, "Wrong alignment on UAIHotSpotSlot");
static_assert(sizeof(UAIHotSpotSlot) == 0x0000C0, "Wrong size on UAIHotSpotSlot");
static_assert(offsetof(UAIHotSpotSlot, LocalTransform) == 0x000030, "Member 'UAIHotSpotSlot::LocalTransform' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlot, Height) == 0x000060, "Member 'UAIHotSpotSlot::Height' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlot, Radius) == 0x000064, "Member 'UAIHotSpotSlot::Radius' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlot, DistanceToFocusActor) == 0x000068, "Member 'UAIHotSpotSlot::DistanceToFocusActor' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlot, UserId) == 0x00006C, "Member 'UAIHotSpotSlot::UserId' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlot, Owner) == 0x000078, "Member 'UAIHotSpotSlot::Owner' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlot, SlotIndex) == 0x000080, "Member 'UAIHotSpotSlot::SlotIndex' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlot, SlotState) == 0x000084, "Member 'UAIHotSpotSlot::SlotState' has a wrong offset!");

// Class FortniteGame.FortSearchPass
// 0x0268 (0x0290 - 0x0028)
class UFortSearchPass final : public UObject
{
public:
	uint8                                         Pad_28[0x148];                                     // 0x0028(0x0148)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSessionHelper*                     SessionHelper;                                     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_178[0x48];                                     // 0x0178(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortSearchPassParams                  CurrentSearchParams;                               // 0x01C0(0x0028)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FFortSearchPassState                   CurrentSearchPassState;                            // 0x01E8(0x0018)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_200[0x90];                                     // 0x0200(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSearchPass">();
	}
	static class UFortSearchPass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSearchPass>();
	}
};
static_assert(alignof(UFortSearchPass) == 0x000008, "Wrong alignment on UFortSearchPass");
static_assert(sizeof(UFortSearchPass) == 0x000290, "Wrong size on UFortSearchPass");
static_assert(offsetof(UFortSearchPass, SessionHelper) == 0x000170, "Member 'UFortSearchPass::SessionHelper' has a wrong offset!");
static_assert(offsetof(UFortSearchPass, CurrentSearchParams) == 0x0001C0, "Member 'UFortSearchPass::CurrentSearchParams' has a wrong offset!");
static_assert(offsetof(UFortSearchPass, CurrentSearchPassState) == 0x0001E8, "Member 'UFortSearchPass::CurrentSearchPassState' has a wrong offset!");

// Class FortniteGame.FortAttributeSet
// 0x0000 (0x0030 - 0x0030)
class UFortAttributeSet : public UAttributeSet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAttributeSet">();
	}
	static class UFortAttributeSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAttributeSet>();
	}
};
static_assert(alignof(UFortAttributeSet) == 0x000008, "Wrong alignment on UFortAttributeSet");
static_assert(sizeof(UFortAttributeSet) == 0x000030, "Wrong size on UFortAttributeSet");

// Class FortniteGame.FortWeaponAttrSet
// 0x0100 (0x0130 - 0x0030)
class UFortWeaponAttrSet final : public UFortAttributeSet
{
public:
	struct FFortGameplayAttributeData             WeaponChanceToNotConsumeAmmo;                      // 0x0030(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             AccumulatedWeaponChanceToNotConsumeAmmo;           // 0x0050(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             WeaponRateOfFire;                                  // 0x0070(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             WeaponHorizontalRecoil;                            // 0x0090(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             WeaponVerticalRecoil;                              // 0x00B0(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             WeaponReloadSpeed;                                 // 0x00D0(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             WeaponAmmoClipSize;                                // 0x00F0(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             CharacterItemDurabilityDecayModifier;              // 0x0110(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)

public:
	void OnRep_AccumulatedWeaponChanceToNotConsumeAmmo();
	void OnRep_CharacterItemDurabilityDecayModifier();
	void OnRep_WeaponAmmoClipSize();
	void OnRep_WeaponChanceToNotConsumeAmmo();
	void OnRep_WeaponHorizontalRecoil();
	void OnRep_WeaponRateOfFire();
	void OnRep_WeaponReloadSpeed();
	void OnRep_WeaponVerticalRecoil();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortWeaponAttrSet">();
	}
	static class UFortWeaponAttrSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortWeaponAttrSet>();
	}
};
static_assert(alignof(UFortWeaponAttrSet) == 0x000008, "Wrong alignment on UFortWeaponAttrSet");
static_assert(sizeof(UFortWeaponAttrSet) == 0x000130, "Wrong size on UFortWeaponAttrSet");
static_assert(offsetof(UFortWeaponAttrSet, WeaponChanceToNotConsumeAmmo) == 0x000030, "Member 'UFortWeaponAttrSet::WeaponChanceToNotConsumeAmmo' has a wrong offset!");
static_assert(offsetof(UFortWeaponAttrSet, AccumulatedWeaponChanceToNotConsumeAmmo) == 0x000050, "Member 'UFortWeaponAttrSet::AccumulatedWeaponChanceToNotConsumeAmmo' has a wrong offset!");
static_assert(offsetof(UFortWeaponAttrSet, WeaponRateOfFire) == 0x000070, "Member 'UFortWeaponAttrSet::WeaponRateOfFire' has a wrong offset!");
static_assert(offsetof(UFortWeaponAttrSet, WeaponHorizontalRecoil) == 0x000090, "Member 'UFortWeaponAttrSet::WeaponHorizontalRecoil' has a wrong offset!");
static_assert(offsetof(UFortWeaponAttrSet, WeaponVerticalRecoil) == 0x0000B0, "Member 'UFortWeaponAttrSet::WeaponVerticalRecoil' has a wrong offset!");
static_assert(offsetof(UFortWeaponAttrSet, WeaponReloadSpeed) == 0x0000D0, "Member 'UFortWeaponAttrSet::WeaponReloadSpeed' has a wrong offset!");
static_assert(offsetof(UFortWeaponAttrSet, WeaponAmmoClipSize) == 0x0000F0, "Member 'UFortWeaponAttrSet::WeaponAmmoClipSize' has a wrong offset!");
static_assert(offsetof(UFortWeaponAttrSet, CharacterItemDurabilityDecayModifier) == 0x000110, "Member 'UFortWeaponAttrSet::CharacterItemDurabilityDecayModifier' has a wrong offset!");

// Class FortniteGame.AIHotSpotSlotGenerator
// 0x0000 (0x0028 - 0x0028)
class UAIHotSpotSlotGenerator : public UObject
{
public:
	void GenerateSlots();

	class UAIHotSpotSlot* AddSlot(const struct FVector& RelativeLocation, const struct FRotator& RelativeRotation, TSubclassOf<class UAIHotSpotSlot> CustomSlotClass, bool bEnabled) const;
	class AAIHotSpot* GetHotSpot() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIHotSpotSlotGenerator">();
	}
	static class UAIHotSpotSlotGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIHotSpotSlotGenerator>();
	}
};
static_assert(alignof(UAIHotSpotSlotGenerator) == 0x000008, "Wrong alignment on UAIHotSpotSlotGenerator");
static_assert(sizeof(UAIHotSpotSlotGenerator) == 0x000028, "Wrong size on UAIHotSpotSlotGenerator");

// Class FortniteGame.AIHotSpotSlotGenerator_OnBoundingBox
// 0x0048 (0x0070 - 0x0028)
class UAIHotSpotSlotGenerator_OnBoundingBox : public UAIHotSpotSlotGenerator
{
public:
	TSubclassOf<class UAIHotSpotSlot>             SlotClass;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MaxExtent;                                         // 0x0030(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpandBy;                                          // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetFromEdge;                                    // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Spacing;                                           // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bLimitMaxExtent : 1;                               // 0x0048(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMustHitFocusActor : 1;                            // 0x0048(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EBoundingBoxSlotDirectionCalculation          SlotDirectionCalculation;                          // 0x004C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x23];                                      // 0x004D(0x0023)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIHotSpotSlotGenerator_OnBoundingBox">();
	}
	static class UAIHotSpotSlotGenerator_OnBoundingBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIHotSpotSlotGenerator_OnBoundingBox>();
	}
};
static_assert(alignof(UAIHotSpotSlotGenerator_OnBoundingBox) == 0x000008, "Wrong alignment on UAIHotSpotSlotGenerator_OnBoundingBox");
static_assert(sizeof(UAIHotSpotSlotGenerator_OnBoundingBox) == 0x000070, "Wrong size on UAIHotSpotSlotGenerator_OnBoundingBox");
static_assert(offsetof(UAIHotSpotSlotGenerator_OnBoundingBox, SlotClass) == 0x000028, "Member 'UAIHotSpotSlotGenerator_OnBoundingBox::SlotClass' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlotGenerator_OnBoundingBox, MaxExtent) == 0x000030, "Member 'UAIHotSpotSlotGenerator_OnBoundingBox::MaxExtent' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlotGenerator_OnBoundingBox, ExpandBy) == 0x00003C, "Member 'UAIHotSpotSlotGenerator_OnBoundingBox::ExpandBy' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlotGenerator_OnBoundingBox, OffsetFromEdge) == 0x000040, "Member 'UAIHotSpotSlotGenerator_OnBoundingBox::OffsetFromEdge' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlotGenerator_OnBoundingBox, Spacing) == 0x000044, "Member 'UAIHotSpotSlotGenerator_OnBoundingBox::Spacing' has a wrong offset!");
static_assert(offsetof(UAIHotSpotSlotGenerator_OnBoundingBox, SlotDirectionCalculation) == 0x00004C, "Member 'UAIHotSpotSlotGenerator_OnBoundingBox::SlotDirectionCalculation' has a wrong offset!");

// Class FortniteGame.FortQueryGenerator_TerrainDonut
// 0x00D0 (0x0120 - 0x0050)
class UFortQueryGenerator_TerrainDonut final : public UEnvQueryGenerator
{
public:
	TSubclassOf<class UEnvQueryContext>           Center;                                            // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              Radius;                                            // 0x0058(0x0030)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              RadiusWidth;                                       // 0x0088(0x0030)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              SpacingArc;                                        // 0x00B8(0x0030)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderIntValue                NumRings;                                          // 0x00E8(0x0030)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         bFilterAllowTerrain : 1;                           // 0x0118(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFilterAllowBuildings : 1;                         // 0x0118(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryGenerator_TerrainDonut">();
	}
	static class UFortQueryGenerator_TerrainDonut* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryGenerator_TerrainDonut>();
	}
};
static_assert(alignof(UFortQueryGenerator_TerrainDonut) == 0x000008, "Wrong alignment on UFortQueryGenerator_TerrainDonut");
static_assert(sizeof(UFortQueryGenerator_TerrainDonut) == 0x000120, "Wrong size on UFortQueryGenerator_TerrainDonut");
static_assert(offsetof(UFortQueryGenerator_TerrainDonut, Center) == 0x000050, "Member 'UFortQueryGenerator_TerrainDonut::Center' has a wrong offset!");
static_assert(offsetof(UFortQueryGenerator_TerrainDonut, Radius) == 0x000058, "Member 'UFortQueryGenerator_TerrainDonut::Radius' has a wrong offset!");
static_assert(offsetof(UFortQueryGenerator_TerrainDonut, RadiusWidth) == 0x000088, "Member 'UFortQueryGenerator_TerrainDonut::RadiusWidth' has a wrong offset!");
static_assert(offsetof(UFortQueryGenerator_TerrainDonut, SpacingArc) == 0x0000B8, "Member 'UFortQueryGenerator_TerrainDonut::SpacingArc' has a wrong offset!");
static_assert(offsetof(UFortQueryGenerator_TerrainDonut, NumRings) == 0x0000E8, "Member 'UFortQueryGenerator_TerrainDonut::NumRings' has a wrong offset!");

// Class FortniteGame.FortDifficultyOption
// 0x0018 (0x0040 - 0x0028)
class UFortDifficultyOption : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CostAndAvailability;                               // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDifficultyOption">();
	}
	static class UFortDifficultyOption* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDifficultyOption>();
	}
};
static_assert(alignof(UFortDifficultyOption) == 0x000008, "Wrong alignment on UFortDifficultyOption");
static_assert(sizeof(UFortDifficultyOption) == 0x000040, "Wrong size on UFortDifficultyOption");
static_assert(offsetof(UFortDifficultyOption, CostAndAvailability) == 0x000030, "Member 'UFortDifficultyOption::CostAndAvailability' has a wrong offset!");

// Class FortniteGame.FortDifficultyOptionEncounter
// 0x0008 (0x0048 - 0x0040)
class UFortDifficultyOptionEncounter : public UFortDifficultyOption
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDifficultyOptionEncounter">();
	}
	static class UFortDifficultyOptionEncounter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDifficultyOptionEncounter>();
	}
};
static_assert(alignof(UFortDifficultyOptionEncounter) == 0x000008, "Wrong alignment on UFortDifficultyOptionEncounter");
static_assert(sizeof(UFortDifficultyOptionEncounter) == 0x000048, "Wrong size on UFortDifficultyOptionEncounter");

// Class FortniteGame.FortDifficultyOptionEncounter_UtilitiesAdjustment
// 0x0008 (0x0050 - 0x0048)
class UFortDifficultyOptionEncounter_UtilitiesAdjustment final : public UFortDifficultyOptionEncounter
{
public:
	float                                         UtilitiesAdjustmentIntervalSeconds;                // 0x0048(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDifficultyOptionEncounter_UtilitiesAdjustment">();
	}
	static class UFortDifficultyOptionEncounter_UtilitiesAdjustment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDifficultyOptionEncounter_UtilitiesAdjustment>();
	}
};
static_assert(alignof(UFortDifficultyOptionEncounter_UtilitiesAdjustment) == 0x000008, "Wrong alignment on UFortDifficultyOptionEncounter_UtilitiesAdjustment");
static_assert(sizeof(UFortDifficultyOptionEncounter_UtilitiesAdjustment) == 0x000050, "Wrong size on UFortDifficultyOptionEncounter_UtilitiesAdjustment");
static_assert(offsetof(UFortDifficultyOptionEncounter_UtilitiesAdjustment, UtilitiesAdjustmentIntervalSeconds) == 0x000048, "Member 'UFortDifficultyOptionEncounter_UtilitiesAdjustment::UtilitiesAdjustmentIntervalSeconds' has a wrong offset!");

// Class FortniteGame.FortMultiSizeBrushAsset
// 0x0360 (0x0388 - 0x0028)
class UFortMultiSizeBrushAsset final : public UDataAsset
{
public:
	struct FFortMultiSizeBrush                    Brush;                                             // 0x0028(0x0360)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMultiSizeBrushAsset">();
	}
	static class UFortMultiSizeBrushAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMultiSizeBrushAsset>();
	}
};
static_assert(alignof(UFortMultiSizeBrushAsset) == 0x000008, "Wrong alignment on UFortMultiSizeBrushAsset");
static_assert(sizeof(UFortMultiSizeBrushAsset) == 0x000388, "Wrong size on UFortMultiSizeBrushAsset");
static_assert(offsetof(UFortMultiSizeBrushAsset, Brush) == 0x000028, "Member 'UFortMultiSizeBrushAsset::Brush' has a wrong offset!");

// Class FortniteGame.FortReplaySpectatorPawnBase
// 0x0008 (0x0418 - 0x0410)
class AFortReplaySpectatorPawnBase : public ASpectatorPawn
{
public:
	class UFortReplaySpectatorCameraComponent*    SpectatorCameraComponent;                          // 0x0410(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortReplaySpectatorPawnBase">();
	}
	static class AFortReplaySpectatorPawnBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortReplaySpectatorPawnBase>();
	}
};
static_assert(alignof(AFortReplaySpectatorPawnBase) == 0x000008, "Wrong alignment on AFortReplaySpectatorPawnBase");
static_assert(sizeof(AFortReplaySpectatorPawnBase) == 0x000418, "Wrong size on AFortReplaySpectatorPawnBase");
static_assert(offsetof(AFortReplaySpectatorPawnBase, SpectatorCameraComponent) == 0x000410, "Member 'AFortReplaySpectatorPawnBase::SpectatorCameraComponent' has a wrong offset!");

// Class FortniteGame.FortConstructionSet
// 0x01A0 (0x01D0 - 0x0030)
class UFortConstructionSet final : public UFortAttributeSet
{
public:
	struct FFortGameplayAttributeData             BuildSpeed;                                        // 0x0030(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             RepairSpeed;                                       // 0x0050(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             BuildCost;                                         // 0x0070(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             RepairCost;                                        // 0x0090(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             MaxBuildLevel;                                     // 0x00B0(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             BuildingSkill;                                     // 0x00D0(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             TrapArmSpeed;                                      // 0x00F0(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             TrapReloadSpeed;                                   // 0x0110(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             TrapBaseDamage;                                    // 0x0130(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             TrapMaxDurability;                                 // 0x0150(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             TrapDiceCritChance;                                // 0x0170(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             TrapDiceCritMultiplier;                            // 0x0190(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             TrapHealingSource;                                 // 0x01B0(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)

public:
	void OnRep_BuildCost();
	void OnRep_BuildingSkill();
	void OnRep_BuildSpeed();
	void OnRep_MaxBuildLevel();
	void OnRep_RepairCost();
	void OnRep_RepairSpeed();
	void OnRep_TrapArmSpeed();
	void OnRep_TrapBaseDamage();
	void OnRep_TrapDiceCritChance();
	void OnRep_TrapDiceCritMultiplier();
	void OnRep_TrapHealingSource();
	void OnRep_TrapMaxDurability();
	void OnRep_TrapReloadSpeed();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConstructionSet">();
	}
	static class UFortConstructionSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConstructionSet>();
	}
};
static_assert(alignof(UFortConstructionSet) == 0x000008, "Wrong alignment on UFortConstructionSet");
static_assert(sizeof(UFortConstructionSet) == 0x0001D0, "Wrong size on UFortConstructionSet");
static_assert(offsetof(UFortConstructionSet, BuildSpeed) == 0x000030, "Member 'UFortConstructionSet::BuildSpeed' has a wrong offset!");
static_assert(offsetof(UFortConstructionSet, RepairSpeed) == 0x000050, "Member 'UFortConstructionSet::RepairSpeed' has a wrong offset!");
static_assert(offsetof(UFortConstructionSet, BuildCost) == 0x000070, "Member 'UFortConstructionSet::BuildCost' has a wrong offset!");
static_assert(offsetof(UFortConstructionSet, RepairCost) == 0x000090, "Member 'UFortConstructionSet::RepairCost' has a wrong offset!");
static_assert(offsetof(UFortConstructionSet, MaxBuildLevel) == 0x0000B0, "Member 'UFortConstructionSet::MaxBuildLevel' has a wrong offset!");
static_assert(offsetof(UFortConstructionSet, BuildingSkill) == 0x0000D0, "Member 'UFortConstructionSet::BuildingSkill' has a wrong offset!");
static_assert(offsetof(UFortConstructionSet, TrapArmSpeed) == 0x0000F0, "Member 'UFortConstructionSet::TrapArmSpeed' has a wrong offset!");
static_assert(offsetof(UFortConstructionSet, TrapReloadSpeed) == 0x000110, "Member 'UFortConstructionSet::TrapReloadSpeed' has a wrong offset!");
static_assert(offsetof(UFortConstructionSet, TrapBaseDamage) == 0x000130, "Member 'UFortConstructionSet::TrapBaseDamage' has a wrong offset!");
static_assert(offsetof(UFortConstructionSet, TrapMaxDurability) == 0x000150, "Member 'UFortConstructionSet::TrapMaxDurability' has a wrong offset!");
static_assert(offsetof(UFortConstructionSet, TrapDiceCritChance) == 0x000170, "Member 'UFortConstructionSet::TrapDiceCritChance' has a wrong offset!");
static_assert(offsetof(UFortConstructionSet, TrapDiceCritMultiplier) == 0x000190, "Member 'UFortConstructionSet::TrapDiceCritMultiplier' has a wrong offset!");
static_assert(offsetof(UFortConstructionSet, TrapHealingSource) == 0x0001B0, "Member 'UFortConstructionSet::TrapHealingSource' has a wrong offset!");

// Class FortniteGame.AIHotSpot
// 0x0188 (0x0510 - 0x0388)
class AAIHotSpot : public AActor
{
public:
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAIHotSpotSlot*>                 UserSlots;                                         // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UAIHotSpotSlotGenerator*                SlotGenerator;                                     // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAIHotSpotSlot*>                 Slots;                                             // 0x03A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	class AActor*                                 FocusActor;                                        // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UNavigationQueryFilter>     FilterClass;                                       // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CustomNavmeshSearchExtent;                         // 0x03C8(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bStartEnabled : 1;                                 // 0x03D4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bAllowSlotlessAssignment : 1;                      // 0x03D4(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bAllowClaimingMultipleSlots : 1;                   // 0x03D4(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bTrackOverlappingSlots : 1;                        // 0x03D4(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bProjectSlotsOnNavmesh : 1;                        // 0x03D4(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bCustomNavmeshSearchExtent : 1;                    // 0x03D4(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsEnabled : 1;                                    // 0x03D4(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAIController*>                  NoSlotAssignees;                                   // 0x03D8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E8[0x110];                                    // 0x03E8(0x0110)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    RenderingComponent;                                // 0x04F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBillboardComponent*                    SpriteComponent;                                   // 0x0500(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AssignFromWaitingList();
	int32 AssignGroupToHotspot(const TArray<class AAIController*>& GroupOfAI);
	bool AssignToHotspot(class AAIController* AI);
	bool AssignToSlotByIndex(class AAIController* AI, int32 Index_0);
	bool OccupySlotByIndex(int32 Index_0);
	bool OnAssignedClaimedBehavior(class AAIController* AI, int32 Index_0, int32 UserId, bool bWasOnWaitingList);
	bool OnAssignedOccupiedBehavior(class AAIController* AI, int32 Index_0, int32 UserId);
	bool OnAssignedSlotlessBehavior(class AAIController* AI);
	void OnHotSpotDisabled();
	void OnHotSpotEnabled();
	void OnMoveToSlotFinished(class AAIController* AI, int32 Index_0, int32 UserId, bool bResult);
	void OnRemovedBehavior(class AAIController* AI, int32 Index_0, int32 UserId, EAIHotSpotSlot PrevState, bool bWasOnWaitingList);
	void OnRemovedSlotlessBehavior(class AAIController* AI, bool bIsClamingSlot);
	void OnSlotBlocked(class AAIController* AI, int32 Index_0, int32 UserId);
	void OnSlotClaimed(class AAIController* AI, int32 Index_0, int32 UserId);
	void OnSlotDisabled(int32 Index_0, int32 UserId);
	void OnSlotEnabled(int32 Index_0, int32 UserId);
	void OnSlotFreed(class AAIController* AI, int32 Index_0, int32 UserId);
	void OnSlotOccupied(class AAIController* AI, int32 Index_0, int32 UserId);
	bool RemoveFromHotspot(class AAIController* AI, bool bAssignFromWaitingList);
	int32 RemoveGroupFromHotspot(const TArray<class AAIController*>& GroupOfAI);
	void SetEnabled(bool bEnabled);

	bool CanUseSlotByIndex(const class AAIController* AI, int32 Index_0) const;
	int32 FindBestSlotIndex(class AAIController* AI) const;
	TArray<int32> FindBestSlotIndices(const TArray<class AAIController*>& AI) const;
	TArray<class AAIController*> GetAssignedAI(EAIHotSpotAssignmentFilter Filter) const;
	int32 GetAssignedAICount(EAIHotSpotAssignmentFilter Filter) const;
	class UAIHotSpotSlot* GetSlotByIndex(int32 Index_0) const;
	class UAIHotSpotSlot* GetSlotByOwner(const class AAIController* AIOwner) const;
	int32 GetSlotCount(EAIHotSpotSlotFilter Filter) const;
	int32 GetSlotIndexByOwner(const class AAIController* AIOwner) const;
	struct FVector GetSlotLocationByIndex(int32 Index_0) const;
	class AAIController* GetSlotOwnerByIndex(int32 Index_0) const;
	struct FRotator GetSlotRotationByIndex(int32 Index_0) const;
	EAIHotSpotSlot GetSlotStateByIndex(int32 Index_0) const;
	EAIHotSpotSlot GetSlotStateByOwner(const class AAIController* AIOwner) const;
	int32 GetSlotUserIdByIndex(int32 Index_0) const;
	bool HasAssignedAI(const class AAIController* AI, EAIHotSpotAssignmentFilter Filter) const;
	bool HasEnabledSlots() const;
	bool IsAIAllowed(const class AAIController* AI) const;
	bool IsEnabled() const;
	bool IsSlotlessAssignmentAllowed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIHotSpot">();
	}
	static class AAIHotSpot* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAIHotSpot>();
	}
};
static_assert(alignof(AAIHotSpot) == 0x000008, "Wrong alignment on AAIHotSpot");
static_assert(sizeof(AAIHotSpot) == 0x000510, "Wrong size on AAIHotSpot");
static_assert(offsetof(AAIHotSpot, UserSlots) == 0x000390, "Member 'AAIHotSpot::UserSlots' has a wrong offset!");
static_assert(offsetof(AAIHotSpot, SlotGenerator) == 0x0003A0, "Member 'AAIHotSpot::SlotGenerator' has a wrong offset!");
static_assert(offsetof(AAIHotSpot, Slots) == 0x0003A8, "Member 'AAIHotSpot::Slots' has a wrong offset!");
static_assert(offsetof(AAIHotSpot, FocusActor) == 0x0003B8, "Member 'AAIHotSpot::FocusActor' has a wrong offset!");
static_assert(offsetof(AAIHotSpot, FilterClass) == 0x0003C0, "Member 'AAIHotSpot::FilterClass' has a wrong offset!");
static_assert(offsetof(AAIHotSpot, CustomNavmeshSearchExtent) == 0x0003C8, "Member 'AAIHotSpot::CustomNavmeshSearchExtent' has a wrong offset!");
static_assert(offsetof(AAIHotSpot, NoSlotAssignees) == 0x0003D8, "Member 'AAIHotSpot::NoSlotAssignees' has a wrong offset!");
static_assert(offsetof(AAIHotSpot, RenderingComponent) == 0x0004F8, "Member 'AAIHotSpot::RenderingComponent' has a wrong offset!");
static_assert(offsetof(AAIHotSpot, SpriteComponent) == 0x000500, "Member 'AAIHotSpot::SpriteComponent' has a wrong offset!");

// Class FortniteGame.FortAIHotSpot
// 0x0028 (0x0538 - 0x0510)
class AFortAIHotSpot : public AAIHotSpot
{
public:
	uint8                                         Pad_510[0x28];                                     // 0x0510(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIHotSpot">();
	}
	static class AFortAIHotSpot* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAIHotSpot>();
	}
};
static_assert(alignof(AFortAIHotSpot) == 0x000008, "Wrong alignment on AFortAIHotSpot");
static_assert(sizeof(AFortAIHotSpot) == 0x000538, "Wrong size on AFortAIHotSpot");

// Class FortniteGame.FortAIHotSpot_Shooting
// 0x0000 (0x0538 - 0x0538)
class AFortAIHotSpot_Shooting final : public AFortAIHotSpot
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIHotSpot_Shooting">();
	}
	static class AFortAIHotSpot_Shooting* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAIHotSpot_Shooting>();
	}
};
static_assert(alignof(AFortAIHotSpot_Shooting) == 0x000008, "Wrong alignment on AFortAIHotSpot_Shooting");
static_assert(sizeof(AFortAIHotSpot_Shooting) == 0x000538, "Wrong size on AFortAIHotSpot_Shooting");

// Class FortniteGame.FortQueryGenerator_HotspotSlots
// 0x0048 (0x0098 - 0x0050)
class UFortQueryGenerator_HotspotSlots final : public UEnvQueryGenerator
{
public:
	TSubclassOf<class UEnvQueryContext>           GenerateAround;                                    // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              Radius;                                            // 0x0058(0x0030)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         bUseTetherZone : 1;                                // 0x0088(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AFortAIHotSpot>             HotspotClass;                                      // 0x0090(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryGenerator_HotspotSlots">();
	}
	static class UFortQueryGenerator_HotspotSlots* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryGenerator_HotspotSlots>();
	}
};
static_assert(alignof(UFortQueryGenerator_HotspotSlots) == 0x000008, "Wrong alignment on UFortQueryGenerator_HotspotSlots");
static_assert(sizeof(UFortQueryGenerator_HotspotSlots) == 0x000098, "Wrong size on UFortQueryGenerator_HotspotSlots");
static_assert(offsetof(UFortQueryGenerator_HotspotSlots, GenerateAround) == 0x000050, "Member 'UFortQueryGenerator_HotspotSlots::GenerateAround' has a wrong offset!");
static_assert(offsetof(UFortQueryGenerator_HotspotSlots, Radius) == 0x000058, "Member 'UFortQueryGenerator_HotspotSlots::Radius' has a wrong offset!");
static_assert(offsetof(UFortQueryGenerator_HotspotSlots, HotspotClass) == 0x000090, "Member 'UFortQueryGenerator_HotspotSlots::HotspotClass' has a wrong offset!");

// Class FortniteGame.OutpostPOSTRequirementData
// 0x0020 (0x0048 - 0x0028)
class UOutpostPOSTRequirementData final : public UObject
{
public:
	class UFortItemDefinition*                    RequirementItemDefinition;                         // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalRequired;                                     // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AlreadyDeposited;                                  // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOwned;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasEnough;                                        // 0x003C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AmountToDeposit;                                   // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OutpostPOSTRequirementData">();
	}
	static class UOutpostPOSTRequirementData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOutpostPOSTRequirementData>();
	}
};
static_assert(alignof(UOutpostPOSTRequirementData) == 0x000008, "Wrong alignment on UOutpostPOSTRequirementData");
static_assert(sizeof(UOutpostPOSTRequirementData) == 0x000048, "Wrong size on UOutpostPOSTRequirementData");
static_assert(offsetof(UOutpostPOSTRequirementData, RequirementItemDefinition) == 0x000028, "Member 'UOutpostPOSTRequirementData::RequirementItemDefinition' has a wrong offset!");
static_assert(offsetof(UOutpostPOSTRequirementData, TotalRequired) == 0x000030, "Member 'UOutpostPOSTRequirementData::TotalRequired' has a wrong offset!");
static_assert(offsetof(UOutpostPOSTRequirementData, AlreadyDeposited) == 0x000034, "Member 'UOutpostPOSTRequirementData::AlreadyDeposited' has a wrong offset!");
static_assert(offsetof(UOutpostPOSTRequirementData, AmountOwned) == 0x000038, "Member 'UOutpostPOSTRequirementData::AmountOwned' has a wrong offset!");
static_assert(offsetof(UOutpostPOSTRequirementData, bHasEnough) == 0x00003C, "Member 'UOutpostPOSTRequirementData::bHasEnough' has a wrong offset!");
static_assert(offsetof(UOutpostPOSTRequirementData, AmountToDeposit) == 0x000040, "Member 'UOutpostPOSTRequirementData::AmountToDeposit' has a wrong offset!");

// Class FortniteGame.AIHotSpotManagerProxy
// 0x0058 (0x0080 - 0x0028)
class UAIHotSpotManagerProxy : public UAIHotSpotManager
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIHotSpotManagerProxy">();
	}
	static class UAIHotSpotManagerProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIHotSpotManagerProxy>();
	}
};
static_assert(alignof(UAIHotSpotManagerProxy) == 0x000008, "Wrong alignment on UAIHotSpotManagerProxy");
static_assert(sizeof(UAIHotSpotManagerProxy) == 0x000080, "Wrong size on UAIHotSpotManagerProxy");

// Class FortniteGame.FortScriptedAction
// 0x0060 (0x03E8 - 0x0388)
class AFortScriptedAction : public AActor
{
public:
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EFortScriptedActionEnvironment                ActionEnvironment;                                 // 0x0390(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortClientEventName                   ClientEventTrigger;                                // 0x0398(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ActionPriority;                                    // 0x03A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortScriptedActionParams              CachedParams;                                      // 0x03B0(0x0030)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsActive;                                         // 0x03E0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CancelAction(bool bRegisterActionAgain);
	void CompleteAction(bool bRegisterActionAgain);
	void Execute(const struct FFortScriptedActionParams& Params_0);
	void GetParams(struct FFortScriptedActionParams* Params_0);

	bool CanExecute(const struct FFortScriptedActionParams& Params_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortScriptedAction">();
	}
	static class AFortScriptedAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortScriptedAction>();
	}
};
static_assert(alignof(AFortScriptedAction) == 0x000008, "Wrong alignment on AFortScriptedAction");
static_assert(sizeof(AFortScriptedAction) == 0x0003E8, "Wrong size on AFortScriptedAction");
static_assert(offsetof(AFortScriptedAction, ActionEnvironment) == 0x000390, "Member 'AFortScriptedAction::ActionEnvironment' has a wrong offset!");
static_assert(offsetof(AFortScriptedAction, ClientEventTrigger) == 0x000398, "Member 'AFortScriptedAction::ClientEventTrigger' has a wrong offset!");
static_assert(offsetof(AFortScriptedAction, ActionPriority) == 0x0003A8, "Member 'AFortScriptedAction::ActionPriority' has a wrong offset!");
static_assert(offsetof(AFortScriptedAction, CachedParams) == 0x0003B0, "Member 'AFortScriptedAction::CachedParams' has a wrong offset!");
static_assert(offsetof(AFortScriptedAction, bIsActive) == 0x0003E0, "Member 'AFortScriptedAction::bIsActive' has a wrong offset!");

// Class FortniteGame.FortCharacterAttrSet
// 0x00A0 (0x00D0 - 0x0030)
class UFortCharacterAttrSet : public UFortAttributeSet
{
public:
	struct FFortGameplayAttributeData             Fortitude;                                         // 0x0030(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             Offense;                                           // 0x0050(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             Tech;                                              // 0x0070(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             Resistance;                                        // 0x0090(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FFortGameplayAttributeData             MaxCharacterLevel;                                 // 0x00B0(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)

public:
	void OnRep_Fortitude();
	void OnRep_MaxCharacterLevel();
	void OnRep_Offense();
	void OnRep_Resistance();
	void OnRep_Tech();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCharacterAttrSet">();
	}
	static class UFortCharacterAttrSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCharacterAttrSet>();
	}
};
static_assert(alignof(UFortCharacterAttrSet) == 0x000008, "Wrong alignment on UFortCharacterAttrSet");
static_assert(sizeof(UFortCharacterAttrSet) == 0x0000D0, "Wrong size on UFortCharacterAttrSet");
static_assert(offsetof(UFortCharacterAttrSet, Fortitude) == 0x000030, "Member 'UFortCharacterAttrSet::Fortitude' has a wrong offset!");
static_assert(offsetof(UFortCharacterAttrSet, Offense) == 0x000050, "Member 'UFortCharacterAttrSet::Offense' has a wrong offset!");
static_assert(offsetof(UFortCharacterAttrSet, Tech) == 0x000070, "Member 'UFortCharacterAttrSet::Tech' has a wrong offset!");
static_assert(offsetof(UFortCharacterAttrSet, Resistance) == 0x000090, "Member 'UFortCharacterAttrSet::Resistance' has a wrong offset!");
static_assert(offsetof(UFortCharacterAttrSet, MaxCharacterLevel) == 0x0000B0, "Member 'UFortCharacterAttrSet::MaxCharacterLevel' has a wrong offset!");

// Class FortniteGame.FortAIHotSpotSlot
// 0x0010 (0x00D0 - 0x00C0)
class UFortAIHotSpotSlot final : public UAIHotSpotSlot
{
public:
	EFortHotSpotSlot                              SlotType;                                          // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bHasProjectedLocation : 1;                         // 0x00C4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bProjectedOnLowArea : 1;                           // 0x00C4(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsAutoGenerated : 1;                              // 0x00C4(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanDuplicateOnProjection : 1;                     // 0x00C4(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
