#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "SocialTypes_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "BlueprintContext_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "EpicCMSUIFramework_classes.hpp"
#include "Slate_structs.hpp"
#include "Party_structs.hpp"


namespace SDK
{

// Class FortniteUI.FortNodeCanvasInterface
// 0x0000 (0x0028 - 0x0028)
class IFortNodeCanvasInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNodeCanvasInterface">();
	}
	static class IFortNodeCanvasInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortNodeCanvasInterface>();
	}
};
static_assert(alignof(IFortNodeCanvasInterface) == 0x000008, "Wrong alignment on IFortNodeCanvasInterface");
static_assert(sizeof(IFortNodeCanvasInterface) == 0x000028, "Wrong size on IFortNodeCanvasInterface");

// Class FortniteUI.AthenaHUDContext
// 0x0138 (0x0160 - 0x0028)
class UAthenaHUDContext final : public UBlueprintContextBase
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnLocalPlayerWon;                                  // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnLocalTeamWon;                                    // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnLocalPlayerKilledPlayer;                         // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnLocalPlayerDBNOStateChanged;                     // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnUIGameplayCue;                                   // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnViewTargetHealthChanged;                         // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnViewTargetShieldChanged;                         // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnViewTargetDBNOChanged;                           // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTeamMemberAdded;                                 // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTeamMemberRemoved;                               // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTeamHitPointFractionsChanged;                    // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTeamMemberDBNOChanged;                           // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTeamMemberRevivingChanged;                       // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTeamMemberDeadChanged;                           // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTeamMemberPlayerNamesChanged;                    // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTeamMemberTalkingChanged;                        // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTeamMemberMutedChanged;                          // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnInventoryItemSelected;                           // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bPendingAttachToHUD;                               // 0x0150(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UFortItem>               LastSelectedInventoryItem;                         // 0x0154(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleLocalPlayerDBNOStateChanged(bool bIsDBNO);
	void HandleUIGameplayCue(class FName CueName, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void SetSelectedInventoryItem(class UFortItem* Item);

	class UFortItem* GetSelectedInventoryItem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaHUDContext">();
	}
	static class UAthenaHUDContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDContext>();
	}
};
static_assert(alignof(UAthenaHUDContext) == 0x000008, "Wrong alignment on UAthenaHUDContext");
static_assert(sizeof(UAthenaHUDContext) == 0x000160, "Wrong size on UAthenaHUDContext");
static_assert(offsetof(UAthenaHUDContext, OnLocalPlayerWon) == 0x000030, "Member 'UAthenaHUDContext::OnLocalPlayerWon' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnLocalTeamWon) == 0x000040, "Member 'UAthenaHUDContext::OnLocalTeamWon' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnLocalPlayerKilledPlayer) == 0x000050, "Member 'UAthenaHUDContext::OnLocalPlayerKilledPlayer' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnLocalPlayerDBNOStateChanged) == 0x000060, "Member 'UAthenaHUDContext::OnLocalPlayerDBNOStateChanged' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnUIGameplayCue) == 0x000070, "Member 'UAthenaHUDContext::OnUIGameplayCue' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnViewTargetHealthChanged) == 0x000080, "Member 'UAthenaHUDContext::OnViewTargetHealthChanged' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnViewTargetShieldChanged) == 0x000090, "Member 'UAthenaHUDContext::OnViewTargetShieldChanged' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnViewTargetDBNOChanged) == 0x0000A0, "Member 'UAthenaHUDContext::OnViewTargetDBNOChanged' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnTeamMemberAdded) == 0x0000B0, "Member 'UAthenaHUDContext::OnTeamMemberAdded' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnTeamMemberRemoved) == 0x0000C0, "Member 'UAthenaHUDContext::OnTeamMemberRemoved' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnTeamHitPointFractionsChanged) == 0x0000D0, "Member 'UAthenaHUDContext::OnTeamHitPointFractionsChanged' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnTeamMemberDBNOChanged) == 0x0000E0, "Member 'UAthenaHUDContext::OnTeamMemberDBNOChanged' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnTeamMemberRevivingChanged) == 0x0000F0, "Member 'UAthenaHUDContext::OnTeamMemberRevivingChanged' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnTeamMemberDeadChanged) == 0x000100, "Member 'UAthenaHUDContext::OnTeamMemberDeadChanged' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnTeamMemberPlayerNamesChanged) == 0x000110, "Member 'UAthenaHUDContext::OnTeamMemberPlayerNamesChanged' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnTeamMemberTalkingChanged) == 0x000120, "Member 'UAthenaHUDContext::OnTeamMemberTalkingChanged' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnTeamMemberMutedChanged) == 0x000130, "Member 'UAthenaHUDContext::OnTeamMemberMutedChanged' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, OnInventoryItemSelected) == 0x000140, "Member 'UAthenaHUDContext::OnInventoryItemSelected' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, bPendingAttachToHUD) == 0x000150, "Member 'UAthenaHUDContext::bPendingAttachToHUD' has a wrong offset!");
static_assert(offsetof(UAthenaHUDContext, LastSelectedInventoryItem) == 0x000154, "Member 'UAthenaHUDContext::LastSelectedInventoryItem' has a wrong offset!");

// Class FortniteUI.AthenaLobbyBase
// 0x0050 (0x0430 - 0x03E0)
class UAthenaLobbyBase : public UCommonActivatablePanel
{
public:
	uint8                                         Pad_3E0[0x40];                                     // 0x03E0(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlay*                               OverlayMain;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_428[0x8];                                      // 0x0428(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBeginCursorOverPlayer(int32 PlayerIndex);
	void OnEndCursorOverPlayer(int32 PlayerIndex);
	void OnNavigationLeft();
	void OnNavigationRight();
	void OnPlayerClicked(int32 PlayerIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaLobbyBase">();
	}
	static class UAthenaLobbyBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLobbyBase>();
	}
};
static_assert(alignof(UAthenaLobbyBase) == 0x000008, "Wrong alignment on UAthenaLobbyBase");
static_assert(sizeof(UAthenaLobbyBase) == 0x000430, "Wrong size on UAthenaLobbyBase");
static_assert(offsetof(UAthenaLobbyBase, OverlayMain) == 0x000420, "Member 'UAthenaLobbyBase::OverlayMain' has a wrong offset!");

// Class FortniteUI.FortNodeCanvas
// 0x0100 (0x0240 - 0x0140)
class UFortNodeCanvas final : public UCanvasPanel
{
public:
	uint8                                         Pad_140[0x8];                                      // 0x0140(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NodePageName;                                      // 0x0148(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    NodeTypeData;                                      // 0x0150(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              OriginForParallax;                                 // 0x0160(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0xD8];                                     // 0x0168(0x00D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PanToNode(const class FName NodeID, EFortAnimSpeed PanSpeed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNodeCanvas">();
	}
	static class UFortNodeCanvas* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNodeCanvas>();
	}
};
static_assert(alignof(UFortNodeCanvas) == 0x000008, "Wrong alignment on UFortNodeCanvas");
static_assert(sizeof(UFortNodeCanvas) == 0x000240, "Wrong size on UFortNodeCanvas");
static_assert(offsetof(UFortNodeCanvas, NodePageName) == 0x000148, "Member 'UFortNodeCanvas::NodePageName' has a wrong offset!");
static_assert(offsetof(UFortNodeCanvas, NodeTypeData) == 0x000150, "Member 'UFortNodeCanvas::NodeTypeData' has a wrong offset!");
static_assert(offsetof(UFortNodeCanvas, OriginForParallax) == 0x000160, "Member 'UFortNodeCanvas::OriginForParallax' has a wrong offset!");

// Class FortniteUI.FortHUDElementWidget
// 0x0028 (0x0260 - 0x0238)
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	struct FGameplayTagContainer                  HUDElementTag;                                     // 0x0238(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenHUDElementTags);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHUDElementWidget">();
	}
	static class UFortHUDElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHUDElementWidget>();
	}
};
static_assert(alignof(UFortHUDElementWidget) == 0x000008, "Wrong alignment on UFortHUDElementWidget");
static_assert(sizeof(UFortHUDElementWidget) == 0x000260, "Wrong size on UFortHUDElementWidget");
static_assert(offsetof(UFortHUDElementWidget, HUDElementTag) == 0x000238, "Member 'UFortHUDElementWidget::HUDElementTag' has a wrong offset!");

// Class FortniteUI.FortBangWrapper
// 0x0040 (0x0170 - 0x0130)
class UFortBangWrapper final : public UContentWidget
{
public:
	uint8                                         Pad_130[0x8];                                      // 0x0130(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EFortBangSize                                 Size;                                              // 0x0138(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Offset;                                            // 0x013C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortBangType                                 BangType;                                          // 0x0144(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TutorialNameID;                                    // 0x0148(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortTutorialGlowType                         TutorialGlowType;                                  // 0x0150(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x1F];                                     // 0x0151(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBangVisibility(bool InVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBangWrapper">();
	}
	static class UFortBangWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBangWrapper>();
	}
};
static_assert(alignof(UFortBangWrapper) == 0x000008, "Wrong alignment on UFortBangWrapper");
static_assert(sizeof(UFortBangWrapper) == 0x000170, "Wrong size on UFortBangWrapper");
static_assert(offsetof(UFortBangWrapper, Size) == 0x000138, "Member 'UFortBangWrapper::Size' has a wrong offset!");
static_assert(offsetof(UFortBangWrapper, Offset) == 0x00013C, "Member 'UFortBangWrapper::Offset' has a wrong offset!");
static_assert(offsetof(UFortBangWrapper, BangType) == 0x000144, "Member 'UFortBangWrapper::BangType' has a wrong offset!");
static_assert(offsetof(UFortBangWrapper, TutorialNameID) == 0x000148, "Member 'UFortBangWrapper::TutorialNameID' has a wrong offset!");
static_assert(offsetof(UFortBangWrapper, TutorialGlowType) == 0x000150, "Member 'UFortBangWrapper::TutorialGlowType' has a wrong offset!");

// Class FortniteUI.AthenaHUDTeamIndicatorBase
// 0x0010 (0x0128 - 0x0118)
class UAthenaHUDTeamIndicatorBase final : public UWidget
{
public:
	uint8                                         Pad_118[0x10];                                     // 0x0118(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaHUDTeamIndicatorBase">();
	}
	static class UAthenaHUDTeamIndicatorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDTeamIndicatorBase>();
	}
};
static_assert(alignof(UAthenaHUDTeamIndicatorBase) == 0x000008, "Wrong alignment on UAthenaHUDTeamIndicatorBase");
static_assert(sizeof(UAthenaHUDTeamIndicatorBase) == 0x000128, "Wrong size on UAthenaHUDTeamIndicatorBase");

// Class FortniteUI.FortTabButtonInterface
// 0x0000 (0x0028 - 0x0028)
class IFortTabButtonInterface final : public IInterface
{
public:
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTabButtonInterface">();
	}
	static class IFortTabButtonInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortTabButtonInterface>();
	}
};
static_assert(alignof(IFortTabButtonInterface) == 0x000008, "Wrong alignment on IFortTabButtonInterface");
static_assert(sizeof(IFortTabButtonInterface) == 0x000028, "Wrong size on IFortTabButtonInterface");

// Class FortniteUI.FortTabListWidgetBase
// 0x0060 (0x0360 - 0x0300)
class UFortTabListWidgetBase : public UCommonTabListWidget
{
public:
	TArray<struct FFortTabListRegistrationInfo>   PreregisteredTabInfoArray;                         // 0x0300(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FFortTabButtonLabelInfo> PendingTabLabelInfoMap;                            // 0x0310(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	bool GetPreregisteredTabInfo(const class FName TabNameID, struct FFortTabListRegistrationInfo* OutTabInfo);
	void RegisterAllPreregisteredTabInfos();
	bool RegisterFortTab(class FName TabNameID, TSubclassOf<class UCommonButton> TabButtonType, const struct FFortTabButtonLabelInfo& LabelInfo, class UWidget* ContentWidget);
	void SetNextTabInputActionData(const struct FDataTableRowHandle& NextData);
	void SetPreviousTabInputActionData(const struct FDataTableRowHandle& PreviousData);

	bool IsFirstTabActive() const;
	bool IsLastTabActive() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTabListWidgetBase">();
	}
	static class UFortTabListWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTabListWidgetBase>();
	}
};
static_assert(alignof(UFortTabListWidgetBase) == 0x000008, "Wrong alignment on UFortTabListWidgetBase");
static_assert(sizeof(UFortTabListWidgetBase) == 0x000360, "Wrong size on UFortTabListWidgetBase");
static_assert(offsetof(UFortTabListWidgetBase, PreregisteredTabInfoArray) == 0x000300, "Member 'UFortTabListWidgetBase::PreregisteredTabInfoArray' has a wrong offset!");
static_assert(offsetof(UFortTabListWidgetBase, PendingTabLabelInfoMap) == 0x000310, "Member 'UFortTabListWidgetBase::PendingTabLabelInfoMap' has a wrong offset!");

// Class FortniteUI.AthenaInventoryPanelBase
// 0x0070 (0x0450 - 0x03E0)
class UAthenaInventoryPanelBase : public UCommonActivatablePanel
{
public:
	EInventoryContentSortType                     CurrentSortType;                                   // 0x03E0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonLoadGuard*                       TileViewLoadGuard;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemTileView*                      TileView;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemTileView*                      ResourceTiles;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_400[0x50];                                     // 0x0400(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AdvanceSelection();
	void CycleSortType();
	void HandleCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
	void HandleCursorModeChangedBP(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
	void HandleDifferentSortTypeSetBP();
	void HandleInventoryItemClicked(class UObject* Item);
	void HandleInventoryItemDoubleClicked(class UObject* Item);
	void HandleInventoryItemHovered(class UObject* Item);
	void HandleInventoryItemSelected(class UObject* Item, bool bIsSelected);
	void HandleInventoryUpdatedEvent();
	void HandleItemWidgetCreated(class UUserWidget* ItemWidget);
	void HandleQuickBarChangedBP(EFortQuickBars QuickBarType);
	void HandleResourceItemDoubleClicked(class UObject* Item);
	void OnInventoryItemSelected(class UFortItem* Item);
	void RequestEquip(class UFortItem* Item);
	void SetSortType(EInventoryContentSortType SortType);

	TArray<EInventoryContentSortType> GetSupportedSortTypesForCurrentInventory() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaInventoryPanelBase">();
	}
	static class UAthenaInventoryPanelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryPanelBase>();
	}
};
static_assert(alignof(UAthenaInventoryPanelBase) == 0x000008, "Wrong alignment on UAthenaInventoryPanelBase");
static_assert(sizeof(UAthenaInventoryPanelBase) == 0x000450, "Wrong size on UAthenaInventoryPanelBase");
static_assert(offsetof(UAthenaInventoryPanelBase, CurrentSortType) == 0x0003E0, "Member 'UAthenaInventoryPanelBase::CurrentSortType' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryPanelBase, TileViewLoadGuard) == 0x0003E8, "Member 'UAthenaInventoryPanelBase::TileViewLoadGuard' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryPanelBase, TileView) == 0x0003F0, "Member 'UAthenaInventoryPanelBase::TileView' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryPanelBase, ResourceTiles) == 0x0003F8, "Member 'UAthenaInventoryPanelBase::ResourceTiles' has a wrong offset!");

// Class FortniteUI.AthenaLeaderboardScreenBase
// 0x00F0 (0x04D0 - 0x03E0)
class UAthenaLeaderboardScreenBase : public UCommonActivatablePanel
{
public:
	class UFortTabListWidgetBase*                 LeaderboardTabList;                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                         MatchRotator;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                         LeaderboardTypeRotator;                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       ResetTimeText;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       RefreshTimeText;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             LeaderboardDisplayData;                            // 0x0408(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, class UCommonButton*>       ActiveTabButtons;                                  // 0x0410(0x0050)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortLeaderboardRowProxyInstance*> RowProxies;                                        // 0x0460(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortLeaderboardRowProxyInstance*> RowProxiesFreeList;                                // 0x0470(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UFortLeaderboardRowProxyInstance*       LocalUserRowProxy;                                 // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLeaderboardFilter                     CurrentLeaderboardFilter;                          // 0x0488(0x0018)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A0[0x30];                                     // 0x04A0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActiveLeaderboardTabChanged(int32 ActiveWidgetIndex);
	void OnFriendsFilterChanged(int32 FriendsFilterIndex);
	void OnMatchTypeChanged(int32 MatchTypeIndex);
	void OnQueryFinished();
	void OnQueryStarted();
	void OnUpdateLeaderboardListUI(bool bWasSuccessful, class UFortLeaderboardRowProxyInstance* LocalUserRow, const class FText& ErrorStr);
	void OnUpdateListHeader(const struct FAthenaPlaylistLeaderboardData& PlaylistTabData);
	void OnUpdateTabButtonText(class UCommonButton* Button, const struct FAthenaPlaylistLeaderboardData& PlaylistTabData);

	bool CanShowFriendsOnlyLeaderboard() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaLeaderboardScreenBase">();
	}
	static class UAthenaLeaderboardScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLeaderboardScreenBase>();
	}
};
static_assert(alignof(UAthenaLeaderboardScreenBase) == 0x000008, "Wrong alignment on UAthenaLeaderboardScreenBase");
static_assert(sizeof(UAthenaLeaderboardScreenBase) == 0x0004D0, "Wrong size on UAthenaLeaderboardScreenBase");
static_assert(offsetof(UAthenaLeaderboardScreenBase, LeaderboardTabList) == 0x0003E0, "Member 'UAthenaLeaderboardScreenBase::LeaderboardTabList' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, MatchRotator) == 0x0003E8, "Member 'UAthenaLeaderboardScreenBase::MatchRotator' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, LeaderboardTypeRotator) == 0x0003F0, "Member 'UAthenaLeaderboardScreenBase::LeaderboardTypeRotator' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, ResetTimeText) == 0x0003F8, "Member 'UAthenaLeaderboardScreenBase::ResetTimeText' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, RefreshTimeText) == 0x000400, "Member 'UAthenaLeaderboardScreenBase::RefreshTimeText' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, LeaderboardDisplayData) == 0x000408, "Member 'UAthenaLeaderboardScreenBase::LeaderboardDisplayData' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, ActiveTabButtons) == 0x000410, "Member 'UAthenaLeaderboardScreenBase::ActiveTabButtons' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, RowProxies) == 0x000460, "Member 'UAthenaLeaderboardScreenBase::RowProxies' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, RowProxiesFreeList) == 0x000470, "Member 'UAthenaLeaderboardScreenBase::RowProxiesFreeList' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, LocalUserRowProxy) == 0x000480, "Member 'UAthenaLeaderboardScreenBase::LocalUserRowProxy' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, CurrentLeaderboardFilter) == 0x000488, "Member 'UAthenaLeaderboardScreenBase::CurrentLeaderboardFilter' has a wrong offset!");

// Class FortniteUI.AthenaLootStoreScreenBase
// 0x0000 (0x03E0 - 0x03E0)
class UAthenaLootStoreScreenBase final : public UCommonActivatablePanel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaLootStoreScreenBase">();
	}
	static class UAthenaLootStoreScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLootStoreScreenBase>();
	}
};
static_assert(alignof(UAthenaLootStoreScreenBase) == 0x000008, "Wrong alignment on UAthenaLootStoreScreenBase");
static_assert(sizeof(UAthenaLootStoreScreenBase) == 0x0003E0, "Wrong size on UAthenaLootStoreScreenBase");

// Class FortniteUI.AthenaMatchReadyDesktopPopup
// 0x0070 (0x02A0 - 0x0230)
class UAthenaMatchReadyDesktopPopup final : public UUserWidget
{
public:
	uint8                                         Pad_230[0x70];                                     // 0x0230(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UserDismissedDialog(bool bBringToFront);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaMatchReadyDesktopPopup">();
	}
	static class UAthenaMatchReadyDesktopPopup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchReadyDesktopPopup>();
	}
};
static_assert(alignof(UAthenaMatchReadyDesktopPopup) == 0x000008, "Wrong alignment on UAthenaMatchReadyDesktopPopup");
static_assert(sizeof(UAthenaMatchReadyDesktopPopup) == 0x0002A0, "Wrong size on UAthenaMatchReadyDesktopPopup");

// Class FortniteUI.AthenaStatsScreenBase
// 0x0090 (0x0470 - 0x03E0)
class UAthenaStatsScreenBase : public UCommonActivatablePanel
{
public:
	class UCommonTabListWidget*                   StatsTabList;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentPlaylistId;                                 // 0x03E8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWasLastQuerySuccessful;                           // 0x03EC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3ED[0x83];                                     // 0x03ED(0x0083)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FText FormatStatValueAsElapsedTime(const struct FTimespan& ValueAsTimespan);
	class FText GetLastUpdateTime();
	int32 GetStatValue(const class FString& BaseGameplayTag);
	void OnQueryFinished(bool bWasSuccessful);
	void OnQueryStarted();
	void OnTabSelected(class FName TabName);

	class FString GetSecondTierPlaceTag() const;
	class FString GetStatGameplayTag(const class FString& BaseStatName) const;
	class FString GetThirdTierPlaceTag() const;
	class FString GetWinsTag() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaStatsScreenBase">();
	}
	static class UAthenaStatsScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaStatsScreenBase>();
	}
};
static_assert(alignof(UAthenaStatsScreenBase) == 0x000008, "Wrong alignment on UAthenaStatsScreenBase");
static_assert(sizeof(UAthenaStatsScreenBase) == 0x000470, "Wrong size on UAthenaStatsScreenBase");
static_assert(offsetof(UAthenaStatsScreenBase, StatsTabList) == 0x0003E0, "Member 'UAthenaStatsScreenBase::StatsTabList' has a wrong offset!");
static_assert(offsetof(UAthenaStatsScreenBase, CurrentPlaylistId) == 0x0003E8, "Member 'UAthenaStatsScreenBase::CurrentPlaylistId' has a wrong offset!");
static_assert(offsetof(UAthenaStatsScreenBase, bWasLastQuerySuccessful) == 0x0003EC, "Member 'UAthenaStatsScreenBase::bWasLastQuerySuccessful' has a wrong offset!");

// Class FortniteUI.FortAbilitySystemContext
// 0x0050 (0x0078 - 0x0028)
class UFortAbilitySystemContext final : public UBlueprintContextBase
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RegisterForAttributeChanged(class UWidget* Widget, class UAbilitySystemComponent* ASC, const struct FGameplayAttribute& Attribute, TDelegate<void()> Callback);
	void RemoveDelegatesFromWidget(class UWidget* Widget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAbilitySystemContext">();
	}
	static class UFortAbilitySystemContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAbilitySystemContext>();
	}
};
static_assert(alignof(UFortAbilitySystemContext) == 0x000008, "Wrong alignment on UFortAbilitySystemContext");
static_assert(sizeof(UFortAbilitySystemContext) == 0x000078, "Wrong size on UFortAbilitySystemContext");

// Class FortniteUI.FortAccountStatsContext
// 0x0000 (0x0028 - 0x0028)
class UFortAccountStatsContext final : public UBlueprintContextBase
{
public:
	bool CanShowAccountStats() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAccountStatsContext">();
	}
	static class UFortAccountStatsContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAccountStatsContext>();
	}
};
static_assert(alignof(UFortAccountStatsContext) == 0x000008, "Wrong alignment on UFortAccountStatsContext");
static_assert(sizeof(UFortAccountStatsContext) == 0x000028, "Wrong size on UFortAccountStatsContext");

// Class FortniteUI.FortActivatablePanel
// 0x0028 (0x0408 - 0x03E0)
#pragma pack(push, 0x1)
class alignas(0x08) UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	bool                                          bIsPushedOnToContentPanelStack;                    // 0x03E0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlreadyOnContentPanelStack;                     // 0x03E1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputPriority                                InputPriority;                                     // 0x03E2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E3[0x25];                                     // 0x03E3(0x0025)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RestoreCenterWidget();
	void RestoreScrollWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivatablePanel">();
	}
	static class UFortActivatablePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatablePanel>();
	}
};
#pragma pack(pop)
static_assert(alignof(UFortActivatablePanel) == 0x000008, "Wrong alignment on UFortActivatablePanel");
static_assert(sizeof(UFortActivatablePanel) == 0x000408, "Wrong size on UFortActivatablePanel");
static_assert(offsetof(UFortActivatablePanel, bIsPushedOnToContentPanelStack) == 0x0003E0, "Member 'UFortActivatablePanel::bIsPushedOnToContentPanelStack' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanel, bIsAlreadyOnContentPanelStack) == 0x0003E1, "Member 'UFortActivatablePanel::bIsAlreadyOnContentPanelStack' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanel, InputPriority) == 0x0003E2, "Member 'UFortActivatablePanel::InputPriority' has a wrong offset!");

// Class FortniteUI.FortAccountLinkingWindow
// 0x0038 (0x0440 - 0x0408)
class UFortAccountLinkingWindow : public UFortActivatablePanel
{
public:
	UMulticastDelegateProperty_                   OnNewPurchaseReceipt;                              // 0x0408(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 FoundersPackStoreCategory;                         // 0x0418(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPSPlusHasFreeAccess;                              // 0x0428(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_429[0x17];                                     // 0x0429(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsPurchaseFree() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAccountLinkingWindow">();
	}
	static class UFortAccountLinkingWindow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAccountLinkingWindow>();
	}
};
static_assert(alignof(UFortAccountLinkingWindow) == 0x000008, "Wrong alignment on UFortAccountLinkingWindow");
static_assert(sizeof(UFortAccountLinkingWindow) == 0x000440, "Wrong size on UFortAccountLinkingWindow");
static_assert(offsetof(UFortAccountLinkingWindow, OnNewPurchaseReceipt) == 0x000408, "Member 'UFortAccountLinkingWindow::OnNewPurchaseReceipt' has a wrong offset!");
static_assert(offsetof(UFortAccountLinkingWindow, FoundersPackStoreCategory) == 0x000418, "Member 'UFortAccountLinkingWindow::FoundersPackStoreCategory' has a wrong offset!");
static_assert(offsetof(UFortAccountLinkingWindow, bPSPlusHasFreeAccess) == 0x000428, "Member 'UFortAccountLinkingWindow::bPSPlusHasFreeAccess' has a wrong offset!");

// Class FortniteUI.FortAsyncAction_CheckHasRedeemForAccess
// 0x0028 (0x0050 - 0x0028)
class UFortAsyncAction_CheckHasRedeemForAccess final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnShowLinkOrBuyAccessScreen;                       // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnShowHaveEpicAccountScreen;                       // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0048(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UFortAsyncAction_CheckHasRedeemForAccess* CheckHasRedeemForAccess(class UObject* InWorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAsyncAction_CheckHasRedeemForAccess">();
	}
	static class UFortAsyncAction_CheckHasRedeemForAccess* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAsyncAction_CheckHasRedeemForAccess>();
	}
};
static_assert(alignof(UFortAsyncAction_CheckHasRedeemForAccess) == 0x000008, "Wrong alignment on UFortAsyncAction_CheckHasRedeemForAccess");
static_assert(sizeof(UFortAsyncAction_CheckHasRedeemForAccess) == 0x000050, "Wrong size on UFortAsyncAction_CheckHasRedeemForAccess");
static_assert(offsetof(UFortAsyncAction_CheckHasRedeemForAccess, OnShowLinkOrBuyAccessScreen) == 0x000028, "Member 'UFortAsyncAction_CheckHasRedeemForAccess::OnShowLinkOrBuyAccessScreen' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_CheckHasRedeemForAccess, OnShowHaveEpicAccountScreen) == 0x000038, "Member 'UFortAsyncAction_CheckHasRedeemForAccess::OnShowHaveEpicAccountScreen' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_CheckHasRedeemForAccess, WorldContextObject) == 0x000048, "Member 'UFortAsyncAction_CheckHasRedeemForAccess::WorldContextObject' has a wrong offset!");

// Class FortniteUI.FortAsyncAction_ShowPlatformStoreForPurchase
// 0x0028 (0x0050 - 0x0028)
class UFortAsyncAction_ShowPlatformStoreForPurchase final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnPurchased;                                       // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnNotPurchased;                                    // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0048(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UFortAsyncAction_ShowPlatformStoreForPurchase* ShowPlatformStoreForPurchase(class UObject* InWorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAsyncAction_ShowPlatformStoreForPurchase">();
	}
	static class UFortAsyncAction_ShowPlatformStoreForPurchase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAsyncAction_ShowPlatformStoreForPurchase>();
	}
};
static_assert(alignof(UFortAsyncAction_ShowPlatformStoreForPurchase) == 0x000008, "Wrong alignment on UFortAsyncAction_ShowPlatformStoreForPurchase");
static_assert(sizeof(UFortAsyncAction_ShowPlatformStoreForPurchase) == 0x000050, "Wrong size on UFortAsyncAction_ShowPlatformStoreForPurchase");
static_assert(offsetof(UFortAsyncAction_ShowPlatformStoreForPurchase, OnPurchased) == 0x000028, "Member 'UFortAsyncAction_ShowPlatformStoreForPurchase::OnPurchased' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_ShowPlatformStoreForPurchase, OnNotPurchased) == 0x000038, "Member 'UFortAsyncAction_ShowPlatformStoreForPurchase::OnNotPurchased' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_ShowPlatformStoreForPurchase, WorldContextObject) == 0x000048, "Member 'UFortAsyncAction_ShowPlatformStoreForPurchase::WorldContextObject' has a wrong offset!");

// Class FortniteUI.FortAsyncAction_ShowPlatformRedeemCode
// 0x0028 (0x0050 - 0x0028)
class UFortAsyncAction_ShowPlatformRedeemCode final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnCodeRedeemComplete;                              // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnCodeRedeemCanceled;                              // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0048(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UFortAsyncAction_ShowPlatformRedeemCode* ShowPlatformRedeemCode(class UObject* InWorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAsyncAction_ShowPlatformRedeemCode">();
	}
	static class UFortAsyncAction_ShowPlatformRedeemCode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAsyncAction_ShowPlatformRedeemCode>();
	}
};
static_assert(alignof(UFortAsyncAction_ShowPlatformRedeemCode) == 0x000008, "Wrong alignment on UFortAsyncAction_ShowPlatformRedeemCode");
static_assert(sizeof(UFortAsyncAction_ShowPlatformRedeemCode) == 0x000050, "Wrong size on UFortAsyncAction_ShowPlatformRedeemCode");
static_assert(offsetof(UFortAsyncAction_ShowPlatformRedeemCode, OnCodeRedeemComplete) == 0x000028, "Member 'UFortAsyncAction_ShowPlatformRedeemCode::OnCodeRedeemComplete' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_ShowPlatformRedeemCode, OnCodeRedeemCanceled) == 0x000038, "Member 'UFortAsyncAction_ShowPlatformRedeemCode::OnCodeRedeemCanceled' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_ShowPlatformRedeemCode, WorldContextObject) == 0x000048, "Member 'UFortAsyncAction_ShowPlatformRedeemCode::WorldContextObject' has a wrong offset!");

// Class FortniteUI.FortAsyncAction_WebCreateEpicAccountAndLink
// 0x0040 (0x0068 - 0x0028)
class UFortAsyncAction_WebCreateEpicAccountAndLink final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnAccountCreatedAndLinked;                         // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnAccountCreatedButNotLinked;                      // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnAccountNotCreated;                               // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0058(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAccountLinked;                                    // 0x0060(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFortAsyncAction_WebCreateEpicAccountAndLink* WebCreateEpicAccountAndLink(class UObject* InWorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAsyncAction_WebCreateEpicAccountAndLink">();
	}
	static class UFortAsyncAction_WebCreateEpicAccountAndLink* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAsyncAction_WebCreateEpicAccountAndLink>();
	}
};
static_assert(alignof(UFortAsyncAction_WebCreateEpicAccountAndLink) == 0x000008, "Wrong alignment on UFortAsyncAction_WebCreateEpicAccountAndLink");
static_assert(sizeof(UFortAsyncAction_WebCreateEpicAccountAndLink) == 0x000068, "Wrong size on UFortAsyncAction_WebCreateEpicAccountAndLink");
static_assert(offsetof(UFortAsyncAction_WebCreateEpicAccountAndLink, OnAccountCreatedAndLinked) == 0x000028, "Member 'UFortAsyncAction_WebCreateEpicAccountAndLink::OnAccountCreatedAndLinked' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_WebCreateEpicAccountAndLink, OnAccountCreatedButNotLinked) == 0x000038, "Member 'UFortAsyncAction_WebCreateEpicAccountAndLink::OnAccountCreatedButNotLinked' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_WebCreateEpicAccountAndLink, OnAccountNotCreated) == 0x000048, "Member 'UFortAsyncAction_WebCreateEpicAccountAndLink::OnAccountNotCreated' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_WebCreateEpicAccountAndLink, WorldContextObject) == 0x000058, "Member 'UFortAsyncAction_WebCreateEpicAccountAndLink::WorldContextObject' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_WebCreateEpicAccountAndLink, bAccountLinked) == 0x000060, "Member 'UFortAsyncAction_WebCreateEpicAccountAndLink::bAccountLinked' has a wrong offset!");

// Class FortniteUI.FortAsyncAction_CreateHeadlessAccount
// 0x0028 (0x0050 - 0x0028)
class UFortAsyncAction_CreateHeadlessAccount final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnAccountCreated;                                  // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnAccountNotCreated;                               // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0048(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UFortAsyncAction_CreateHeadlessAccount* CreateHeadlessAccount(class UObject* InWorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAsyncAction_CreateHeadlessAccount">();
	}
	static class UFortAsyncAction_CreateHeadlessAccount* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAsyncAction_CreateHeadlessAccount>();
	}
};
static_assert(alignof(UFortAsyncAction_CreateHeadlessAccount) == 0x000008, "Wrong alignment on UFortAsyncAction_CreateHeadlessAccount");
static_assert(sizeof(UFortAsyncAction_CreateHeadlessAccount) == 0x000050, "Wrong size on UFortAsyncAction_CreateHeadlessAccount");
static_assert(offsetof(UFortAsyncAction_CreateHeadlessAccount, OnAccountCreated) == 0x000028, "Member 'UFortAsyncAction_CreateHeadlessAccount::OnAccountCreated' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_CreateHeadlessAccount, OnAccountNotCreated) == 0x000038, "Member 'UFortAsyncAction_CreateHeadlessAccount::OnAccountNotCreated' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_CreateHeadlessAccount, WorldContextObject) == 0x000048, "Member 'UFortAsyncAction_CreateHeadlessAccount::WorldContextObject' has a wrong offset!");

// Class FortniteUI.FortUserWidget
// 0x0010 (0x0240 - 0x0230)
class UFortUserWidget : public UUserWidget
{
public:
	uint8                                         Pad_230[0x8];                                      // 0x0230(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bConsumePointerInput;                              // 0x0238(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddGrantCheatMenu(const class FString& TemplateId, const class FString& InstanceId);
	void AddStoreCheatMenu();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUserWidget">();
	}
	static class UFortUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUserWidget>();
	}
};
static_assert(alignof(UFortUserWidget) == 0x000008, "Wrong alignment on UFortUserWidget");
static_assert(sizeof(UFortUserWidget) == 0x000240, "Wrong size on UFortUserWidget");
static_assert(offsetof(UFortUserWidget, bConsumePointerInput) == 0x000238, "Member 'UFortUserWidget::bConsumePointerInput' has a wrong offset!");

// Class FortniteUI.FortListItem
// 0x0000 (0x0240 - 0x0240)
class UFortListItem final : public UFortUserWidget
{
public:
	void Private_OnExpanderArrowShiftClicked();
	void SetData(class UObject* InData);
	void SetIndexInList(int32 InIndexInList);
	void SetSelected(bool bSelected);
	void ToggleExpansion();

	int32 DoesItemHaveChildren() const;
	int32 GetIndentLevel() const;
	ESelectionMode GetSelectionMode() const;
	bool IsItemExpanded() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortListItem">();
	}
	static class UFortListItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortListItem>();
	}
};
static_assert(alignof(UFortListItem) == 0x000008, "Wrong alignment on UFortListItem");
static_assert(sizeof(UFortListItem) == 0x000240, "Wrong size on UFortListItem");

// Class FortniteUI.FortCollectionBookProgressionRewardDetailInspectWidget
// 0x0010 (0x0248 - 0x0238)
class UFortCollectionBookProgressionRewardDetailInspectWidget final : public UCommonUserWidget
{
public:
	class UCommonNumericTextBlock*                LevelTextWidget;                                   // 0x0238(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortRewardInfoWidget*                  RewardWidget;                                      // 0x0240(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetAssociatedLevel(int32 Level);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookProgressionRewardDetailInspectWidget">();
	}
	static class UFortCollectionBookProgressionRewardDetailInspectWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookProgressionRewardDetailInspectWidget>();
	}
};
static_assert(alignof(UFortCollectionBookProgressionRewardDetailInspectWidget) == 0x000008, "Wrong alignment on UFortCollectionBookProgressionRewardDetailInspectWidget");
static_assert(sizeof(UFortCollectionBookProgressionRewardDetailInspectWidget) == 0x000248, "Wrong size on UFortCollectionBookProgressionRewardDetailInspectWidget");
static_assert(offsetof(UFortCollectionBookProgressionRewardDetailInspectWidget, LevelTextWidget) == 0x000238, "Member 'UFortCollectionBookProgressionRewardDetailInspectWidget::LevelTextWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookProgressionRewardDetailInspectWidget, RewardWidget) == 0x000240, "Member 'UFortCollectionBookProgressionRewardDetailInspectWidget::RewardWidget' has a wrong offset!");

// Class FortniteUI.FortCollectionBookProgressionRewardsModalWidget
// 0x0068 (0x0470 - 0x0408)
class UFortCollectionBookProgressionRewardsModalWidget final : public UFortActivatablePanel
{
public:
	TSoftClassPtr<class UClass>                   RewardWidgetClass;                                 // 0x0408(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                RewardWidgetPadding;                               // 0x0428(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	int32                                         NumRewardsToShow;                                  // 0x0438(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBox*                           RewardBoxWidget;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           MajorRewardBoxWidget;                              // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       XPTextWidget;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonNumericTextBlock*                LevelTextWidget;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonGroup*                     ButtonGroup;                                       // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_468[0x8];                                      // 0x0468(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InspectItemBP(class UFortItem* Item);
	void OnInputMethodChanged(bool bUsingGamepad);
	void OnLevelProgressionSet(int32 CurrentLevel, float NextLvlPct);
	void OnSelectedButtonChanged(class UCommonButton* SelectedButton, int32 ButtonIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookProgressionRewardsModalWidget">();
	}
	static class UFortCollectionBookProgressionRewardsModalWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookProgressionRewardsModalWidget>();
	}
};
static_assert(alignof(UFortCollectionBookProgressionRewardsModalWidget) == 0x000008, "Wrong alignment on UFortCollectionBookProgressionRewardsModalWidget");
static_assert(sizeof(UFortCollectionBookProgressionRewardsModalWidget) == 0x000470, "Wrong size on UFortCollectionBookProgressionRewardsModalWidget");
static_assert(offsetof(UFortCollectionBookProgressionRewardsModalWidget, RewardWidgetClass) == 0x000408, "Member 'UFortCollectionBookProgressionRewardsModalWidget::RewardWidgetClass' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookProgressionRewardsModalWidget, RewardWidgetPadding) == 0x000428, "Member 'UFortCollectionBookProgressionRewardsModalWidget::RewardWidgetPadding' has a wrong offset!");
