#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_M_Avg_Player_MenusScreen_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_MenusScreen_AnimBP.Fortnite_M_Avg_Player_MenusScreen_AnimBP_C
// 0x17A0 (0x1C40 - 0x04A0)
class UFortnite_M_Avg_Player_MenusScreen_AnimBP_C final : public UFortPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_A674FFBF48506B9BA7EE8CBDBC8210BD; // 0x04A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE8; // 0x04F0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B299A69E447E60EE4F7B6C8FBE368C16; // 0x0570(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C38; // 0x05E0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_05C01B274E6CFFEB43237F82185270F4; // 0x0628(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B28; // 0x0698(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_16C670594F63485CBAD87ABDF4800661; // 0x06E0(0x00D8)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_646F5CD042D0A5ED4317CA9FB189AF7D; // 0x07B8(0x00D0)()
	uint8                                         Pad_888[0x8];                                      // 0x0888(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE7; // 0x0890(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9767634C4FD80B5DCE5D27A2D3ECF55A; // 0x0910(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C37; // 0x0980(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0C3AB68A492CB3F60B259E99EE136048; // 0x09C8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B27; // 0x0A38(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4CF53C32440BB605C95230936BD30C61; // 0x0A80(0x00D8)()
	uint8                                         Pad_B58[0x8];                                      // 0x0B58(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE6; // 0x0B60(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_517B1D0249C8EC092C471DBB5DD36220; // 0x0BE0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C36; // 0x0C50(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26F17D274A4F783FBE1BA29144FD59C0; // 0x0C98(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B26; // 0x0D08(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_152F0BA4497936B543D683B268EB17F7; // 0x0D50(0x00D8)()
	uint8                                         Pad_E28[0x8];                                      // 0x0E28(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE5; // 0x0E30(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_06673EFA4BA843B43D3D76986132A086; // 0x0EB0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C35; // 0x0F20(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1FF88FC743D30AC2123949A47B704E48; // 0x0F68(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B25; // 0x0FD8(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_FA4F2A1D4B990DE217B853803767EFEA; // 0x1020(0x00D8)()
	uint8                                         Pad_10F8[0x8];                                     // 0x10F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE4; // 0x1100(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CBF0067242E2BBE0B1BE1AAB460C3E97; // 0x1180(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C34; // 0x11F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37AC3FC042AD93F524BC0EB3B9D366CE; // 0x1238(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B24; // 0x12A8(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4797E15545A1D285BFB1C498264BFE5F; // 0x12F0(0x00D8)()
	uint8                                         Pad_13C8[0x8];                                     // 0x13C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE3; // 0x13D0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_60AE7A614B28484E515FE4AD9926EBAF; // 0x1450(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C33; // 0x14C0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_027C00EF4B400C53991ED7BEE9CF57E2; // 0x1508(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B23; // 0x1578(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_DEEE76B9479CA855B13ACDB7B1ADD3DE; // 0x15C0(0x00D8)()
	uint8                                         Pad_1698[0x8];                                     // 0x1698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE2; // 0x16A0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21E547B847DA11586F2069B996B02230; // 0x1720(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C32; // 0x1790(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F91BF94341E4790BEA4E0CAAE54C94B4; // 0x17D8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B22; // 0x1848(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_0DCD441046567AE3F7CEC1A384822795; // 0x1890(0x00D8)()
	uint8                                         Pad_1968[0x8];                                     // 0x1968(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE; // 0x1970(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_00C62FC3461975826AB7E88483FB7F99; // 0x19F0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C3; // 0x1A60(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E6363B3848E7E34F43DA088E680182A5; // 0x1AA8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B2; // 0x1B18(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_722C2AEE4FDCBF942D1588973096C898; // 0x1B60(0x00D8)()
	int32                                         ClassNameInt;                                      // 0x1C38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE_4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE_5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE_0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE_6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE_1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE_2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_BlendListByInt_646F5CD042D0A5ED4317CA9FB189AF7D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE_3();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Fortnite_M_Avg_Player_MenusScreen_AnimBP_C">();
	}
	static class UFortnite_M_Avg_Player_MenusScreen_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortnite_M_Avg_Player_MenusScreen_AnimBP_C>();
	}
};
static_assert(alignof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C) == 0x000010, "Wrong alignment on UFortnite_M_Avg_Player_MenusScreen_AnimBP_C");
static_assert(sizeof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C) == 0x001C40, "Wrong size on UFortnite_M_Avg_Player_MenusScreen_AnimBP_C");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, UberGraphFrame) == 0x0004A0, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_Root_A674FFBF48506B9BA7EE8CBDBC8210BD) == 0x0004A8, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_Root_A674FFBF48506B9BA7EE8CBDBC8210BD' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE8) == 0x0004F0, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE8' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_SequencePlayer_B299A69E447E60EE4F7B6C8FBE368C16) == 0x000570, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_SequencePlayer_B299A69E447E60EE4F7B6C8FBE368C16' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C38) == 0x0005E0, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C38' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_SequencePlayer_05C01B274E6CFFEB43237F82185270F4) == 0x000628, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_SequencePlayer_05C01B274E6CFFEB43237F82185270F4' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B28) == 0x000698, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B28' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateMachine_16C670594F63485CBAD87ABDF4800661) == 0x0006E0, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateMachine_16C670594F63485CBAD87ABDF4800661' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_BlendListByInt_646F5CD042D0A5ED4317CA9FB189AF7D) == 0x0007B8, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_BlendListByInt_646F5CD042D0A5ED4317CA9FB189AF7D' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE7) == 0x000890, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE7' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_SequencePlayer_9767634C4FD80B5DCE5D27A2D3ECF55A) == 0x000910, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_SequencePlayer_9767634C4FD80B5DCE5D27A2D3ECF55A' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C37) == 0x000980, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C37' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_SequencePlayer_0C3AB68A492CB3F60B259E99EE136048) == 0x0009C8, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_SequencePlayer_0C3AB68A492CB3F60B259E99EE136048' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B27) == 0x000A38, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B27' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateMachine_4CF53C32440BB605C95230936BD30C61) == 0x000A80, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateMachine_4CF53C32440BB605C95230936BD30C61' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE6) == 0x000B60, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE6' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_SequencePlayer_517B1D0249C8EC092C471DBB5DD36220) == 0x000BE0, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_SequencePlayer_517B1D0249C8EC092C471DBB5DD36220' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C36) == 0x000C50, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C36' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_SequencePlayer_26F17D274A4F783FBE1BA29144FD59C0) == 0x000C98, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_SequencePlayer_26F17D274A4F783FBE1BA29144FD59C0' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B26) == 0x000D08, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B26' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateMachine_152F0BA4497936B543D683B268EB17F7) == 0x000D50, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateMachine_152F0BA4497936B543D683B268EB17F7' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE5) == 0x000E30, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE5' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_SequencePlayer_06673EFA4BA843B43D3D76986132A086) == 0x000EB0, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_SequencePlayer_06673EFA4BA843B43D3D76986132A086' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C35) == 0x000F20, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C35' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_SequencePlayer_1FF88FC743D30AC2123949A47B704E48) == 0x000F68, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_SequencePlayer_1FF88FC743D30AC2123949A47B704E48' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B25) == 0x000FD8, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B25' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateMachine_FA4F2A1D4B990DE217B853803767EFEA) == 0x001020, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateMachine_FA4F2A1D4B990DE217B853803767EFEA' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE4) == 0x001100, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE4' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_SequencePlayer_CBF0067242E2BBE0B1BE1AAB460C3E97) == 0x001180, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_SequencePlayer_CBF0067242E2BBE0B1BE1AAB460C3E97' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C34) == 0x0011F0, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C34' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_SequencePlayer_37AC3FC042AD93F524BC0EB3B9D366CE) == 0x001238, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_SequencePlayer_37AC3FC042AD93F524BC0EB3B9D366CE' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B24) == 0x0012A8, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B24' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateMachine_4797E15545A1D285BFB1C498264BFE5F) == 0x0012F0, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateMachine_4797E15545A1D285BFB1C498264BFE5F' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE3) == 0x0013D0, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE3' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_SequencePlayer_60AE7A614B28484E515FE4AD9926EBAF) == 0x001450, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_SequencePlayer_60AE7A614B28484E515FE4AD9926EBAF' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C33) == 0x0014C0, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C33' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_SequencePlayer_027C00EF4B400C53991ED7BEE9CF57E2) == 0x001508, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_SequencePlayer_027C00EF4B400C53991ED7BEE9CF57E2' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B23) == 0x001578, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B23' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateMachine_DEEE76B9479CA855B13ACDB7B1ADD3DE) == 0x0015C0, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateMachine_DEEE76B9479CA855B13ACDB7B1ADD3DE' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE2) == 0x0016A0, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE2' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_SequencePlayer_21E547B847DA11586F2069B996B02230) == 0x001720, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_SequencePlayer_21E547B847DA11586F2069B996B02230' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C32) == 0x001790, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C32' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_SequencePlayer_F91BF94341E4790BEA4E0CAAE54C94B4) == 0x0017D8, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_SequencePlayer_F91BF94341E4790BEA4E0CAAE54C94B4' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B22) == 0x001848, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B22' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateMachine_0DCD441046567AE3F7CEC1A384822795) == 0x001890, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateMachine_0DCD441046567AE3F7CEC1A384822795' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE) == 0x001970, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_SequencePlayer_00C62FC3461975826AB7E88483FB7F99) == 0x0019F0, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_SequencePlayer_00C62FC3461975826AB7E88483FB7F99' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C3) == 0x001A60, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C3' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_SequencePlayer_E6363B3848E7E34F43DA088E680182A5) == 0x001AA8, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_SequencePlayer_E6363B3848E7E34F43DA088E680182A5' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B2) == 0x001B18, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B2' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, AnimGraphNode_StateMachine_722C2AEE4FDCBF942D1588973096C898) == 0x001B60, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::AnimGraphNode_StateMachine_722C2AEE4FDCBF942D1588973096C898' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_MenusScreen_AnimBP_C, ClassNameInt) == 0x001C38, "Member 'UFortnite_M_Avg_Player_MenusScreen_AnimBP_C::ClassNameInt' has a wrong offset!");

}

