#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortHeroSupportPerkWidget_Overview

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortHeroSupportPerkWidget-Overview.FortHeroSupportPerkWidget-Overview_C
// 0x0018 (0x05D0 - 0x05B8)
class UFortHeroSupportPerkWidget_Overview_C final : public UFortHeroSupportPerkWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       TypeText;                                          // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EFortBrushSize                                IconSize;                                          // 0x05C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FortHeroSupportPerkWidget_Overview(int32 EntryPoint);
	void OnSupportTypeUpdated();
	void OnHeroUpdated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortHeroSupportPerkWidget-Overview_C">();
	}
	static class UFortHeroSupportPerkWidget_Overview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHeroSupportPerkWidget_Overview_C>();
	}
};
static_assert(alignof(UFortHeroSupportPerkWidget_Overview_C) == 0x000008, "Wrong alignment on UFortHeroSupportPerkWidget_Overview_C");
static_assert(sizeof(UFortHeroSupportPerkWidget_Overview_C) == 0x0005D0, "Wrong size on UFortHeroSupportPerkWidget_Overview_C");
static_assert(offsetof(UFortHeroSupportPerkWidget_Overview_C, UberGraphFrame) == 0x0005B8, "Member 'UFortHeroSupportPerkWidget_Overview_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_Overview_C, TypeText) == 0x0005C0, "Member 'UFortHeroSupportPerkWidget_Overview_C::TypeText' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_Overview_C, IconSize) == 0x0005C8, "Member 'UFortHeroSupportPerkWidget_Overview_C::IconSize' has a wrong offset!");

}

