#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontEndRewards_ChoiceRewards

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function FrontEndRewards_ChoiceRewards.FrontEndRewards_ChoiceRewards_C.ExecuteUbergraph_FrontEndRewards_ChoiceRewards
// 0x0068 (0x0068 - 0x0000)
struct FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class URewards_ItemCard_C*                    CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards) == 0x000008, "Wrong alignment on FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards");
static_assert(sizeof(FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards) == 0x000068, "Wrong size on FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards, EntryPoint) == 0x000000, "Member 'FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards::EntryPoint' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards, CallFunc_Array_Get_Item) == 0x000018, "Member 'FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards, K2Node_Event_IsDesignTime) == 0x000020, "Member 'FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards, K2Node_ComponentBoundEvent_Button2) == 0x000028, "Member 'FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards, K2Node_ComponentBoundEvent_Button) == 0x000030, "Member 'FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards, K2Node_CreateDelegate_OutputDelegate2) == 0x000038, "Member 'FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards, K2Node_CreateDelegate_OutputDelegate3) == 0x000048, "Member 'FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards, K2Node_CreateDelegate_OutputDelegate4) == 0x000058, "Member 'FrontEndRewards_ChoiceRewards_C_ExecuteUbergraph_FrontEndRewards_ChoiceRewards::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");

// Function FrontEndRewards_ChoiceRewards.FrontEndRewards_ChoiceRewards_C.BndEvt__ButtonNope_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FrontEndRewards_ChoiceRewards_C_BndEvt__ButtonNope_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_ChoiceRewards_C_BndEvt__ButtonNope_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FrontEndRewards_ChoiceRewards_C_BndEvt__ButtonNope_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FrontEndRewards_ChoiceRewards_C_BndEvt__ButtonNope_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FrontEndRewards_ChoiceRewards_C_BndEvt__ButtonNope_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_BndEvt__ButtonNope_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FrontEndRewards_ChoiceRewards_C_BndEvt__ButtonNope_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FrontEndRewards_ChoiceRewards.FrontEndRewards_ChoiceRewards_C.BndEvt__ButtonSure_K2Node_ComponentBoundEvent_41_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FrontEndRewards_ChoiceRewards_C_BndEvt__ButtonSure_K2Node_ComponentBoundEvent_41_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_ChoiceRewards_C_BndEvt__ButtonSure_K2Node_ComponentBoundEvent_41_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FrontEndRewards_ChoiceRewards_C_BndEvt__ButtonSure_K2Node_ComponentBoundEvent_41_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FrontEndRewards_ChoiceRewards_C_BndEvt__ButtonSure_K2Node_ComponentBoundEvent_41_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FrontEndRewards_ChoiceRewards_C_BndEvt__ButtonSure_K2Node_ComponentBoundEvent_41_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_BndEvt__ButtonSure_K2Node_ComponentBoundEvent_41_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FrontEndRewards_ChoiceRewards_C_BndEvt__ButtonSure_K2Node_ComponentBoundEvent_41_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FrontEndRewards_ChoiceRewards.FrontEndRewards_ChoiceRewards_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct FrontEndRewards_ChoiceRewards_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEndRewards_ChoiceRewards_C_PreConstruct) == 0x000001, "Wrong alignment on FrontEndRewards_ChoiceRewards_C_PreConstruct");
static_assert(sizeof(FrontEndRewards_ChoiceRewards_C_PreConstruct) == 0x000001, "Wrong size on FrontEndRewards_ChoiceRewards_C_PreConstruct");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'FrontEndRewards_ChoiceRewards_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function FrontEndRewards_ChoiceRewards.FrontEndRewards_ChoiceRewards_C.AdjustCardPositions
// 0x0088 (0x0088 - 0x0000)
struct FrontEndRewards_ChoiceRewards_C_AdjustCardPositions final
{
public:
	int32                                         CurrentIndex;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CurrentSlot;                                       // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortCheatManager*                      K2Node_DynamicCast_AsFort_Cheat_Manager;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldUseNewItemCards_ReturnValue;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetCardDimensions_ReturnValue;            // 0x002C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x005C(0x0010)(NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x006C(0x0010)(NoDestructor)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions) == 0x000008, "Wrong alignment on FrontEndRewards_ChoiceRewards_C_AdjustCardPositions");
static_assert(sizeof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions) == 0x000088, "Wrong size on FrontEndRewards_ChoiceRewards_C_AdjustCardPositions");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, CurrentIndex) == 0x000000, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::CurrentIndex' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, CurrentSlot) == 0x000008, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::CurrentSlot' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, Temp_int_Variable) == 0x000010, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, K2Node_DynamicCast_AsFort_Cheat_Manager) == 0x000020, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::K2Node_DynamicCast_AsFort_Cheat_Manager' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, CallFunc_ShouldUseNewItemCards_ReturnValue) == 0x000029, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::CallFunc_ShouldUseNewItemCards_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, CallFunc_GetCardDimensions_ReturnValue) == 0x00002C, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::CallFunc_GetCardDimensions_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, CallFunc_BreakVector2D_X) == 0x000034, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, CallFunc_BreakVector2D_Y) == 0x000038, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, CallFunc_Add_FloatFloat_ReturnValue) == 0x00003C, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, CallFunc_GetChildAt_ReturnValue) == 0x000040, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000048, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, CallFunc_Add_FloatFloat_ReturnValue2) == 0x00004C, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000050, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, K2Node_DynamicCast_bSuccess2) == 0x000058, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, K2Node_MakeStruct_Margin) == 0x00005C, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, K2Node_MakeStruct_Anchors) == 0x00006C, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, CallFunc_GetChildrenCount_ReturnValue) == 0x00007C, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, CallFunc_Subtract_IntInt_ReturnValue) == 0x000080, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_AdjustCardPositions, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000084, "Member 'FrontEndRewards_ChoiceRewards_C_AdjustCardPositions::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function FrontEndRewards_ChoiceRewards.FrontEndRewards_ChoiceRewards_C.InitDesignView
// 0x0050 (0x0050 - 0x0000)
struct FrontEndRewards_ChoiceRewards_C_InitDesignView final
{
public:
	class UFortItemDefinition*                    TempItemDefinition;                                // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortItem*>                      ItemList;                                          // 0x0008(0x0010)(Edit, ZeroConstructor)
	class URewards_ItemCard_C*                    CurrentCard;                                       // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URewards_ItemCard_C*                    CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0038(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0040(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_ChoiceRewards_C_InitDesignView) == 0x000008, "Wrong alignment on FrontEndRewards_ChoiceRewards_C_InitDesignView");
static_assert(sizeof(FrontEndRewards_ChoiceRewards_C_InitDesignView) == 0x000050, "Wrong size on FrontEndRewards_ChoiceRewards_C_InitDesignView");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_InitDesignView, TempItemDefinition) == 0x000000, "Member 'FrontEndRewards_ChoiceRewards_C_InitDesignView::TempItemDefinition' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_InitDesignView, ItemList) == 0x000008, "Member 'FrontEndRewards_ChoiceRewards_C_InitDesignView::ItemList' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_InitDesignView, CurrentCard) == 0x000018, "Member 'FrontEndRewards_ChoiceRewards_C_InitDesignView::CurrentCard' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_InitDesignView, Temp_int_Variable) == 0x000020, "Member 'FrontEndRewards_ChoiceRewards_C_InitDesignView::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_InitDesignView, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'FrontEndRewards_ChoiceRewards_C_InitDesignView::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_InitDesignView, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000025, "Member 'FrontEndRewards_ChoiceRewards_C_InitDesignView::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_InitDesignView, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'FrontEndRewards_ChoiceRewards_C_InitDesignView::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_InitDesignView, CallFunc_Create_ReturnValue) == 0x000030, "Member 'FrontEndRewards_ChoiceRewards_C_InitDesignView::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_InitDesignView, CallFunc_MakeVector2D_ReturnValue) == 0x000038, "Member 'FrontEndRewards_ChoiceRewards_C_InitDesignView::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_InitDesignView, CallFunc_MakeVector2D_ReturnValue2) == 0x000040, "Member 'FrontEndRewards_ChoiceRewards_C_InitDesignView::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_InitDesignView, CallFunc_AddChildToCanvas_ReturnValue) == 0x000048, "Member 'FrontEndRewards_ChoiceRewards_C_InitDesignView::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

// Function FrontEndRewards_ChoiceRewards.FrontEndRewards_ChoiceRewards_C.SetCardSelected
// 0x0008 (0x0008 - 0x0000)
struct FrontEndRewards_ChoiceRewards_C_SetCardSelected final
{
public:
	class URewards_ItemCard_C*                    Card;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_ChoiceRewards_C_SetCardSelected) == 0x000008, "Wrong alignment on FrontEndRewards_ChoiceRewards_C_SetCardSelected");
static_assert(sizeof(FrontEndRewards_ChoiceRewards_C_SetCardSelected) == 0x000008, "Wrong size on FrontEndRewards_ChoiceRewards_C_SetCardSelected");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCardSelected, Card) == 0x000000, "Member 'FrontEndRewards_ChoiceRewards_C_SetCardSelected::Card' has a wrong offset!");

// Function FrontEndRewards_ChoiceRewards.FrontEndRewards_ChoiceRewards_C.SelectCard
// 0x0038 (0x0038 - 0x0000)
struct FrontEndRewards_ChoiceRewards_C_SelectCard final
{
public:
	int32                                         NewSelection;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue2;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URewards_ItemCard_C*                    CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URewards_ItemCard_C*                    CallFunc_Array_Get_Item2;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_ChoiceRewards_C_SelectCard) == 0x000008, "Wrong alignment on FrontEndRewards_ChoiceRewards_C_SelectCard");
static_assert(sizeof(FrontEndRewards_ChoiceRewards_C_SelectCard) == 0x000038, "Wrong size on FrontEndRewards_ChoiceRewards_C_SelectCard");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectCard, NewSelection) == 0x000000, "Member 'FrontEndRewards_ChoiceRewards_C_SelectCard::NewSelection' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectCard, CallFunc_IsVisible_ReturnValue) == 0x000004, "Member 'FrontEndRewards_ChoiceRewards_C_SelectCard::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectCard, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000005, "Member 'FrontEndRewards_ChoiceRewards_C_SelectCard::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectCard, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'FrontEndRewards_ChoiceRewards_C_SelectCard::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectCard, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'FrontEndRewards_ChoiceRewards_C_SelectCard::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectCard, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'FrontEndRewards_ChoiceRewards_C_SelectCard::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectCard, CallFunc_NotEqual_IntInt_ReturnValue2) == 0x000010, "Member 'FrontEndRewards_ChoiceRewards_C_SelectCard::CallFunc_NotEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectCard, CallFunc_Array_Get_Item) == 0x000018, "Member 'FrontEndRewards_ChoiceRewards_C_SelectCard::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectCard, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'FrontEndRewards_ChoiceRewards_C_SelectCard::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectCard, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'FrontEndRewards_ChoiceRewards_C_SelectCard::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectCard, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'FrontEndRewards_ChoiceRewards_C_SelectCard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectCard, CallFunc_Array_Get_Item2) == 0x000030, "Member 'FrontEndRewards_ChoiceRewards_C_SelectCard::CallFunc_Array_Get_Item2' has a wrong offset!");

// Function FrontEndRewards_ChoiceRewards.FrontEndRewards_ChoiceRewards_C.SelectNextCard
// 0x0010 (0x0010 - 0x0000)
struct FrontEndRewards_ChoiceRewards_C_SelectNextCard final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEndRewards_ChoiceRewards_C_SelectNextCard) == 0x000004, "Wrong alignment on FrontEndRewards_ChoiceRewards_C_SelectNextCard");
static_assert(sizeof(FrontEndRewards_ChoiceRewards_C_SelectNextCard) == 0x000010, "Wrong size on FrontEndRewards_ChoiceRewards_C_SelectNextCard");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectNextCard, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'FrontEndRewards_ChoiceRewards_C_SelectNextCard::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectNextCard, CallFunc_Array_LastIndex_ReturnValue) == 0x000004, "Member 'FrontEndRewards_ChoiceRewards_C_SelectNextCard::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectNextCard, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'FrontEndRewards_ChoiceRewards_C_SelectNextCard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectNextCard, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'FrontEndRewards_ChoiceRewards_C_SelectNextCard::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectNextCard, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'FrontEndRewards_ChoiceRewards_C_SelectNextCard::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function FrontEndRewards_ChoiceRewards.FrontEndRewards_ChoiceRewards_C.SelectPreviousCard
// 0x000C (0x000C - 0x0000)
struct FrontEndRewards_ChoiceRewards_C_SelectPreviousCard final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEndRewards_ChoiceRewards_C_SelectPreviousCard) == 0x000004, "Wrong alignment on FrontEndRewards_ChoiceRewards_C_SelectPreviousCard");
static_assert(sizeof(FrontEndRewards_ChoiceRewards_C_SelectPreviousCard) == 0x00000C, "Wrong size on FrontEndRewards_ChoiceRewards_C_SelectPreviousCard");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectPreviousCard, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'FrontEndRewards_ChoiceRewards_C_SelectPreviousCard::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectPreviousCard, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'FrontEndRewards_ChoiceRewards_C_SelectPreviousCard::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectPreviousCard, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'FrontEndRewards_ChoiceRewards_C_SelectPreviousCard::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SelectPreviousCard, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'FrontEndRewards_ChoiceRewards_C_SelectPreviousCard::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function FrontEndRewards_ChoiceRewards.FrontEndRewards_ChoiceRewards_C.HandleCardClicked
// 0x0028 (0x0028 - 0x0000)
struct FrontEndRewards_ChoiceRewards_C_HandleCardClicked final
{
public:
	class URewards_ItemCard_C*                    ItemCard;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URewards_ItemCard_C*                    CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_ChoiceRewards_C_HandleCardClicked) == 0x000008, "Wrong alignment on FrontEndRewards_ChoiceRewards_C_HandleCardClicked");
static_assert(sizeof(FrontEndRewards_ChoiceRewards_C_HandleCardClicked) == 0x000028, "Wrong size on FrontEndRewards_ChoiceRewards_C_HandleCardClicked");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_HandleCardClicked, ItemCard) == 0x000000, "Member 'FrontEndRewards_ChoiceRewards_C_HandleCardClicked::ItemCard' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_HandleCardClicked, Index_0) == 0x000008, "Member 'FrontEndRewards_ChoiceRewards_C_HandleCardClicked::Index_0' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_HandleCardClicked, CallFunc_Array_Get_Item) == 0x000010, "Member 'FrontEndRewards_ChoiceRewards_C_HandleCardClicked::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_HandleCardClicked, CallFunc_Array_Find_ReturnValue) == 0x000018, "Member 'FrontEndRewards_ChoiceRewards_C_HandleCardClicked::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_HandleCardClicked, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00001C, "Member 'FrontEndRewards_ChoiceRewards_C_HandleCardClicked::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_HandleCardClicked, CallFunc_IsVisible_ReturnValue) == 0x00001D, "Member 'FrontEndRewards_ChoiceRewards_C_HandleCardClicked::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_HandleCardClicked, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001E, "Member 'FrontEndRewards_ChoiceRewards_C_HandleCardClicked::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_HandleCardClicked, CallFunc_Array_Find_ReturnValue2) == 0x000020, "Member 'FrontEndRewards_ChoiceRewards_C_HandleCardClicked::CallFunc_Array_Find_ReturnValue2' has a wrong offset!");

// Function FrontEndRewards_ChoiceRewards.FrontEndRewards_ChoiceRewards_C.SetSelectedItemDescription
// 0x0060 (0x0060 - 0x0000)
struct FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription final
{
public:
	class UFortItem*                              CurrentItem;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTooltipContext*                    CallFunc_SpawnTooltipContext_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTooltipUIContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCombinedDescription_OutDescription;    // 0x0018(0x0018)()
	bool                                          CallFunc_GetCombinedDescription_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0018)()
	class URewards_ItemCard_C*                    CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_GetItemToRepresent_ItemToRepresent;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription) == 0x000008, "Wrong alignment on FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription");
static_assert(sizeof(FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription) == 0x000060, "Wrong size on FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription, CurrentItem) == 0x000000, "Member 'FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription::CurrentItem' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription, CallFunc_SpawnTooltipContext_ReturnValue) == 0x000008, "Member 'FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription::CallFunc_SpawnTooltipContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription, CallFunc_GetCombinedDescription_OutDescription) == 0x000018, "Member 'FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription::CallFunc_GetCombinedDescription_OutDescription' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription, CallFunc_GetCombinedDescription_ReturnValue) == 0x000030, "Member 'FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription::CallFunc_GetCombinedDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription, CallFunc_Array_Get_Item) == 0x000050, "Member 'FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription, CallFunc_GetItemToRepresent_ItemToRepresent) == 0x000058, "Member 'FrontEndRewards_ChoiceRewards_C_SetSelectedItemDescription::CallFunc_GetItemToRepresent_ItemToRepresent' has a wrong offset!");

// Function FrontEndRewards_ChoiceRewards.FrontEndRewards_ChoiceRewards_C.SetCanvasSize
// 0x0058 (0x0058 - 0x0000)
struct FrontEndRewards_ChoiceRewards_C_SetCanvasSize final
{
public:
	float                                         TotalCardSize;                                     // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalCardPadding;                                  // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCheatManager*                      K2Node_DynamicCast_AsFort_Cheat_Manager;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldUseNewItemCards_ReturnValue;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetCardDimensions_ReturnValue;            // 0x0028(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue2;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize) == 0x000008, "Wrong alignment on FrontEndRewards_ChoiceRewards_C_SetCanvasSize");
static_assert(sizeof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize) == 0x000058, "Wrong size on FrontEndRewards_ChoiceRewards_C_SetCanvasSize");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, TotalCardSize) == 0x000000, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::TotalCardSize' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, TotalCardPadding) == 0x000004, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::TotalCardPadding' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, CallFunc_GetChildrenCount_ReturnValue) == 0x000010, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, K2Node_DynamicCast_AsFort_Cheat_Manager) == 0x000018, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::K2Node_DynamicCast_AsFort_Cheat_Manager' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, CallFunc_ShouldUseNewItemCards_ReturnValue) == 0x000021, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::CallFunc_ShouldUseNewItemCards_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, CallFunc_GetCardDimensions_ReturnValue) == 0x000028, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::CallFunc_GetCardDimensions_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, CallFunc_BreakVector2D_X) == 0x000030, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, CallFunc_BreakVector2D_Y) == 0x000034, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, CallFunc_Add_FloatFloat_ReturnValue) == 0x000038, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00003C, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000040, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, CallFunc_GetChildrenCount_ReturnValue2) == 0x000044, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::CallFunc_GetChildrenCount_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, CallFunc_Subtract_IntInt_ReturnValue) == 0x000048, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00004C, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_SetCanvasSize, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000050, "Member 'FrontEndRewards_ChoiceRewards_C_SetCanvasSize::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");

// Function FrontEndRewards_ChoiceRewards.FrontEndRewards_ChoiceRewards_C.ConfirmChoice
// 0x0010 (0x0010 - 0x0000)
struct FrontEndRewards_ChoiceRewards_C_ConfirmChoice final
{
public:
	class URewards_ItemCard_C*                    CallFunc_Array_Get_Item;                           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_GetItemToRepresent_ItemToRepresent;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_ChoiceRewards_C_ConfirmChoice) == 0x000008, "Wrong alignment on FrontEndRewards_ChoiceRewards_C_ConfirmChoice");
static_assert(sizeof(FrontEndRewards_ChoiceRewards_C_ConfirmChoice) == 0x000010, "Wrong size on FrontEndRewards_ChoiceRewards_C_ConfirmChoice");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ConfirmChoice, CallFunc_Array_Get_Item) == 0x000000, "Member 'FrontEndRewards_ChoiceRewards_C_ConfirmChoice::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ConfirmChoice, CallFunc_GetItemToRepresent_ItemToRepresent) == 0x000008, "Member 'FrontEndRewards_ChoiceRewards_C_ConfirmChoice::CallFunc_GetItemToRepresent_ItemToRepresent' has a wrong offset!");

// Function FrontEndRewards_ChoiceRewards.FrontEndRewards_ChoiceRewards_C.ShowConfirmation
// 0x0030 (0x0030 - 0x0000)
struct FrontEndRewards_ChoiceRewards_C_ShowConfirmation final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URewards_ItemCard_C*                    CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEndRewards_ChoiceRewards_C_ShowConfirmation) == 0x000008, "Wrong alignment on FrontEndRewards_ChoiceRewards_C_ShowConfirmation");
static_assert(sizeof(FrontEndRewards_ChoiceRewards_C_ShowConfirmation) == 0x000030, "Wrong size on FrontEndRewards_ChoiceRewards_C_ShowConfirmation");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ShowConfirmation, Temp_int_Array_Index_Variable) == 0x000000, "Member 'FrontEndRewards_ChoiceRewards_C_ShowConfirmation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ShowConfirmation, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'FrontEndRewards_ChoiceRewards_C_ShowConfirmation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ShowConfirmation, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'FrontEndRewards_ChoiceRewards_C_ShowConfirmation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ShowConfirmation, CallFunc_GetUINavigationManager_ReturnValue) == 0x000010, "Member 'FrontEndRewards_ChoiceRewards_C_ShowConfirmation::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ShowConfirmation, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000018, "Member 'FrontEndRewards_ChoiceRewards_C_ShowConfirmation::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ShowConfirmation, CallFunc_Array_Get_Item) == 0x000020, "Member 'FrontEndRewards_ChoiceRewards_C_ShowConfirmation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ShowConfirmation, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'FrontEndRewards_ChoiceRewards_C_ShowConfirmation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_ChoiceRewards_C_ShowConfirmation, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'FrontEndRewards_ChoiceRewards_C_ShowConfirmation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function FrontEndRewards_ChoiceRewards.FrontEndRewards_ChoiceRewards_C.PopulateFromCardList
// 0x0080 (0x0080 - 0x0000)
struct FrontEndRewards_ChoiceRewards_C_PopulateFromCardList final
{
public:
	TArray<class URewards_ItemCard_C*>            Cards;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         CurrentIndex;                                      // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URewards_ItemCard_C*                    CurrentCard;                                       // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
