#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FullPartyMember

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FullPartyMember.FullPartyMember_C.ExecuteUbergraph_FullPartyMember
// 0x0280 (0x0280 - 0x0000)
struct FullPartyMember_C_ExecuteUbergraph_FullPartyMember final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFullPartyMemberConnected_C*            CallFunc_DuplicateConnectedWidget_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIManager_C*                           K2Node_DynamicCast_AsUIManager;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FConfirmationDialogAction>      CallFunc_MakeLocalPlayerConfirmActions_OutConfirmActions; // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue2;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_ShowPartyDialog*       CallFunc_ShowPartyLeaderManageDialog_ReturnValue;  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_ShowPartyDialog*       CallFunc_ShowPartyMemberManageDialog_ReturnValue;  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerPartyLeader_ReturnValue;     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowConfirmationDialog_NUI_ReturnValue;   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue2;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPartyFinder_C*                         CallFunc_Create_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPartyMemberDisplayState                  CallFunc_GetPartyMemberDisplayState_ReturnValue;   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_LocalPlayerProfileModal_C*          CallFunc_Create_ReturnValue2;                      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerInOurParty_ReturnValue;           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTeamMemberInfo                    K2Node_Event_NewInfo;                              // 0x00F0(0x0190)()
};
static_assert(alignof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember) == 0x000008, "Wrong alignment on FullPartyMember_C_ExecuteUbergraph_FullPartyMember");
static_assert(sizeof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember) == 0x000280, "Wrong size on FullPartyMember_C_ExecuteUbergraph_FullPartyMember");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, EntryPoint) == 0x000000, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::EntryPoint' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, K2Node_Event_IsDesignTime) == 0x000004, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_DuplicateConnectedWidget_ReturnValue) == 0x000008, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_DuplicateConnectedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, Temp_byte_Variable) == 0x000010, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, Temp_name_Variable) == 0x000018, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000020, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, K2Node_DynamicCast_AsUIManager) == 0x000028, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::K2Node_DynamicCast_AsUIManager' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, K2Node_CustomEvent_Result) == 0x000031, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, K2Node_CustomEvent_ResultName) == 0x000038, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_MakeLocalPlayerConfirmActions_OutConfirmActions) == 0x000040, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_MakeLocalPlayerConfirmActions_OutConfirmActions' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_Greater_IntInt_ReturnValue) == 0x000054, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x000058, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_GetOwningLocalPlayer_ReturnValue2) == 0x000060, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_GetOwningLocalPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_ShowPartyLeaderManageDialog_ReturnValue) == 0x000078, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_ShowPartyLeaderManageDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_ShowPartyMemberManageDialog_ReturnValue) == 0x000080, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_ShowPartyMemberManageDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_IsValid_ReturnValue2) == 0x000089, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_GetContext_ReturnValue) == 0x000090, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_IsLocalPlayerPartyLeader_ReturnValue) == 0x000098, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_IsLocalPlayerPartyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_ShowConfirmationDialog_NUI_ReturnValue) == 0x0000A0, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_ShowConfirmationDialog_NUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_IsValid_ReturnValue3) == 0x0000A8, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_GetUIManagerWidget_ReturnValue2) == 0x0000B0, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_GetUIManagerWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_Create_ReturnValue) == 0x0000B8, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_IsValid_ReturnValue4) == 0x0000C0, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_GetContext_ReturnValue2) == 0x0000C8, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000D0, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_GetPartyMemberDisplayState_ReturnValue) == 0x0000D8, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_GetPartyMemberDisplayState_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_Create_ReturnValue2) == 0x0000E0, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, K2Node_SwitchEnum_CmpSuccess) == 0x0000E8, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_IsPlayerInOurParty_ReturnValue) == 0x0000E9, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_IsPlayerInOurParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, CallFunc_BooleanAND_ReturnValue) == 0x0000EA, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ExecuteUbergraph_FullPartyMember, K2Node_Event_NewInfo) == 0x0000F0, "Member 'FullPartyMember_C_ExecuteUbergraph_FullPartyMember::K2Node_Event_NewInfo' has a wrong offset!");

// Function FullPartyMember.FullPartyMember_C.OnPlayerInfoChanged
// 0x0190 (0x0190 - 0x0000)
struct FullPartyMember_C_OnPlayerInfoChanged final
{
public:
	struct FFortTeamMemberInfo                    NewInfo;                                           // 0x0000(0x0190)(Parm)
};
static_assert(alignof(FullPartyMember_C_OnPlayerInfoChanged) == 0x000008, "Wrong alignment on FullPartyMember_C_OnPlayerInfoChanged");
static_assert(sizeof(FullPartyMember_C_OnPlayerInfoChanged) == 0x000190, "Wrong size on FullPartyMember_C_OnPlayerInfoChanged");
static_assert(offsetof(FullPartyMember_C_OnPlayerInfoChanged, NewInfo) == 0x000000, "Member 'FullPartyMember_C_OnPlayerInfoChanged::NewInfo' has a wrong offset!");

// Function FullPartyMember.FullPartyMember_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct FullPartyMember_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyMember_C_PreConstruct) == 0x000001, "Wrong alignment on FullPartyMember_C_PreConstruct");
static_assert(sizeof(FullPartyMember_C_PreConstruct) == 0x000001, "Wrong size on FullPartyMember_C_PreConstruct");
static_assert(offsetof(FullPartyMember_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'FullPartyMember_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function FullPartyMember.FullPartyMember_C.DialogResult_1F64669049EA0B1762273C8ED9CBB619
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FullPartyMember_C_DialogResult_1F64669049EA0B1762273C8ED9CBB619 final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyMember_C_DialogResult_1F64669049EA0B1762273C8ED9CBB619) == 0x000008, "Wrong alignment on FullPartyMember_C_DialogResult_1F64669049EA0B1762273C8ED9CBB619");
static_assert(sizeof(FullPartyMember_C_DialogResult_1F64669049EA0B1762273C8ED9CBB619) == 0x000010, "Wrong size on FullPartyMember_C_DialogResult_1F64669049EA0B1762273C8ED9CBB619");
static_assert(offsetof(FullPartyMember_C_DialogResult_1F64669049EA0B1762273C8ED9CBB619, Result) == 0x000000, "Member 'FullPartyMember_C_DialogResult_1F64669049EA0B1762273C8ED9CBB619::Result' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_DialogResult_1F64669049EA0B1762273C8ED9CBB619, ResultName) == 0x000008, "Member 'FullPartyMember_C_DialogResult_1F64669049EA0B1762273C8ED9CBB619::ResultName' has a wrong offset!");

// Function FullPartyMember.FullPartyMember_C.UpdateMemberInfo
// 0x01A0 (0x01A0 - 0x0000)
struct FullPartyMember_C_UpdateMemberInfo final
{
public:
	struct FFortTeamMemberInfo                    NewMemberInfo;                                     // 0x0000(0x0190)(Parm)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPartyMemberDisplayState                  CallFunc_GetPartyMemberDisplayState_ReturnValue;   // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyMember_C_UpdateMemberInfo) == 0x000008, "Wrong alignment on FullPartyMember_C_UpdateMemberInfo");
static_assert(sizeof(FullPartyMember_C_UpdateMemberInfo) == 0x0001A0, "Wrong size on FullPartyMember_C_UpdateMemberInfo");
static_assert(offsetof(FullPartyMember_C_UpdateMemberInfo, NewMemberInfo) == 0x000000, "Member 'FullPartyMember_C_UpdateMemberInfo::NewMemberInfo' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateMemberInfo, CallFunc_GetContext_ReturnValue) == 0x000190, "Member 'FullPartyMember_C_UpdateMemberInfo::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateMemberInfo, CallFunc_GetPartyMemberDisplayState_ReturnValue) == 0x000198, "Member 'FullPartyMember_C_UpdateMemberInfo::CallFunc_GetPartyMemberDisplayState_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateMemberInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000199, "Member 'FullPartyMember_C_UpdateMemberInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function FullPartyMember.FullPartyMember_C.ShowConnected
// 0x0040 (0x0040 - 0x0000)
struct FullPartyMember_C_ShowConnected final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidNetID_ReturnValue;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_Select_Default;                             // 0x0020(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalPlayersParty_ReturnValue;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyMember_C_ShowConnected) == 0x000008, "Wrong alignment on FullPartyMember_C_ShowConnected");
static_assert(sizeof(FullPartyMember_C_ShowConnected) == 0x000040, "Wrong size on FullPartyMember_C_ShowConnected");
static_assert(offsetof(FullPartyMember_C_ShowConnected, Temp_byte_Variable) == 0x000000, "Member 'FullPartyMember_C_ShowConnected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'FullPartyMember_C_ShowConnected::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, Temp_bool_Variable) == 0x000010, "Member 'FullPartyMember_C_ShowConnected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, Temp_bool_Variable2) == 0x000011, "Member 'FullPartyMember_C_ShowConnected::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, Temp_byte_Variable2) == 0x000012, "Member 'FullPartyMember_C_ShowConnected::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, Temp_byte_Variable3) == 0x000013, "Member 'FullPartyMember_C_ShowConnected::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, Temp_byte_Variable4) == 0x000014, "Member 'FullPartyMember_C_ShowConnected::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, Temp_bool_Variable3) == 0x000015, "Member 'FullPartyMember_C_ShowConnected::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, Temp_byte_Variable5) == 0x000016, "Member 'FullPartyMember_C_ShowConnected::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, Temp_byte_Variable6) == 0x000017, "Member 'FullPartyMember_C_ShowConnected::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, Temp_bool_Variable4) == 0x000018, "Member 'FullPartyMember_C_ShowConnected::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, CallFunc_Greater_IntInt_ReturnValue) == 0x000019, "Member 'FullPartyMember_C_ShowConnected::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, CallFunc_IsValidNetID_ReturnValue) == 0x00001A, "Member 'FullPartyMember_C_ShowConnected::CallFunc_IsValidNetID_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, K2Node_Select_Default) == 0x000020, "Member 'FullPartyMember_C_ShowConnected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, CallFunc_IsInLocalPlayersParty_ReturnValue) == 0x000038, "Member 'FullPartyMember_C_ShowConnected::CallFunc_IsInLocalPlayersParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, K2Node_Select2_Default) == 0x000039, "Member 'FullPartyMember_C_ShowConnected::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, K2Node_Select3_Default) == 0x00003A, "Member 'FullPartyMember_C_ShowConnected::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, CallFunc_BooleanAND_ReturnValue) == 0x00003B, "Member 'FullPartyMember_C_ShowConnected::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, CallFunc_BooleanAND_ReturnValue2) == 0x00003C, "Member 'FullPartyMember_C_ShowConnected::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_ShowConnected, K2Node_Select4_Default) == 0x00003D, "Member 'FullPartyMember_C_ShowConnected::K2Node_Select4_Default' has a wrong offset!");

// Function FullPartyMember.FullPartyMember_C.UpdateDimensions
// 0x0008 (0x0008 - 0x0000)
struct FullPartyMember_C_UpdateDimensions final
{
public:
	struct FVector2D                              NewDimensions;                                     // 0x0000(0x0008)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyMember_C_UpdateDimensions) == 0x000004, "Wrong alignment on FullPartyMember_C_UpdateDimensions");
static_assert(sizeof(FullPartyMember_C_UpdateDimensions) == 0x000008, "Wrong size on FullPartyMember_C_UpdateDimensions");
static_assert(offsetof(FullPartyMember_C_UpdateDimensions, NewDimensions) == 0x000000, "Member 'FullPartyMember_C_UpdateDimensions::NewDimensions' has a wrong offset!");

// Function FullPartyMember.FullPartyMember_C.DuplicateConnectedWidget
// 0x0018 (0x0018 - 0x0000)
struct FullPartyMember_C_DuplicateConnectedWidget final
{
public:
	class UFullPartyMemberConnected_C*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFullPartyMemberConnected_C*            CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyMember_C_DuplicateConnectedWidget) == 0x000008, "Wrong alignment on FullPartyMember_C_DuplicateConnectedWidget");
static_assert(sizeof(FullPartyMember_C_DuplicateConnectedWidget) == 0x000018, "Wrong size on FullPartyMember_C_DuplicateConnectedWidget");
static_assert(offsetof(FullPartyMember_C_DuplicateConnectedWidget, ReturnValue) == 0x000000, "Member 'FullPartyMember_C_DuplicateConnectedWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_DuplicateConnectedWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'FullPartyMember_C_DuplicateConnectedWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_DuplicateConnectedWidget, CallFunc_Create_ReturnValue) == 0x000010, "Member 'FullPartyMember_C_DuplicateConnectedWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function FullPartyMember.FullPartyMember_C.UpdateLocalPlayerAction
// 0x0028 (0x0028 - 0x0000)
struct FullPartyMember_C_UpdateLocalPlayerAction final
{
public:
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FUniqueNetIdRepl>               CallFunc_GetTeamMemberIDs_TeamMemberIDs;           // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyMember_C_UpdateLocalPlayerAction) == 0x000008, "Wrong alignment on FullPartyMember_C_UpdateLocalPlayerAction");
static_assert(sizeof(FullPartyMember_C_UpdateLocalPlayerAction) == 0x000028, "Wrong size on FullPartyMember_C_UpdateLocalPlayerAction");
static_assert(offsetof(FullPartyMember_C_UpdateLocalPlayerAction, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'FullPartyMember_C_UpdateLocalPlayerAction::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateLocalPlayerAction, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000008, "Member 'FullPartyMember_C_UpdateLocalPlayerAction::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateLocalPlayerAction, CallFunc_GetTeamMemberIDs_TeamMemberIDs) == 0x000010, "Member 'FullPartyMember_C_UpdateLocalPlayerAction::CallFunc_GetTeamMemberIDs_TeamMemberIDs' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateLocalPlayerAction, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'FullPartyMember_C_UpdateLocalPlayerAction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateLocalPlayerAction, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'FullPartyMember_C_UpdateLocalPlayerAction::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function FullPartyMember.FullPartyMember_C.HandleLocalPlayerActionsResult
// 0x0028 (0x0028 - 0x0000)
struct FullPartyMember_C_HandleLocalPlayerActionsResult final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyMember_C_HandleLocalPlayerActionsResult) == 0x000008, "Wrong alignment on FullPartyMember_C_HandleLocalPlayerActionsResult");
static_assert(sizeof(FullPartyMember_C_HandleLocalPlayerActionsResult) == 0x000028, "Wrong size on FullPartyMember_C_HandleLocalPlayerActionsResult");
static_assert(offsetof(FullPartyMember_C_HandleLocalPlayerActionsResult, Result) == 0x000000, "Member 'FullPartyMember_C_HandleLocalPlayerActionsResult::Result' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_HandleLocalPlayerActionsResult, ResultName) == 0x000008, "Member 'FullPartyMember_C_HandleLocalPlayerActionsResult::ResultName' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_HandleLocalPlayerActionsResult, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'FullPartyMember_C_HandleLocalPlayerActionsResult::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_HandleLocalPlayerActionsResult, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'FullPartyMember_C_HandleLocalPlayerActionsResult::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_HandleLocalPlayerActionsResult, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000019, "Member 'FullPartyMember_C_HandleLocalPlayerActionsResult::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_HandleLocalPlayerActionsResult, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x00001A, "Member 'FullPartyMember_C_HandleLocalPlayerActionsResult::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_HandleLocalPlayerActionsResult, CallFunc_GetContext_ReturnValue2) == 0x000020, "Member 'FullPartyMember_C_HandleLocalPlayerActionsResult::CallFunc_GetContext_ReturnValue2' has a wrong offset!");

// Function FullPartyMember.FullPartyMember_C.MakeLocalPlayerConfirmActions
// 0x01E8 (0x01E8 - 0x0000)
struct FullPartyMember_C_MakeLocalPlayerConfirmActions final
{
public:
	bool                                          LocalPlayerAlone;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConfirmationDialogAction>      OutConfirmActions;                                 // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<struct FConfirmationDialogAction>      ConfirmActions;                                    // 0x0018(0x0010)(Edit, ZeroConstructor)
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConfirmationDialogAction              K2Node_MakeStruct_ConfirmationDialogAction;        // 0x0040(0x00D0)()
	struct FConfirmationDialogAction              K2Node_MakeStruct_ConfirmationDialogAction2;       // 0x0110(0x00D0)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyMember_C_MakeLocalPlayerConfirmActions) == 0x000008, "Wrong alignment on FullPartyMember_C_MakeLocalPlayerConfirmActions");
static_assert(sizeof(FullPartyMember_C_MakeLocalPlayerConfirmActions) == 0x0001E8, "Wrong size on FullPartyMember_C_MakeLocalPlayerConfirmActions");
static_assert(offsetof(FullPartyMember_C_MakeLocalPlayerConfirmActions, LocalPlayerAlone) == 0x000000, "Member 'FullPartyMember_C_MakeLocalPlayerConfirmActions::LocalPlayerAlone' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_MakeLocalPlayerConfirmActions, OutConfirmActions) == 0x000008, "Member 'FullPartyMember_C_MakeLocalPlayerConfirmActions::OutConfirmActions' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_MakeLocalPlayerConfirmActions, ConfirmActions) == 0x000018, "Member 'FullPartyMember_C_MakeLocalPlayerConfirmActions::ConfirmActions' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_MakeLocalPlayerConfirmActions, CallFunc_GetPlatformName_ReturnValue) == 0x000028, "Member 'FullPartyMember_C_MakeLocalPlayerConfirmActions::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_MakeLocalPlayerConfirmActions, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000038, "Member 'FullPartyMember_C_MakeLocalPlayerConfirmActions::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_MakeLocalPlayerConfirmActions, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x000039, "Member 'FullPartyMember_C_MakeLocalPlayerConfirmActions::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_MakeLocalPlayerConfirmActions, CallFunc_BooleanOR_ReturnValue) == 0x00003A, "Member 'FullPartyMember_C_MakeLocalPlayerConfirmActions::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_MakeLocalPlayerConfirmActions, K2Node_MakeStruct_ConfirmationDialogAction) == 0x000040, "Member 'FullPartyMember_C_MakeLocalPlayerConfirmActions::K2Node_MakeStruct_ConfirmationDialogAction' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_MakeLocalPlayerConfirmActions, K2Node_MakeStruct_ConfirmationDialogAction2) == 0x000110, "Member 'FullPartyMember_C_MakeLocalPlayerConfirmActions::K2Node_MakeStruct_ConfirmationDialogAction2' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_MakeLocalPlayerConfirmActions, CallFunc_Array_Add_ReturnValue) == 0x0001E0, "Member 'FullPartyMember_C_MakeLocalPlayerConfirmActions::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_MakeLocalPlayerConfirmActions, CallFunc_Array_Add_ReturnValue2) == 0x0001E4, "Member 'FullPartyMember_C_MakeLocalPlayerConfirmActions::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");

// Function FullPartyMember.FullPartyMember_C.InitializeConnectedWidget
// 0x0008 (0x0008 - 0x0000)
struct FullPartyMember_C_InitializeConnectedWidget final
{
public:
	class UFullPartyMemberConnected_C*            ConnectedWidget;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyMember_C_InitializeConnectedWidget) == 0x000008, "Wrong alignment on FullPartyMember_C_InitializeConnectedWidget");
static_assert(sizeof(FullPartyMember_C_InitializeConnectedWidget) == 0x000008, "Wrong size on FullPartyMember_C_InitializeConnectedWidget");
static_assert(offsetof(FullPartyMember_C_InitializeConnectedWidget, ConnectedWidget) == 0x000000, "Member 'FullPartyMember_C_InitializeConnectedWidget::ConnectedWidget' has a wrong offset!");

// Function FullPartyMember.FullPartyMember_C.UpdateStatDisplays
// 0x0748 (0x0748 - 0x0000)
struct FullPartyMember_C_UpdateStatDisplays final
{
public:
	class FText                                   BaseStatFormatString;                              // 0x0000(0x0018)(Edit)
	class UClass*                                 ModifiedStatTextStyle;                             // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SoloStatTextStyle;                                 // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TeamStatTextStyle;                                 // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ModifiedStatFormatString;                          // 0x0030(0x0018)(Edit)
	class FText                                   SoloStatFormatString;                              // 0x0048(0x0018)(Edit)
	class FText                                   TeamStatFormatString;                              // 0x0060(0x0018)(Edit)
	int32                                         CallFunc_GetModifiedFortitude_ReturnValue;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetModifiedOffense_ReturnValue;           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x00C0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0120(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x0138(0x0018)()
	int32                                         CallFunc_GetModifiedResistance_ReturnValue;        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetModifiedTech_ReturnValue;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x0158(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData4;             // 0x0198(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array3;                           // 0x01D8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array4;                           // 0x01E8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue3;                      // 0x01F8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue4;                      // 0x0210(0x0018)()
	int32                                         CallFunc_GetTech_ReturnValue;                      // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetResistance_ReturnValue;                // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData5;             // 0x0230(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData6;             // 0x0270(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array5;                           // 0x02B0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array6;                           // 0x02C0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue5;                      // 0x02D0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue6;                      // 0x02E8(0x0018)()
	int32                                         CallFunc_GetOffense_ReturnValue;                   // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFortitude_ReturnValue;                 // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData7;             // 0x0308(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData8;             // 0x0348(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array7;                           // 0x0388(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array8;                           // 0x0398(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue7;                      // 0x03A8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue8;                      // 0x03C0(0x0018)()
	int32                                         CallFunc_GetTech_ReturnValue2;                     // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetResistance_ReturnValue2;               // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData9;             // 0x03E0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData10;            // 0x0420(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array9;                           // 0x0460(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array10;                          // 0x0470(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue9;                      // 0x0480(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue10;                     // 0x0498(0x0018)()
	int32                                         CallFunc_GetOffense_ReturnValue2;                  // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFortitude_ReturnValue2;                // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData11;            // 0x04B8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData12;            // 0x04F8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array11;                          // 0x0538(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array12;                          // 0x0548(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue11;                     // 0x0558(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue12;                     // 0x0570(0x0018)()
	bool                                          CallFunc_HasModifiedStats_ReturnValue;             // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamTech_ReturnValue;                  // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData13;            // 0x0590(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array13;                          // 0x05D0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetTeamResistance_ReturnValue;            // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData14;            // 0x05E8(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamOffense_ReturnValue;               // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array14;                          // 0x0630(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData15;            // 0x0640(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array15;                          // 0x0680(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue13;                     // 0x0690(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue14;                     // 0x06A8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue15;                     // 0x06C0(0x0018)()
	int32                                         CallFunc_GetTeamFortitude_ReturnValue;             // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC[0x4];                                      // 0x06DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData16;            // 0x06E0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array16;                          // 0x0720(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue16;                     // 0x0730(0x0018)()
};
static_assert(alignof(FullPartyMember_C_UpdateStatDisplays) == 0x000008, "Wrong alignment on FullPartyMember_C_UpdateStatDisplays");
static_assert(sizeof(FullPartyMember_C_UpdateStatDisplays) == 0x000748, "Wrong size on FullPartyMember_C_UpdateStatDisplays");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, BaseStatFormatString) == 0x000000, "Member 'FullPartyMember_C_UpdateStatDisplays::BaseStatFormatString' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, ModifiedStatTextStyle) == 0x000018, "Member 'FullPartyMember_C_UpdateStatDisplays::ModifiedStatTextStyle' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, SoloStatTextStyle) == 0x000020, "Member 'FullPartyMember_C_UpdateStatDisplays::SoloStatTextStyle' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, TeamStatTextStyle) == 0x000028, "Member 'FullPartyMember_C_UpdateStatDisplays::TeamStatTextStyle' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, ModifiedStatFormatString) == 0x000030, "Member 'FullPartyMember_C_UpdateStatDisplays::ModifiedStatFormatString' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, SoloStatFormatString) == 0x000048, "Member 'FullPartyMember_C_UpdateStatDisplays::SoloStatFormatString' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, TeamStatFormatString) == 0x000060, "Member 'FullPartyMember_C_UpdateStatDisplays::TeamStatFormatString' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, CallFunc_GetModifiedFortitude_ReturnValue) == 0x000078, "Member 'FullPartyMember_C_UpdateStatDisplays::CallFunc_GetModifiedFortitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, CallFunc_GetModifiedOffense_ReturnValue) == 0x00007C, "Member 'FullPartyMember_C_UpdateStatDisplays::CallFunc_GetModifiedOffense_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'FullPartyMember_C_UpdateStatDisplays::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, K2Node_MakeStruct_FormatArgumentData2) == 0x0000C0, "Member 'FullPartyMember_C_UpdateStatDisplays::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, K2Node_MakeArray_Array) == 0x000100, "Member 'FullPartyMember_C_UpdateStatDisplays::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, K2Node_MakeArray_Array2) == 0x000110, "Member 'FullPartyMember_C_UpdateStatDisplays::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, CallFunc_Format_ReturnValue) == 0x000120, "Member 'FullPartyMember_C_UpdateStatDisplays::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, CallFunc_Format_ReturnValue2) == 0x000138, "Member 'FullPartyMember_C_UpdateStatDisplays::CallFunc_Format_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, CallFunc_GetModifiedResistance_ReturnValue) == 0x000150, "Member 'FullPartyMember_C_UpdateStatDisplays::CallFunc_GetModifiedResistance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, CallFunc_GetModifiedTech_ReturnValue) == 0x000154, "Member 'FullPartyMember_C_UpdateStatDisplays::CallFunc_GetModifiedTech_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, K2Node_MakeStruct_FormatArgumentData3) == 0x000158, "Member 'FullPartyMember_C_UpdateStatDisplays::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, K2Node_MakeStruct_FormatArgumentData4) == 0x000198, "Member 'FullPartyMember_C_UpdateStatDisplays::K2Node_MakeStruct_FormatArgumentData4' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, K2Node_MakeArray_Array3) == 0x0001D8, "Member 'FullPartyMember_C_UpdateStatDisplays::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, K2Node_MakeArray_Array4) == 0x0001E8, "Member 'FullPartyMember_C_UpdateStatDisplays::K2Node_MakeArray_Array4' has a wrong offset!");
static_assert(offsetof(FullPartyMember_C_UpdateStatDisplays, CallFunc_Format_ReturnValue3) == 0x0001F8, "Member 'FullPartyMember_C_UpdateStatDisplays::CallFunc_Format_ReturnValue3' has a wrong offset!");
