#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DefaultPlayer_HarvestBuff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_DefaultPlayer_HarvestBuff.GA_DefaultPlayer_HarvestBuff_C
// 0x00D0 (0x0B10 - 0x0A40)
class UGA_DefaultPlayer_HarvestBuff_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A40(0x0008)(Transient, DuplicateTransient)
	struct FGameplayEventData                     EventData;                                         // 0x0A48(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           EventActivation;                                   // 0x0AF0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         HitThreshold;                                      // 0x0AF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AFC[0x4];                                      // 0x0AFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_HarvestBuffHit;                                 // 0x0B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0B08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_DefaultPlayer_HarvestBuff(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_DefaultPlayer_HarvestBuff_C">();
	}
	static class UGA_DefaultPlayer_HarvestBuff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DefaultPlayer_HarvestBuff_C>();
	}
};
static_assert(alignof(UGA_DefaultPlayer_HarvestBuff_C) == 0x000008, "Wrong alignment on UGA_DefaultPlayer_HarvestBuff_C");
static_assert(sizeof(UGA_DefaultPlayer_HarvestBuff_C) == 0x000B10, "Wrong size on UGA_DefaultPlayer_HarvestBuff_C");
static_assert(offsetof(UGA_DefaultPlayer_HarvestBuff_C, UberGraphFrame) == 0x000A40, "Member 'UGA_DefaultPlayer_HarvestBuff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_HarvestBuff_C, EventData) == 0x000A48, "Member 'UGA_DefaultPlayer_HarvestBuff_C::EventData' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_HarvestBuff_C, EventActivation) == 0x000AF0, "Member 'UGA_DefaultPlayer_HarvestBuff_C::EventActivation' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_HarvestBuff_C, HitThreshold) == 0x000AF8, "Member 'UGA_DefaultPlayer_HarvestBuff_C::HitThreshold' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_HarvestBuff_C, GE_HarvestBuffHit) == 0x000B00, "Member 'UGA_DefaultPlayer_HarvestBuff_C::GE_HarvestBuffHit' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_HarvestBuff_C, PlayerPawn) == 0x000B08, "Member 'UGA_DefaultPlayer_HarvestBuff_C::PlayerPawn' has a wrong offset!");

}

