#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Generic_AdrenalineRush

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Generic_AdrenalineRush.GA_Generic_AdrenalineRush_C.ExecuteUbergraph_GA_Generic_AdrenalineRush
// 0x00C0 (0x00C0 - 0x0000)
struct GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0028(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x0058(0x0020)()
	bool                                          CallFunc_TargetDataHasActor_ReturnValue;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0098(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush) == 0x000008, "Wrong alignment on GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush");
static_assert(sizeof(GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush) == 0x0000C0, "Wrong size on GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush, EntryPoint) == 0x000000, "Member 'GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush, K2Node_CustomEvent_TargetData) == 0x000028, "Member 'GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush, K2Node_CustomEvent_ApplicationTag) == 0x000048, "Member 'GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush, Temp_struct_Variable) == 0x000050, "Member 'GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush, Temp_struct_Variable2) == 0x000058, "Member 'GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush, CallFunc_TargetDataHasActor_ReturnValue) == 0x000078, "Member 'GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush::CallFunc_TargetDataHasActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush, CallFunc_WaitTargetSelection_ReturnValue) == 0x000080, "Member 'GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000090, "Member 'GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush, K2Node_CustomEvent_TargetData2) == 0x000098, "Member 'GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush, K2Node_CustomEvent_ApplicationTag2) == 0x0000B8, "Member 'GA_Generic_AdrenalineRush_C_ExecuteUbergraph_GA_Generic_AdrenalineRush::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");

// Function GA_Generic_AdrenalineRush.GA_Generic_AdrenalineRush_C.Targeted_96CD2D2546A5DCD7B7C14BBA26232864
// 0x0028 (0x0028 - 0x0000)
struct GA_Generic_AdrenalineRush_C_Targeted_96CD2D2546A5DCD7B7C14BBA26232864 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Generic_AdrenalineRush_C_Targeted_96CD2D2546A5DCD7B7C14BBA26232864) == 0x000008, "Wrong alignment on GA_Generic_AdrenalineRush_C_Targeted_96CD2D2546A5DCD7B7C14BBA26232864");
static_assert(sizeof(GA_Generic_AdrenalineRush_C_Targeted_96CD2D2546A5DCD7B7C14BBA26232864) == 0x000028, "Wrong size on GA_Generic_AdrenalineRush_C_Targeted_96CD2D2546A5DCD7B7C14BBA26232864");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_Targeted_96CD2D2546A5DCD7B7C14BBA26232864, TargetData) == 0x000000, "Member 'GA_Generic_AdrenalineRush_C_Targeted_96CD2D2546A5DCD7B7C14BBA26232864::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_Targeted_96CD2D2546A5DCD7B7C14BBA26232864, ApplicationTag) == 0x000020, "Member 'GA_Generic_AdrenalineRush_C_Targeted_96CD2D2546A5DCD7B7C14BBA26232864::ApplicationTag' has a wrong offset!");

// Function GA_Generic_AdrenalineRush.GA_Generic_AdrenalineRush_C.Cancelled_96CD2D2546A5DCD7B7C14BBA26232864
// 0x0028 (0x0028 - 0x0000)
struct GA_Generic_AdrenalineRush_C_Cancelled_96CD2D2546A5DCD7B7C14BBA26232864 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Generic_AdrenalineRush_C_Cancelled_96CD2D2546A5DCD7B7C14BBA26232864) == 0x000008, "Wrong alignment on GA_Generic_AdrenalineRush_C_Cancelled_96CD2D2546A5DCD7B7C14BBA26232864");
static_assert(sizeof(GA_Generic_AdrenalineRush_C_Cancelled_96CD2D2546A5DCD7B7C14BBA26232864) == 0x000028, "Wrong size on GA_Generic_AdrenalineRush_C_Cancelled_96CD2D2546A5DCD7B7C14BBA26232864");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_Cancelled_96CD2D2546A5DCD7B7C14BBA26232864, TargetData) == 0x000000, "Member 'GA_Generic_AdrenalineRush_C_Cancelled_96CD2D2546A5DCD7B7C14BBA26232864::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_Cancelled_96CD2D2546A5DCD7B7C14BBA26232864, ApplicationTag) == 0x000020, "Member 'GA_Generic_AdrenalineRush_C_Cancelled_96CD2D2546A5DCD7B7C14BBA26232864::ApplicationTag' has a wrong offset!");

// Function GA_Generic_AdrenalineRush.GA_Generic_AdrenalineRush_C.ApplyGadgetEffects
// 0x0180 (0x0180 - 0x0000)
struct GA_Generic_AdrenalineRush_C_ApplyGadgetEffects final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(Parm)
	class AFortPawn*                              CurrentLoopFortPawn;                               // 0x0020(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDataCountFromTargetData_ReturnValue;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDBNO_ReturnValue;                       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDBNO_ReturnValue2;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0070(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue;   // 0x0088(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue2;  // 0x00A0(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x00C8(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00F0(0x0020)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item2;                          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2; // 0x0140(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue3;  // 0x0158(0x0018)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2; // 0x0170(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects) == 0x000008, "Wrong alignment on GA_Generic_AdrenalineRush_C_ApplyGadgetEffects");
static_assert(sizeof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects) == 0x000180, "Wrong size on GA_Generic_AdrenalineRush_C_ApplyGadgetEffects");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, TargetData) == 0x000000, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CurrentLoopFortPawn) == 0x000020, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CurrentLoopFortPawn' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_GetDataCountFromTargetData_ReturnValue) == 0x00002C, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_GetDataCountFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, Temp_int_Array_Index_Variable) == 0x000038, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, K2Node_DynamicCast_AsFort_AIPawn) == 0x000040, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_IsDBNO_ReturnValue) == 0x000049, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_IsDBNO_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000050, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, K2Node_DynamicCast_bSuccess2) == 0x000058, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_IsDBNO_ReturnValue2) == 0x000059, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_IsDBNO_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_GetController_ReturnValue) == 0x000060, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000068, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x00006C, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000070, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_AssignSetByCallerMagnitude_ReturnValue) == 0x000088, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_AssignSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_AssignSetByCallerMagnitude_ReturnValue2) == 0x0000A0, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_AssignSetByCallerMagnitude_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, Temp_int_Variable) == 0x0000B8, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x0000C8, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, K2Node_DynamicCast_AsFort_Pawn) == 0x0000D8, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, K2Node_DynamicCast_bSuccess3) == 0x0000E0, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_Array_Length_ReturnValue) == 0x0000E4, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E8, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000F0, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000110, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_Array_Get_Item2) == 0x000120, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_IsValid_ReturnValue) == 0x000128, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_Array_Add_ReturnValue) == 0x00012C, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000130, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_Add_IntInt_ReturnValue2) == 0x000134, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_Array_Length_ReturnValue2) == 0x000138, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_Less_IntInt_ReturnValue) == 0x00013C, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2) == 0x000140, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_AssignSetByCallerMagnitude_ReturnValue3) == 0x000158, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_AssignSetByCallerMagnitude_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_ApplyGadgetEffects, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2) == 0x000170, "Member 'GA_Generic_AdrenalineRush_C_ApplyGadgetEffects::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2' has a wrong offset!");

// Function GA_Generic_AdrenalineRush.GA_Generic_AdrenalineRush_C.SpawnVisuals
// 0x0110 (0x0110 - 0x0000)
struct GA_Generic_AdrenalineRush_C_SpawnVisuals final
{
public:
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x0000(0x0080)()
	struct FFortAbilityTargetSelection            CallFunc_Array_Get_Item;                           // 0x0080(0x0060)()
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00E0(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    CallFunc_SpawnProjectile_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Prj_AdrenalineRush_C*                K2Node_DynamicCast_AsB_Prj_Adrenaline_Rush;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Generic_AdrenalineRush_C_SpawnVisuals) == 0x000008, "Wrong alignment on GA_Generic_AdrenalineRush_C_SpawnVisuals");
static_assert(sizeof(GA_Generic_AdrenalineRush_C_SpawnVisuals) == 0x000110, "Wrong size on GA_Generic_AdrenalineRush_C_SpawnVisuals");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_SpawnVisuals, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x000000, "Member 'GA_Generic_AdrenalineRush_C_SpawnVisuals::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_SpawnVisuals, CallFunc_Array_Get_Item) == 0x000080, "Member 'GA_Generic_AdrenalineRush_C_SpawnVisuals::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_SpawnVisuals, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000E0, "Member 'GA_Generic_AdrenalineRush_C_SpawnVisuals::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_SpawnVisuals, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000EC, "Member 'GA_Generic_AdrenalineRush_C_SpawnVisuals::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_SpawnVisuals, CallFunc_SpawnProjectile_ReturnValue) == 0x0000F8, "Member 'GA_Generic_AdrenalineRush_C_SpawnVisuals::CallFunc_SpawnProjectile_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_SpawnVisuals, K2Node_DynamicCast_AsB_Prj_Adrenaline_Rush) == 0x000100, "Member 'GA_Generic_AdrenalineRush_C_SpawnVisuals::K2Node_DynamicCast_AsB_Prj_Adrenaline_Rush' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_SpawnVisuals, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GA_Generic_AdrenalineRush_C_SpawnVisuals::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Generic_AdrenalineRush.GA_Generic_AdrenalineRush_C.Setup_Ability
// 0x01E0 (0x01E0 - 0x0000)
struct GA_Generic_AdrenalineRush_C_Setup_Ability final
{
public:
	class UAbilitySystemComponent*                AbilitySystemComponent_Ref;                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0010(0x0020)()
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EvaluateAttributeValueWithTagsAndBase_bSuccess; // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateAttributeValueWithTagsAndBase_ReturnValue; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortBaseWeaponStats                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0120)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput; // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue2;  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select2_Default;                            // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface3_CastInput; // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue3;  // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface4_CastInput; // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue4;  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select3_Default;                            // 0x01D8(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Generic_AdrenalineRush_C_Setup_Ability) == 0x000008, "Wrong alignment on GA_Generic_AdrenalineRush_C_Setup_Ability");
static_assert(sizeof(GA_Generic_AdrenalineRush_C_Setup_Ability) == 0x0001E0, "Wrong size on GA_Generic_AdrenalineRush_C_Setup_Ability");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_Setup_Ability, AbilitySystemComponent_Ref) == 0x000000, "Member 'GA_Generic_AdrenalineRush_C_Setup_Ability::AbilitySystemComponent_Ref' has a wrong offset!");
static_assert(offsetof(GA_Generic_AdrenalineRush_C_Setup_Ability, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000008, "Member 'GA_Generic_AdrenalineRush_C_Setup_Ability::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
