#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_GenericApplyKnockback

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.ExecuteUbergraph_GAB_GenericApplyKnockback
// 0x05D8 (0x05D8 - 0x0000)
struct GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate11;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAbilitySystemComponent*            CallFunc_GetActivatingAbilityComponent_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate13;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0104(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue2;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue3;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate14;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue4;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue5;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue6;           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0158(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0164(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue2; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue3; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x2];                                      // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate15;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit2;                           // 0x01C0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x0248(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SelfActor;                      // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NormalImpulse;                  // 0x0268(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0278(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromHitResult_ReturnValue; // 0x0300(0x0020)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0328(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x033C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue7;           // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue8;           // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue9;           // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetActivatingAbilityComponent_ReturnValue2; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue2;  // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate16;            // 0x0390(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate17;            // 0x03A0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate18;            // 0x03B0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate19;            // 0x03C0(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue10;          // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x03DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DB[0x1];                                      // 0x03DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2; // 0x03DC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E5[0x3];                                      // 0x03E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue11;          // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate20;            // 0x03F0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate21;            // 0x0400(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue4; // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41A[0x6];                                      // 0x041A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue5; // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetActivatingAbilityComponent_ReturnValue3; // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue3; // 0x0434(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue12;          // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x044B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue4; // 0x044C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue13;          // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate22;            // 0x0460(0x0010)(ZeroConstructor, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0470(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x047C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue2;                 // 0x0488(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X2;                           // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y2;                           // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z2;                           // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x04A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue14;          // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue2;                      // 0x04B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x04C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue2;                       // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x04D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D5[0x3];                                      // 0x04D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x04D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x04E8(0x0008)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate23;            // 0x04F0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0500(0x00A8)(ConstParm)
	struct FVector                                CallFunc_GetImpulseData_ImpulseDirection;          // 0x05A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetImpulseData_KnockbackMagnitude;        // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetImpulseData_KnockbackZAngle;           // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue3;                       // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue2;       // 0x05C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C5[0x3];                                      // 0x05C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue2;                 // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue2;                // 0x05CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback) == 0x000008, "Wrong alignment on GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback");
static_assert(sizeof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback) == 0x0005D8, "Wrong size on GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, EntryPoint) == 0x000000, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate3) == 0x000028, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate4) == 0x000038, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate5) == 0x000048, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate6) == 0x000058, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate7) == 0x000068, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate8) == 0x000078, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate9) == 0x000088, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate10) == 0x000098, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate11) == 0x0000A8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate12) == 0x0000B8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingAbilityComponent_ReturnValue) == 0x0000C8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000D0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsValid_ReturnValue2) == 0x0000D9, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate13) == 0x0000E0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsValid_ReturnValue3) == 0x0000F0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue) == 0x0000F8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000100, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000104, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue2) == 0x000110, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue3) == 0x000118, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsFalling_ReturnValue) == 0x000120, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate14) == 0x000128, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue4) == 0x000138, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue5) == 0x000140, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue6) == 0x000148, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000150, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000158, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_Add_VectorVector_ReturnValue) == 0x000164, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsValid_ReturnValue4) == 0x000170, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue2) == 0x000178, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue3) == 0x000180, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsValid_ReturnValue5) == 0x000188, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsValid_ReturnValue6) == 0x000189, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_BreakVector_X) == 0x00018C, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_BreakVector_Y) == 0x000190, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_BreakVector_Z) == 0x000194, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate15) == 0x000198, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate15' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_MakeVector_ReturnValue) == 0x0001A8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_Normal_ReturnValue) == 0x0001B4, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CustomEvent_Hit2) == 0x0001C0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CustomEvent_Hit2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x000248, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CustomEvent_SelfActor) == 0x000258, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CustomEvent_SelfActor' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CustomEvent_OtherActor) == 0x000260, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CustomEvent_NormalImpulse) == 0x000268, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CustomEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CustomEvent_Hit) == 0x000278, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_AbilityTargetDataFromHitResult_ReturnValue) == 0x000300, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_AbilityTargetDataFromHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000320, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000328, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsValid_ReturnValue7) == 0x000338, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetVelocity_ReturnValue) == 0x00033C, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_VSize_ReturnValue) == 0x000348, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00034C, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue7) == 0x000350, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue7' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue8) == 0x000358, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue8' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000360, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000370, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue9) == 0x000378, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue9' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingAbilityComponent_ReturnValue2) == 0x000380, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingAbilityComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_RemoveActiveGameplayEffect_ReturnValue2) == 0x000388, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_RemoveActiveGameplayEffect_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate16) == 0x000390, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate16' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate17) == 0x0003A0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate17' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate18) == 0x0003B0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate18' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate19) == 0x0003C0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate19' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue10) == 0x0003D0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue10' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_SwitchEnum_CmpSuccess) == 0x0003D8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_Not_PreBool_ReturnValue) == 0x0003D9, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_Not_PreBool_ReturnValue2) == 0x0003DA, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2) == 0x0003DC, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_BooleanAND_ReturnValue) == 0x0003E4, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue11) == 0x0003E8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue11' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate20) == 0x0003F0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate20' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate21) == 0x000400, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate21' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue4) == 0x000410, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsValid_ReturnValue8) == 0x000418, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsValid_ReturnValue9) == 0x000419, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue5) == 0x000420, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingAbilityComponent_ReturnValue3) == 0x000428, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingAbilityComponent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsValid_ReturnValue10) == 0x000430, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsValid_ReturnValue10' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue3) == 0x000434, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue12) == 0x000440, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue12' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_SwitchEnum2_CmpSuccess) == 0x000448, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_Not_PreBool_ReturnValue3) == 0x000449, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsServer_ReturnValue) == 0x00044A, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsServer_ReturnValue2) == 0x00044B, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue4) == 0x00044C, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue13) == 0x000458, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue13' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate22) == 0x000460, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate22' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000470, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x00047C, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetVelocity_ReturnValue2) == 0x000488, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetVelocity_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_BreakVector_X2) == 0x000494, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_BreakVector_Y2) == 0x000498, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_BreakVector_Z2) == 0x00049C, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_MakeVector_ReturnValue2) == 0x0004A0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue14) == 0x0004B0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue14' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_Normal_ReturnValue2) == 0x0004B8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_Normal_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0004C4, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_VSize_ReturnValue2) == 0x0004D0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_VSize_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0004D4, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_SelectVector_ReturnValue) == 0x0004D8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_K2_SetTimer_ReturnValue) == 0x0004E8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate23) == 0x0004F0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate23' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_Event_EventData) == 0x000500, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetImpulseData_ImpulseDirection) == 0x0005A8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetImpulseData_ImpulseDirection' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetImpulseData_KnockbackMagnitude) == 0x0005B4, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetImpulseData_KnockbackMagnitude' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetImpulseData_KnockbackZAngle) == 0x0005B8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetImpulseData_KnockbackZAngle' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_VSize_ReturnValue3) == 0x0005BC, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_VSize_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_SelectFloat_ReturnValue) == 0x0005C0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_EqualEqual_FloatFloat_ReturnValue2) == 0x0005C4, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_EqualEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_SelectFloat_ReturnValue2) == 0x0005C8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_SelectFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_SelectVector_ReturnValue2) == 0x0005CC, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_SelectVector_ReturnValue2' has a wrong offset!");

// Function GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.K2_ActivateAbilityFromEvent
// 0x00A8 (0x00A8 - 0x0000)
struct GAB_GenericApplyKnockback_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00A8)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GAB_GenericApplyKnockback_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GAB_GenericApplyKnockback_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GAB_GenericApplyKnockback_C_K2_ActivateAbilityFromEvent) == 0x0000A8, "Wrong size on GAB_GenericApplyKnockback_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GAB_GenericApplyKnockback_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GAB_GenericApplyKnockback_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnHitPawn
// 0x00A8 (0x00A8 - 0x0000)
struct GAB_GenericApplyKnockback_C_OnHitPawn final
{
public:
	class AActor*                                 SelfActor;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0010(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Hit;                                               // 0x0020(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GAB_GenericApplyKnockback_C_OnHitPawn) == 0x000008, "Wrong alignment on GAB_GenericApplyKnockback_C_OnHitPawn");
static_assert(sizeof(GAB_GenericApplyKnockback_C_OnHitPawn) == 0x0000A8, "Wrong size on GAB_GenericApplyKnockback_C_OnHitPawn");
static_assert(offsetof(GAB_GenericApplyKnockback_C_OnHitPawn, SelfActor) == 0x000000, "Member 'GAB_GenericApplyKnockback_C_OnHitPawn::SelfActor' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_OnHitPawn, OtherActor) == 0x000008, "Member 'GAB_GenericApplyKnockback_C_OnHitPawn::OtherActor' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_OnHitPawn, NormalImpulse) == 0x000010, "Member 'GAB_GenericApplyKnockback_C_OnHitPawn::NormalImpulse' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_OnHitPawn, Hit) == 0x000020, "Member 'GAB_GenericApplyKnockback_C_OnHitPawn::Hit' has a wrong offset!");

