#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameLiveStreaming

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct GameLiveStreaming.BlueprintLiveStreamInfo
// 0x0030 (0x0030 - 0x0000)
struct FBlueprintLiveStreamInfo final
{
public:
	class FString                                 GameName;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StreamName;                                        // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 URL;                                               // 0x0020(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBlueprintLiveStreamInfo) == 0x000008, "Wrong alignment on FBlueprintLiveStreamInfo");
static_assert(sizeof(FBlueprintLiveStreamInfo) == 0x000030, "Wrong size on FBlueprintLiveStreamInfo");
static_assert(offsetof(FBlueprintLiveStreamInfo, GameName) == 0x000000, "Member 'FBlueprintLiveStreamInfo::GameName' has a wrong offset!");
static_assert(offsetof(FBlueprintLiveStreamInfo, StreamName) == 0x000010, "Member 'FBlueprintLiveStreamInfo::StreamName' has a wrong offset!");
static_assert(offsetof(FBlueprintLiveStreamInfo, URL) == 0x000020, "Member 'FBlueprintLiveStreamInfo::URL' has a wrong offset!");

}

