#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hero_Management_HUDWrapper

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Hero_Management_HUDWrapper.Hero_Management_HUDWrapper_C
// 0x0018 (0x0258 - 0x0240)
class UHero_Management_HUDWrapper_C final : public UFortUserWidget
{
public:
	class UImage*                                 Fill;                                              // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Pattern;                                           // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Hero_Management_HUDWrapper_C">();
	}
	static class UHero_Management_HUDWrapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHero_Management_HUDWrapper_C>();
	}
};
static_assert(alignof(UHero_Management_HUDWrapper_C) == 0x000008, "Wrong alignment on UHero_Management_HUDWrapper_C");
static_assert(sizeof(UHero_Management_HUDWrapper_C) == 0x000258, "Wrong size on UHero_Management_HUDWrapper_C");
static_assert(offsetof(UHero_Management_HUDWrapper_C, Fill) == 0x000240, "Member 'UHero_Management_HUDWrapper_C::Fill' has a wrong offset!");
static_assert(offsetof(UHero_Management_HUDWrapper_C, Frame) == 0x000248, "Member 'UHero_Management_HUDWrapper_C::Frame' has a wrong offset!");
static_assert(offsetof(UHero_Management_HUDWrapper_C, Pattern) == 0x000250, "Member 'UHero_Management_HUDWrapper_C::Pattern' has a wrong offset!");

}

