#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HomeScreenQuestRewardItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HomeScreenQuestRewardItem.HomeScreenQuestRewardItem_C
// 0x0020 (0x0250 - 0x0230)
class UHomeScreenQuestRewardItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(Transient, DuplicateTransient)
	class UFortMultiSizeItemCard*                 FortItemCard_XS;                                   // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItem*                              Item;                                              // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Quantity;                                          // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HomeScreenQuestRewardItem(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HomeScreenQuestRewardItem_C">();
	}
	static class UHomeScreenQuestRewardItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHomeScreenQuestRewardItem_C>();
	}
};
static_assert(alignof(UHomeScreenQuestRewardItem_C) == 0x000008, "Wrong alignment on UHomeScreenQuestRewardItem_C");
static_assert(sizeof(UHomeScreenQuestRewardItem_C) == 0x000250, "Wrong size on UHomeScreenQuestRewardItem_C");
static_assert(offsetof(UHomeScreenQuestRewardItem_C, UberGraphFrame) == 0x000230, "Member 'UHomeScreenQuestRewardItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHomeScreenQuestRewardItem_C, FortItemCard_XS) == 0x000238, "Member 'UHomeScreenQuestRewardItem_C::FortItemCard_XS' has a wrong offset!");
static_assert(offsetof(UHomeScreenQuestRewardItem_C, Item) == 0x000240, "Member 'UHomeScreenQuestRewardItem_C::Item' has a wrong offset!");
static_assert(offsetof(UHomeScreenQuestRewardItem_C, Quantity) == 0x000248, "Member 'UHomeScreenQuestRewardItem_C::Quantity' has a wrong offset!");

}

