#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_TeamMemberInfo

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function HUD-TeamMemberInfo.HUD-TeamMemberInfo_C.ExecuteUbergraph_HUD-TeamMemberInfo
// 0x0004 (0x0004 - 0x0000)
struct HUD_TeamMemberInfo_C_ExecuteUbergraph_HUD_TeamMemberInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_TeamMemberInfo_C_ExecuteUbergraph_HUD_TeamMemberInfo) == 0x000004, "Wrong alignment on HUD_TeamMemberInfo_C_ExecuteUbergraph_HUD_TeamMemberInfo");
static_assert(sizeof(HUD_TeamMemberInfo_C_ExecuteUbergraph_HUD_TeamMemberInfo) == 0x000004, "Wrong size on HUD_TeamMemberInfo_C_ExecuteUbergraph_HUD_TeamMemberInfo");
static_assert(offsetof(HUD_TeamMemberInfo_C_ExecuteUbergraph_HUD_TeamMemberInfo, EntryPoint) == 0x000000, "Member 'HUD_TeamMemberInfo_C_ExecuteUbergraph_HUD_TeamMemberInfo::EntryPoint' has a wrong offset!");

// Function HUD-TeamMemberInfo.HUD-TeamMemberInfo_C.Update
// 0x0228 (0x0228 - 0x0000)
struct HUD_TeamMemberInfo_C_Update final
{
public:
	struct FFortTeamMemberInfo                    UpdatedMemberInfo;                                 // 0x0000(0x0190)(Parm)
	struct FUniqueNetIdRepl                       PlayerPlatformNetId;                               // 0x0190(0x0018)(Edit, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       PlayerNetId;                                       // 0x01A8(0x0018)(Edit, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_UniqueNetIdRepl_ReturnValue;      // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x01D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable2;                              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalPlayersParty_ReturnValue;        // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_Select_Default;                             // 0x01F8(0x0018)(ConstParm, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select2_Default;                            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x021D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x021E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21F[0x1];                                      // 0x021F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select4_Default;                            // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0226(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select5_Default;                            // 0x0227(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUD_TeamMemberInfo_C_Update) == 0x000008, "Wrong alignment on HUD_TeamMemberInfo_C_Update");
static_assert(sizeof(HUD_TeamMemberInfo_C_Update) == 0x000228, "Wrong size on HUD_TeamMemberInfo_C_Update");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, UpdatedMemberInfo) == 0x000000, "Member 'HUD_TeamMemberInfo_C_Update::UpdatedMemberInfo' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, PlayerPlatformNetId) == 0x000190, "Member 'HUD_TeamMemberInfo_C_Update::PlayerPlatformNetId' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, PlayerNetId) == 0x0001A8, "Member 'HUD_TeamMemberInfo_C_Update::PlayerNetId' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, Temp_byte_Variable) == 0x0001C0, "Member 'HUD_TeamMemberInfo_C_Update::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, Temp_bool_Variable) == 0x0001C1, "Member 'HUD_TeamMemberInfo_C_Update::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, Temp_byte_Variable2) == 0x0001C2, "Member 'HUD_TeamMemberInfo_C_Update::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, Temp_byte_Variable3) == 0x0001C3, "Member 'HUD_TeamMemberInfo_C_Update::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, Temp_bool_Variable2) == 0x0001C4, "Member 'HUD_TeamMemberInfo_C_Update::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, Temp_int_Variable) == 0x0001C8, "Member 'HUD_TeamMemberInfo_C_Update::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, Temp_int_Variable2) == 0x0001CC, "Member 'HUD_TeamMemberInfo_C_Update::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, Temp_byte_Variable4) == 0x0001D0, "Member 'HUD_TeamMemberInfo_C_Update::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, CallFunc_IsValid_UniqueNetIdRepl_ReturnValue) == 0x0001D1, "Member 'HUD_TeamMemberInfo_C_Update::CallFunc_IsValid_UniqueNetIdRepl_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, Temp_bool_Variable3) == 0x0001D2, "Member 'HUD_TeamMemberInfo_C_Update::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, Temp_bool_Variable4) == 0x0001D3, "Member 'HUD_TeamMemberInfo_C_Update::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, CallFunc_GetContext_ReturnValue) == 0x0001D8, "Member 'HUD_TeamMemberInfo_C_Update::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, Temp_class_Variable) == 0x0001E0, "Member 'HUD_TeamMemberInfo_C_Update::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, Temp_class_Variable2) == 0x0001E8, "Member 'HUD_TeamMemberInfo_C_Update::Temp_class_Variable2' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, CallFunc_IsInLocalPlayersParty_ReturnValue) == 0x0001F0, "Member 'HUD_TeamMemberInfo_C_Update::CallFunc_IsInLocalPlayersParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, Temp_bool_Variable5) == 0x0001F1, "Member 'HUD_TeamMemberInfo_C_Update::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, K2Node_Select_Default) == 0x0001F8, "Member 'HUD_TeamMemberInfo_C_Update::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, K2Node_Select2_Default) == 0x000210, "Member 'HUD_TeamMemberInfo_C_Update::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000218, "Member 'HUD_TeamMemberInfo_C_Update::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00021C, "Member 'HUD_TeamMemberInfo_C_Update::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, CallFunc_IsValid_ReturnValue) == 0x00021D, "Member 'HUD_TeamMemberInfo_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, K2Node_Select3_Default) == 0x00021E, "Member 'HUD_TeamMemberInfo_C_Update::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, K2Node_Select4_Default) == 0x000220, "Member 'HUD_TeamMemberInfo_C_Update::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, CallFunc_Greater_IntInt_ReturnValue) == 0x000224, "Member 'HUD_TeamMemberInfo_C_Update::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, CallFunc_BooleanAND_ReturnValue) == 0x000225, "Member 'HUD_TeamMemberInfo_C_Update::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, CallFunc_BooleanAND_ReturnValue2) == 0x000226, "Member 'HUD_TeamMemberInfo_C_Update::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_Update, K2Node_Select5_Default) == 0x000227, "Member 'HUD_TeamMemberInfo_C_Update::K2Node_Select5_Default' has a wrong offset!");

// Function HUD-TeamMemberInfo.HUD-TeamMemberInfo_C.SetHealth
// 0x0010 (0x0010 - 0x0000)
struct HUD_TeamMemberInfo_C_SetHealth final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_TeamMemberInfo_C_SetHealth) == 0x000008, "Wrong alignment on HUD_TeamMemberInfo_C_SetHealth");
static_assert(sizeof(HUD_TeamMemberInfo_C_SetHealth) == 0x000010, "Wrong size on HUD_TeamMemberInfo_C_SetHealth");
static_assert(offsetof(HUD_TeamMemberInfo_C_SetHealth, Value) == 0x000000, "Member 'HUD_TeamMemberInfo_C_SetHealth::Value' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_SetHealth, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'HUD_TeamMemberInfo_C_SetHealth::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_TeamMemberInfo_C_SetHealth, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'HUD_TeamMemberInfo_C_SetHealth::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

