#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IconTextButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IconTextButton.IconTextButton_C
// 0x0100 (0x09A0 - 0x08A0)
class UIconTextButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08A0(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x08A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x08B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftSideImage;                                     // 0x08B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             RightExtraContentSlot;                             // 0x08C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x08C8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateBrush                            IconBrush;                                         // 0x08E0(0x0090)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UClass*                                 ControllerInputStyle;                              // 0x0970(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 MouseKeyboardStyle;                                // 0x0978(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          ContentAlignment;                                  // 0x0980(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMouseKeyboardStyleSet;                            // 0x0981(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_982[0x6];                                      // 0x0982(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OverrideButtonText;                                // 0x0988(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_IconTextButton(int32 EntryPoint);
	void Destruct();
	void Construct();
	void OnActionComplete();
	void OnActionProgress(float HeldPercent);
	void OnTriggeredInputActionChanged(const struct FDataTableRowHandle& NewTriggeredAction);
	void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);
	void PreConstruct(bool IsDesignTime);
	void OnCurrentTextStyleChanged();
	void Set_Text(const class FText& ButtonText_0);
	void Set_Icon(const struct FSlateBrush& IconBrush_0);
	void InitializeButton();
	void UpdateTextAndStyle(bool bUsingGamepad);
	void SetControllerStyle(class UClass* ControllerInputStyle_0);
	void UpdateText();
	void UpdateStyle(bool UsingGamepad);
	void SetMouseKeyboardStyle(class UClass* ControllerInputStyle_0);
	void UpdateContentAlignment();
	void SetContentAlignment(EHorizontalAlignment ContentAlignment_0);
	void UpdateTextStyle();
	void SetInitialMouseKeyboardStyle();
	void SetTextInternal(const class FText& InButtonText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IconTextButton_C">();
	}
	static class UIconTextButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIconTextButton_C>();
	}
};
static_assert(alignof(UIconTextButton_C) == 0x000008, "Wrong alignment on UIconTextButton_C");
static_assert(sizeof(UIconTextButton_C) == 0x0009A0, "Wrong size on UIconTextButton_C");
static_assert(offsetof(UIconTextButton_C, UberGraphFrame) == 0x0008A0, "Member 'UIconTextButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, CenterButtonTextWidget) == 0x0008A8, "Member 'UIconTextButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, ContentBorder) == 0x0008B0, "Member 'UIconTextButton_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, LeftSideImage) == 0x0008B8, "Member 'UIconTextButton_C::LeftSideImage' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, RightExtraContentSlot) == 0x0008C0, "Member 'UIconTextButton_C::RightExtraContentSlot' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, ButtonText) == 0x0008C8, "Member 'UIconTextButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, IconBrush) == 0x0008E0, "Member 'UIconTextButton_C::IconBrush' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, ControllerInputStyle) == 0x000970, "Member 'UIconTextButton_C::ControllerInputStyle' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, MouseKeyboardStyle) == 0x000978, "Member 'UIconTextButton_C::MouseKeyboardStyle' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, ContentAlignment) == 0x000980, "Member 'UIconTextButton_C::ContentAlignment' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, bMouseKeyboardStyleSet) == 0x000981, "Member 'UIconTextButton_C::bMouseKeyboardStyleSet' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, OverrideButtonText) == 0x000988, "Member 'UIconTextButton_C::OverrideButtonText' has a wrong offset!");

}

