#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Item_TierBadge

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "ItemDisplayStyle_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "ItemDisplayMode_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Item_TierBadge.Item_TierBadge_C
// 0x0020 (0x0250 - 0x0230)
class UItem_TierBadge_C final : public UUserWidget
{
public:
	class UBorder*                                Border_Baseplate;                                  // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_StarGroup;                           // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Container;                                 // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Level;                                        // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Update(EFortItemTier Current_Tier, EFortItemTier Max_Tier, EFortBrushSize Brush_Size, EItemDisplayStyle Item_Display_Style, EItemDisplayMode Item_Display_Mode, const struct FFortRarityItemData& Rarity_Colors, int32 Current_Level, int32 Max_Level);
	void Refresh_Visibility(EFortBrushSize Brush_Size, EItemDisplayMode Display_Mode, EFortItemTier Current_Tier, bool* Visible);
	void Set_Level(int32 Current_Level, int32 Max_Level);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Item_TierBadge_C">();
	}
	static class UItem_TierBadge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItem_TierBadge_C>();
	}
};
static_assert(alignof(UItem_TierBadge_C) == 0x000008, "Wrong alignment on UItem_TierBadge_C");
static_assert(sizeof(UItem_TierBadge_C) == 0x000250, "Wrong size on UItem_TierBadge_C");
static_assert(offsetof(UItem_TierBadge_C, Border_Baseplate) == 0x000230, "Member 'UItem_TierBadge_C::Border_Baseplate' has a wrong offset!");
static_assert(offsetof(UItem_TierBadge_C, HorizontalBox_StarGroup) == 0x000238, "Member 'UItem_TierBadge_C::HorizontalBox_StarGroup' has a wrong offset!");
static_assert(offsetof(UItem_TierBadge_C, SizeBox_Container) == 0x000240, "Member 'UItem_TierBadge_C::SizeBox_Container' has a wrong offset!");
static_assert(offsetof(UItem_TierBadge_C, Text_Level) == 0x000248, "Member 'UItem_TierBadge_C::Text_Level' has a wrong offset!");

}

