#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemUIFunctionLibrary

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "TooltipStat_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ItemUIFunctionLibrary.ItemUIFunctionLibrary_C.Add Alteration Widgets
// 0x0270 (0x0270 - 0x0000)
struct ItemUIFunctionLibrary_C_Add_Alteration_Widgets final
{
public:
	class UVerticalBox*                           Host_Widget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              Item;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviewLevel;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowInVaultDetails;                                // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FormatForVaultDetails;                             // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowPreview;                                       // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0024(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlterationsArrayIndex;                             // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LevelToPreview;                                    // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAlterationSlotActive;                           // 0x003C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              ItemRef;                                           // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxRef;                                    // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemLevel;                                         // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LevelString;                                       // 0x0058(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash)
	class UTooltipStatWidget_C*                   CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTooltipStatWrapper_C*                  CallFunc_Create_ReturnValue2;                      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTooltipStatWidget_C*                   CallFunc_Create_ReturnValue3;                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTooltipStatWrapper_C*                  CallFunc_Create_ReturnValue4;                      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue2;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0098(0x0010)(NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue3;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x00B0(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor2;                    // 0x00C0(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin2;                         // 0x00D8(0x0010)(NoDestructor)
	class FText                                   CallFunc_GetAlterationSlotActivationRequirement_ReturnValue; // 0x00E8(0x0018)()
	struct FLinearColor                           K2Node_MakeStruct_LinearColor3;                    // 0x0100(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_ParseLevelRequiredFromString_outInt;      // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAlterationSlotActivationRequirement_ReturnValue2; // 0x0138(0x0018)()
	TArray<class UFortAlterationItemDefinition*>  CallFunc_GetAlterations_ReturnValue;               // 0x0150(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue2;           // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortAlterationItemDefinition*          CallFunc_Array_Get_Item;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0180(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue3;           // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetSingleLineDescription_ReturnValue;     // 0x01C0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01D8(0x0018)()
	struct FTooltipStat                           K2Node_MakeStruct_TooltipStat;                     // 0x01F0(0x0038)(HasGetValueTypeHash)
	struct FTooltipStat                           K2Node_MakeStruct_TooltipStat2;                    // 0x0228(0x0038)(HasGetValueTypeHash)
	bool                                          CallFunc_IsAlterationSlotActive_ReturnValue;       // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue4;       // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets) == 0x000008, "Wrong alignment on ItemUIFunctionLibrary_C_Add_Alteration_Widgets");
static_assert(sizeof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets) == 0x000270, "Wrong size on ItemUIFunctionLibrary_C_Add_Alteration_Widgets");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, Host_Widget) == 0x000000, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::Host_Widget' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, Item) == 0x000008, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::Item' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, PreviewLevel) == 0x000010, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::PreviewLevel' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, ShowInVaultDetails) == 0x000014, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::ShowInVaultDetails' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, __WorldContext) == 0x000018, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::__WorldContext' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, FormatForVaultDetails) == 0x000020, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::FormatForVaultDetails' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, ShowPreview) == 0x000021, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::ShowPreview' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, Color) == 0x000024, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::Color' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, AlterationsArrayIndex) == 0x000034, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::AlterationsArrayIndex' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, LevelToPreview) == 0x000038, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::LevelToPreview' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, bIsAlterationSlotActive) == 0x00003C, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::bIsAlterationSlotActive' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, ItemRef) == 0x000040, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::ItemRef' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, VerticalBoxRef) == 0x000048, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::VerticalBoxRef' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, ItemLevel) == 0x000050, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::ItemLevel' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, LevelString) == 0x000058, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::LevelString' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_Create_ReturnValue) == 0x000068, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_Create_ReturnValue2) == 0x000070, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000078, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_Create_ReturnValue3) == 0x000080, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_Create_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_Create_ReturnValue4) == 0x000088, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_Create_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_AddChildToVerticalBox_ReturnValue2) == 0x000090, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_AddChildToVerticalBox_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, K2Node_MakeStruct_Margin) == 0x000098, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_AddChildToVerticalBox_ReturnValue3) == 0x0000A8, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_AddChildToVerticalBox_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, K2Node_MakeStruct_LinearColor) == 0x0000B0, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, K2Node_MakeStruct_LinearColor2) == 0x0000C0, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::K2Node_MakeStruct_LinearColor2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_SelectFloat_ReturnValue) == 0x0000D4, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, K2Node_MakeStruct_Margin2) == 0x0000D8, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::K2Node_MakeStruct_Margin2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_GetAlterationSlotActivationRequirement_ReturnValue) == 0x0000E8, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_GetAlterationSlotActivationRequirement_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, K2Node_MakeStruct_LinearColor3) == 0x000100, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::K2Node_MakeStruct_LinearColor3' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_Conv_TextToString_ReturnValue) == 0x000110, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_ParseLevelRequiredFromString_outInt) == 0x000120, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_ParseLevelRequiredFromString_outInt' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, Temp_int_Array_Index_Variable) == 0x000124, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x000128, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, Temp_int_Loop_Counter_Variable) == 0x00012C, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_Add_IntInt_ReturnValue) == 0x000130, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_GetLevel_ReturnValue) == 0x000134, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_GetAlterationSlotActivationRequirement_ReturnValue2) == 0x000138, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_GetAlterationSlotActivationRequirement_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_GetAlterations_ReturnValue) == 0x000150, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_GetAlterations_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_Conv_TextToString_ReturnValue2) == 0x000160, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_Conv_TextToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_Array_Get_Item) == 0x000170, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_Array_Length_ReturnValue) == 0x000178, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_GetDisplayName_ReturnValue) == 0x000180, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_Less_IntInt_ReturnValue) == 0x000198, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_Conv_TextToString_ReturnValue3) == 0x0001A0, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_Conv_TextToString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_Concat_StrStr_ReturnValue) == 0x0001B0, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_GetSingleLineDescription_ReturnValue) == 0x0001C0, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_GetSingleLineDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_Conv_StringToText_ReturnValue) == 0x0001D8, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, K2Node_MakeStruct_TooltipStat) == 0x0001F0, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::K2Node_MakeStruct_TooltipStat' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, K2Node_MakeStruct_TooltipStat2) == 0x000228, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::K2Node_MakeStruct_TooltipStat2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_IsAlterationSlotActive_ReturnValue) == 0x000260, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_IsAlterationSlotActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Add_Alteration_Widgets, CallFunc_AddChildToVerticalBox_ReturnValue4) == 0x000268, "Member 'ItemUIFunctionLibrary_C_Add_Alteration_Widgets::CallFunc_AddChildToVerticalBox_ReturnValue4' has a wrong offset!");

// Function ItemUIFunctionLibrary.ItemUIFunctionLibrary_C.ParseLevelRequiredFromString
// 0x0050 (0x0050 - 0x0000)
struct ItemUIFunctionLibrary_C_ParseLevelRequiredFromString final
{
public:
	class FString                                 inString;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         outInt;                                            // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue2;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString) == 0x000008, "Wrong alignment on ItemUIFunctionLibrary_C_ParseLevelRequiredFromString");
static_assert(sizeof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString) == 0x000050, "Wrong size on ItemUIFunctionLibrary_C_ParseLevelRequiredFromString");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, inString) == 0x000000, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::inString' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, __WorldContext) == 0x000010, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::__WorldContext' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, outInt) == 0x000018, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::outInt' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, CallFunc_FindSubstring_ReturnValue) == 0x00001C, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, CallFunc_FindSubstring_ReturnValue2) == 0x000020, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::CallFunc_FindSubstring_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, CallFunc_Subtract_IntInt_ReturnValue2) == 0x00002C, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::CallFunc_Subtract_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, CallFunc_Add_IntInt_ReturnValue2) == 0x000030, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, CallFunc_GetSubstring_ReturnValue) == 0x000038, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, CallFunc_Conv_StringToInt_ReturnValue) == 0x000048, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");

// Function ItemUIFunctionLibrary.ItemUIFunctionLibrary_C.Convert Tier To Integer
// 0x0048 (0x0048 - 0x0000)
struct ItemUIFunctionLibrary_C_Convert_Tier_To_Integer final
{
public:
	EFortItemTier                                 Tier;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Numeric_Tier;                                      // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemTier                                 Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable5;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable6;                                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable7;                                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable8;                                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable9;                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable10;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable11;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer) == 0x000008, "Wrong alignment on ItemUIFunctionLibrary_C_Convert_Tier_To_Integer");
static_assert(sizeof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer) == 0x000048, "Wrong size on ItemUIFunctionLibrary_C_Convert_Tier_To_Integer");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Tier) == 0x000000, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Tier' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, __WorldContext) == 0x000008, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::__WorldContext' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Numeric_Tier) == 0x000010, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Numeric_Tier' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_byte_Variable) == 0x000014, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable) == 0x000018, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable2) == 0x00001C, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable3) == 0x000020, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable4) == 0x000024, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable5) == 0x000028, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable6) == 0x00002C, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable6' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable7) == 0x000030, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable7' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable8) == 0x000034, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable8' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable9) == 0x000038, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable9' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable10) == 0x00003C, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable10' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable11) == 0x000040, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable11' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, K2Node_Select_Default) == 0x000044, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::K2Node_Select_Default' has a wrong offset!");

// Function ItemUIFunctionLibrary.ItemUIFunctionLibrary_C.Truncate Integer Value
// 0x01E8 (0x01E8 - 0x0000)
struct ItemUIFunctionLibrary_C_Truncate_Integer_Value final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Min_Fractional_Digits;                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max_Fractional_Digits;                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Formatted_Value;                                   // 0x0018(0x0018)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue3;         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue3;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0058(0x0018)()
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable2;                               // 0x0078(0x0018)()
	bool                                          Temp_bool_Variable5;                               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable3;                               // 0x0098(0x0018)()
	float                                         K2Node_Select_Default;                             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable4;                               // 0x00B8(0x0018)()
	float                                         K2Node_Select2_Default;                            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select3_Default;                            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x00E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00F8(0x0040)(HasGetValueTypeHash)
	class FText                                   K2Node_Select4_Default;                            // 0x0138(0x0018)()
	class FText                                   K2Node_Select5_Default;                            // 0x0150(0x0018)()
	class FText                                   K2Node_Select6_Default;                            // 0x0168(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0180(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01C0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01D0(0x0018)()
};
static_assert(alignof(ItemUIFunctionLibrary_C_Truncate_Integer_Value) == 0x000008, "Wrong alignment on ItemUIFunctionLibrary_C_Truncate_Integer_Value");
static_assert(sizeof(ItemUIFunctionLibrary_C_Truncate_Integer_Value) == 0x0001E8, "Wrong size on ItemUIFunctionLibrary_C_Truncate_Integer_Value");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Value) == 0x000000, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Value' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Min_Fractional_Digits) == 0x000004, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Min_Fractional_Digits' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Max_Fractional_Digits) == 0x000008, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Max_Fractional_Digits' has a wrong offset!");
