#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemCalledOutAttributesDetailWidget

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ItemCalledOutAttributesDetailWidget.ItemCalledOutAttributesDetailWidget_C.ExecuteUbergraph_ItemCalledOutAttributesDetailWidget
// 0x0038 (0x0038 - 0x0000)
struct ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetSchematicResultType_ReturnValue;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetSchematicCraftingResultBP_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget) == 0x000008, "Wrong alignment on ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget");
static_assert(sizeof(ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget) == 0x000038, "Wrong size on ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget, EntryPoint) == 0x000000, "Member 'ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget, Temp_bool_Variable) == 0x000004, "Member 'ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget, Temp_byte_Variable) == 0x000005, "Member 'ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget, Temp_bool_Variable2) == 0x000006, "Member 'ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget, Temp_byte_Variable2) == 0x000007, "Member 'ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget, CallFunc_GetSchematicResultType_ReturnValue) == 0x000009, "Member 'ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget::CallFunc_GetSchematicResultType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget, CallFunc_GetType_ReturnValue) == 0x00000A, "Member 'ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget, CallFunc_GetSchematicCraftingResultBP_ReturnValue) == 0x000010, "Member 'ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget::CallFunc_GetSchematicCraftingResultBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget, CallFunc_IsValid_ReturnValue2) == 0x000018, "Member 'ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget, K2Node_Select_Default) == 0x000019, "Member 'ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget, K2Node_MakeArray_Array) == 0x000020, "Member 'ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget, CallFunc_Array_Contains_ReturnValue) == 0x000030, "Member 'ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget, K2Node_Select2_Default) == 0x000031, "Member 'ItemCalledOutAttributesDetailWidget_C_ExecuteUbergraph_ItemCalledOutAttributesDetailWidget::K2Node_Select2_Default' has a wrong offset!");

// Function ItemCalledOutAttributesDetailWidget.ItemCalledOutAttributesDetailWidget_C.GetDisplayAttributesToCallOut
// 0x0158 (0x0158 - 0x0000)
struct ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut final
{
public:
	TArray<struct FFortDisplayAttribute>          Attributes;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<struct FGameplayTag>                   Tokens;                                            // 0x0010(0x0010)(Edit, ZeroConstructor)
	TArray<struct FFortDisplayAttribute>          Results;                                           // 0x0020(0x0010)(Edit, ZeroConstructor)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array2;                           // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array3;                           // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x0088(0x0018)(HasGetValueTypeHash)
	class UFortTooltipContext*                    CallFunc_SpawnTooltipContextWithNetID_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTooltipUIContext*                  CallFunc_GetContext_ReturnValue;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDisplayAttribute                  CallFunc_GetTooltipStat_OutDisplayAttribute;       // 0x00C8(0x0070)()
	bool                                          CallFunc_GetTooltipStat_ReturnValue;               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetSchematicCraftingResultBP_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetSchematicResultType_ReturnValue;       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x1];                                      // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 K2Node_Select_Default;                             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut) == 0x000008, "Wrong alignment on ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut");
static_assert(sizeof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut) == 0x000158, "Wrong size on ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, Attributes) == 0x000000, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::Attributes' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, Tokens) == 0x000010, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::Tokens' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, Results) == 0x000020, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::Results' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, K2Node_MakeArray_Array) == 0x000030, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, Temp_int_Array_Index_Variable) == 0x000048, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, K2Node_MakeArray_Array2) == 0x000050, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, K2Node_MakeArray_Array3) == 0x000060, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, CallFunc_GetOwningPlayer_ReturnValue) == 0x000070, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000078, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, CallFunc_GetGameAccountId_ReturnValue) == 0x000088, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::CallFunc_GetGameAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, CallFunc_SpawnTooltipContextWithNetID_ReturnValue) == 0x0000A0, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::CallFunc_SpawnTooltipContextWithNetID_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, CallFunc_GetContext_ReturnValue) == 0x0000B8, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, Temp_bool_Variable) == 0x0000C0, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, CallFunc_GetTooltipStat_OutDisplayAttribute) == 0x0000C8, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::CallFunc_GetTooltipStat_OutDisplayAttribute' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, CallFunc_GetTooltipStat_ReturnValue) == 0x000138, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::CallFunc_GetTooltipStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, CallFunc_GetSchematicCraftingResultBP_ReturnValue) == 0x000140, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::CallFunc_GetSchematicCraftingResultBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, CallFunc_GetSchematicResultType_ReturnValue) == 0x000148, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::CallFunc_GetSchematicResultType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, CallFunc_IsValid_ReturnValue) == 0x000149, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, CallFunc_GetType_ReturnValue) == 0x00014A, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, CallFunc_Array_Add_ReturnValue) == 0x00014C, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, K2Node_Select_Default) == 0x000150, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut, K2Node_SwitchEnum_CmpSuccess) == 0x000151, "Member 'ItemCalledOutAttributesDetailWidget_C_GetDisplayAttributesToCallOut::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function ItemCalledOutAttributesDetailWidget.ItemCalledOutAttributesDetailWidget_C.UpdateStats
// 0x00D8 (0x00D8 - 0x0000)
struct ItemCalledOutAttributesDetailWidget_C_UpdateStats final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStatsListItemWIdget_C*                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortDisplayAttribute>          CallFunc_GetDisplayAttributesToCallOut_Attributes; // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	class UStatsListItemWIdget_C*                 CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortDisplayAttribute                  CallFunc_Array_Get_Item2;                          // 0x0050(0x0070)()
	class UWrapBoxSlot*                           CallFunc_AddChildWrapBox_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemCalledOutAttributesDetailWidget_C_UpdateStats) == 0x000008, "Wrong alignment on ItemCalledOutAttributesDetailWidget_C_UpdateStats");
static_assert(sizeof(ItemCalledOutAttributesDetailWidget_C_UpdateStats) == 0x0000D8, "Wrong size on ItemCalledOutAttributesDetailWidget_C_UpdateStats");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_UpdateStats, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'ItemCalledOutAttributesDetailWidget_C_UpdateStats::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ItemCalledOutAttributesDetailWidget_C_UpdateStats, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'ItemCalledOutAttributesDetailWidget_C_UpdateStats::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
