#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemInspectEvolutionConfirmation

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ItemInspectEvolutionConfirmation.ItemInspectEvolutionConfirmation_C.ExecuteUbergraph_ItemInspectEvolutionConfirmation
// 0x0010 (0x0010 - 0x0000)
struct ItemInspectEvolutionConfirmation_C_ExecuteUbergraph_ItemInspectEvolutionConfirmation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectEvolutionConfirmation_C_ExecuteUbergraph_ItemInspectEvolutionConfirmation) == 0x000008, "Wrong alignment on ItemInspectEvolutionConfirmation_C_ExecuteUbergraph_ItemInspectEvolutionConfirmation");
static_assert(sizeof(ItemInspectEvolutionConfirmation_C_ExecuteUbergraph_ItemInspectEvolutionConfirmation) == 0x000010, "Wrong size on ItemInspectEvolutionConfirmation_C_ExecuteUbergraph_ItemInspectEvolutionConfirmation");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_ExecuteUbergraph_ItemInspectEvolutionConfirmation, EntryPoint) == 0x000000, "Member 'ItemInspectEvolutionConfirmation_C_ExecuteUbergraph_ItemInspectEvolutionConfirmation::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_ExecuteUbergraph_ItemInspectEvolutionConfirmation, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'ItemInspectEvolutionConfirmation_C_ExecuteUbergraph_ItemInspectEvolutionConfirmation::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function ItemInspectEvolutionConfirmation.ItemInspectEvolutionConfirmation_C.BndEvt__UpgradeConfirmButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemInspectEvolutionConfirmation_C_BndEvt__UpgradeConfirmButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectEvolutionConfirmation_C_BndEvt__UpgradeConfirmButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ItemInspectEvolutionConfirmation_C_BndEvt__UpgradeConfirmButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ItemInspectEvolutionConfirmation_C_BndEvt__UpgradeConfirmButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ItemInspectEvolutionConfirmation_C_BndEvt__UpgradeConfirmButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_BndEvt__UpgradeConfirmButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ItemInspectEvolutionConfirmation_C_BndEvt__UpgradeConfirmButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ItemInspectEvolutionConfirmation.ItemInspectEvolutionConfirmation_C.SetItemToRepresent
// 0x0050 (0x0050 - 0x0000)
struct ItemInspectEvolutionConfirmation_C_SetItemToRepresent final
{
public:
	class UFortItem*                              Item_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanEvolve;                                         // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NoEvolutions;                                      // 0x0009(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumEvolutionOptions_NumRecipes;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EItemEvolutionRestrictionReason>       CallFunc_CanEvolve_OutRestrictionReasons;          // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CanEvolve_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemEvolutionRestrictionReason               CallFunc_Array_Get_Item;                           // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent) == 0x000008, "Wrong alignment on ItemInspectEvolutionConfirmation_C_SetItemToRepresent");
static_assert(sizeof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent) == 0x000050, "Wrong size on ItemInspectEvolutionConfirmation_C_SetItemToRepresent");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, Item_0) == 0x000000, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::Item_0' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, CanEvolve) == 0x000008, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::CanEvolve' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, NoEvolutions) == 0x000009, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::NoEvolutions' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, CallFunc_GetNumEvolutionOptions_NumRecipes) == 0x000028, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::CallFunc_GetNumEvolutionOptions_NumRecipes' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, CallFunc_CanEvolve_OutRestrictionReasons) == 0x000030, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::CallFunc_CanEvolve_OutRestrictionReasons' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, CallFunc_CanEvolve_ReturnValue) == 0x000040, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::CallFunc_CanEvolve_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, CallFunc_Greater_IntInt_ReturnValue) == 0x000041, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, CallFunc_Array_Get_Item) == 0x000042, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, CallFunc_BooleanAND_ReturnValue) == 0x000043, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000044, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetItemToRepresent, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'ItemInspectEvolutionConfirmation_C_SetItemToRepresent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ItemInspectEvolutionConfirmation.ItemInspectEvolutionConfirmation_C.SetEvolutionToRepresent
// 0x00F0 (0x00F0 - 0x0000)
struct ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent final
{
public:
	int32                                         EvolutionIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              EvolutionItem;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortItemQuantityPair>          Ingredients;                                       // 0x0010(0x0010)(Edit, ZeroConstructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRecipe>                        CallFunc_GetConversionRecipesFromItemDefintion_ReturnValue; // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	struct FRecipe                                CallFunc_Array_Get_Item;                           // 0x0050(0x0050)()
	struct FFortItemQuantityPair                  CallFunc_Array_Get_Item2;                          // 0x00A0(0x0028)()
	class UFortItemDefinition*                    CallFunc_GetItemFromItemQuantityPair_ReturnValue;  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x00D8(0x0018)()
};
static_assert(alignof(ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent) == 0x000008, "Wrong alignment on ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent");
static_assert(sizeof(ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent) == 0x0000F0, "Wrong size on ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent, EvolutionIndex) == 0x000000, "Member 'ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent::EvolutionIndex' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent, EvolutionItem) == 0x000008, "Member 'ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent::EvolutionItem' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent, Ingredients) == 0x000010, "Member 'ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent::Ingredients' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent, CallFunc_GetContext_ReturnValue2) == 0x000030, "Member 'ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000038, "Member 'ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent, CallFunc_GetConversionRecipesFromItemDefintion_ReturnValue) == 0x000040, "Member 'ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent::CallFunc_GetConversionRecipesFromItemDefintion_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent, CallFunc_Array_Get_Item) == 0x000050, "Member 'ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent, CallFunc_Array_Get_Item2) == 0x0000A0, "Member 'ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent, CallFunc_GetItemFromItemQuantityPair_ReturnValue) == 0x0000C8, "Member 'ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent::CallFunc_GetItemFromItemQuantityPair_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x0000D0, "Member 'ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent, CallFunc_GetDisplayName_ReturnValue) == 0x0000D8, "Member 'ItemInspectEvolutionConfirmation_C_SetEvolutionToRepresent::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");

// Function ItemInspectEvolutionConfirmation.ItemInspectEvolutionConfirmation_C.HandleEvolutionOptionHovered
// 0x0010 (0x0010 - 0x0000)
struct ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionHovered final
{
public:
	class UFortItem*                              Item_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RecipeIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionHovered) == 0x000008, "Wrong alignment on ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionHovered");
static_assert(sizeof(ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionHovered) == 0x000010, "Wrong size on ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionHovered");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionHovered, Item_0) == 0x000000, "Member 'ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionHovered::Item_0' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionHovered, RecipeIndex) == 0x000008, "Member 'ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionHovered::RecipeIndex' has a wrong offset!");

// Function ItemInspectEvolutionConfirmation.ItemInspectEvolutionConfirmation_C.HandleEvolutionOptionUnhovered
// 0x0008 (0x0008 - 0x0000)
struct ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionUnhovered final
{
public:
	class UFortItem*                              Item_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionUnhovered) == 0x000008, "Wrong alignment on ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionUnhovered");
static_assert(sizeof(ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionUnhovered) == 0x000008, "Wrong size on ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionUnhovered");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionUnhovered, Item_0) == 0x000000, "Member 'ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionUnhovered::Item_0' has a wrong offset!");

// Function ItemInspectEvolutionConfirmation.ItemInspectEvolutionConfirmation_C.HandleEvolutionOptionSelected
// 0x0018 (0x0018 - 0x0000)
struct ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionSelected final
{
public:
	class UFortItem*                              Item_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RecipeIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionSelected) == 0x000008, "Wrong alignment on ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionSelected");
static_assert(sizeof(ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionSelected) == 0x000018, "Wrong size on ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionSelected");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionSelected, Item_0) == 0x000000, "Member 'ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionSelected::Item_0' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionSelected, RecipeIndex) == 0x000008, "Member 'ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionSelected::RecipeIndex' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionSelected, CallFunc_GetUINavigationManager_ReturnValue) == 0x000010, "Member 'ItemInspectEvolutionConfirmation_C_HandleEvolutionOptionSelected::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function ItemInspectEvolutionConfirmation.ItemInspectEvolutionConfirmation_C.SetupEvolutionOptions
// 0x0158 (0x0158 - 0x0000)
struct ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions final
{
public:
	class UFortItem*                              TemporaryEvolutionItem;                            // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemInspectEvolutionChoiceEntry_C*     CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortItem* Item, int32 RecipeIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortItem* Item)>        K2Node_CreateDelegate_OutputDelegate2;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UFortItem* Item, int32 RecipeIndex)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue2;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRecipe>                        CallFunc_GetConversionRecipesFromItemDefintion_ReturnValue; // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRecipe                                CallFunc_Array_Get_Item;                           // 0x00A0(0x0050)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemQuantityPair                  CallFunc_Array_Get_Item2;                          // 0x00F8(0x0028)()
	class UFortItemDefinition*                    CallFunc_GetItemFromItemQuantityPair_ReturnValue;  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_CreateTemporaryInstanceFromExistingItemBP_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue3;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAllowedConversionIndex_ReturnValue;     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions) == 0x000008, "Wrong alignment on ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions");
static_assert(sizeof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions) == 0x000158, "Wrong size on ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, TemporaryEvolutionItem) == 0x000000, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::TemporaryEvolutionItem' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000010, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000020, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_GetOwningPlayer_ReturnValue2) == 0x000028, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_Create_ReturnValue) == 0x000030, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_AddChild_ReturnValue) == 0x000048, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, K2Node_CreateDelegate_OutputDelegate2) == 0x000050, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, K2Node_CreateDelegate_OutputDelegate3) == 0x000060, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_GetContext_ReturnValue) == 0x000070, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, Temp_int_Array_Index_Variable) == 0x000078, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_GetContext_ReturnValue2) == 0x000080, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_GetConversionRecipesFromItemDefintion_ReturnValue) == 0x000088, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_GetConversionRecipesFromItemDefintion_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, Temp_int_Loop_Counter_Variable) == 0x000098, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_Add_IntInt_ReturnValue) == 0x0000F0, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_Array_Get_Item2) == 0x0000F8, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_GetItemFromItemQuantityPair_ReturnValue) == 0x000120, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_GetItemFromItemQuantityPair_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_Array_Length_ReturnValue) == 0x000128, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_IsValid_ReturnValue) == 0x00012C, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_Greater_IntInt_ReturnValue) == 0x00012D, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_CreateTemporaryInstanceFromExistingItemBP_ReturnValue) == 0x000130, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_CreateTemporaryInstanceFromExistingItemBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_Array_Length_ReturnValue2) == 0x000138, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_Array_Length_ReturnValue3) == 0x00013C, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_Less_IntInt_ReturnValue) == 0x000140, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_Greater_IntInt_ReturnValue2) == 0x000141, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_GetContext_ReturnValue3) == 0x000148, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions, CallFunc_IsAllowedConversionIndex_ReturnValue) == 0x000150, "Member 'ItemInspectEvolutionConfirmation_C_SetupEvolutionOptions::CallFunc_IsAllowedConversionIndex_ReturnValue' has a wrong offset!");

// Function ItemInspectEvolutionConfirmation.ItemInspectEvolutionConfirmation_C.GetNumEvolutionOptions
// 0x0030 (0x0030 - 0x0000)
struct ItemInspectEvolutionConfirmation_C_GetNumEvolutionOptions final
{
public:
	int32                                         NumRecipes;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRecipe>                        CallFunc_GetConversionRecipesFromItemDefintion_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectEvolutionConfirmation_C_GetNumEvolutionOptions) == 0x000008, "Wrong alignment on ItemInspectEvolutionConfirmation_C_GetNumEvolutionOptions");
static_assert(sizeof(ItemInspectEvolutionConfirmation_C_GetNumEvolutionOptions) == 0x000030, "Wrong size on ItemInspectEvolutionConfirmation_C_GetNumEvolutionOptions");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_GetNumEvolutionOptions, NumRecipes) == 0x000000, "Member 'ItemInspectEvolutionConfirmation_C_GetNumEvolutionOptions::NumRecipes' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_GetNumEvolutionOptions, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'ItemInspectEvolutionConfirmation_C_GetNumEvolutionOptions::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_GetNumEvolutionOptions, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000010, "Member 'ItemInspectEvolutionConfirmation_C_GetNumEvolutionOptions::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_GetNumEvolutionOptions, CallFunc_GetConversionRecipesFromItemDefintion_ReturnValue) == 0x000018, "Member 'ItemInspectEvolutionConfirmation_C_GetNumEvolutionOptions::CallFunc_GetConversionRecipesFromItemDefintion_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_GetNumEvolutionOptions, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'ItemInspectEvolutionConfirmation_C_GetNumEvolutionOptions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function ItemInspectEvolutionConfirmation.ItemInspectEvolutionConfirmation_C.OnShow
// 0x0038 (0x0038 - 0x0000)
struct ItemInspectEvolutionConfirmation_C_OnShow final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumEvolutionOptions_NumRecipes;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInspectEvolutionChoiceEntry_C*     K2Node_DynamicCast_AsItem_Inspect_Evolution_Choice_Entry; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue2;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemInspectEvolutionConfirmation_C_OnShow) == 0x000008, "Wrong alignment on ItemInspectEvolutionConfirmation_C_OnShow");
static_assert(sizeof(ItemInspectEvolutionConfirmation_C_OnShow) == 0x000038, "Wrong size on ItemInspectEvolutionConfirmation_C_OnShow");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_OnShow, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'ItemInspectEvolutionConfirmation_C_OnShow::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_OnShow, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'ItemInspectEvolutionConfirmation_C_OnShow::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_OnShow, CallFunc_GetNumEvolutionOptions_NumRecipes) == 0x000010, "Member 'ItemInspectEvolutionConfirmation_C_OnShow::CallFunc_GetNumEvolutionOptions_NumRecipes' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_OnShow, K2Node_DynamicCast_AsItem_Inspect_Evolution_Choice_Entry) == 0x000018, "Member 'ItemInspectEvolutionConfirmation_C_OnShow::K2Node_DynamicCast_AsItem_Inspect_Evolution_Choice_Entry' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_OnShow, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ItemInspectEvolutionConfirmation_C_OnShow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_OnShow, CallFunc_Greater_IntInt_ReturnValue) == 0x000021, "Member 'ItemInspectEvolutionConfirmation_C_OnShow::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_OnShow, CallFunc_GetChildAt_ReturnValue2) == 0x000028, "Member 'ItemInspectEvolutionConfirmation_C_OnShow::CallFunc_GetChildAt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_OnShow, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'ItemInspectEvolutionConfirmation_C_OnShow::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ItemInspectEvolutionConfirmation.ItemInspectEvolutionConfirmation_C.UnselectOtherEvolutions
// 0x0038 (0x0038 - 0x0000)
struct ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemInspectEvolutionChoiceEntry_C*     K2Node_DynamicCast_AsItem_Inspect_Evolution_Choice_Entry; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions) == 0x000008, "Wrong alignment on ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions");
static_assert(sizeof(ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions) == 0x000038, "Wrong size on ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions, SelectedIndex) == 0x000000, "Member 'ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions::SelectedIndex' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions, Temp_int_Variable) == 0x000004, "Member 'ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions, K2Node_DynamicCast_AsItem_Inspect_Evolution_Choice_Entry) == 0x000018, "Member 'ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions::K2Node_DynamicCast_AsItem_Inspect_Evolution_Choice_Entry' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions, CallFunc_GetChildrenCount_ReturnValue) == 0x000024, "Member 'ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002C, "Member 'ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'ItemInspectEvolutionConfirmation_C_UnselectOtherEvolutions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function ItemInspectEvolutionConfirmation.ItemInspectEvolutionConfirmation_C.SetEvolutionRestrictions
// 0x0068 (0x0068 - 0x0000)
struct ItemInspectEvolutionConfirmation_C_SetEvolutionRestrictions final
{
public:
	EItemEvolutionRestrictionReason               Temp_byte_Variable;                                // 0x0000(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEvolveRestrictionReasonText_ReturnValue; // 0x0010(0x0018)()
	EItemEvolutionRestrictionReason               Temp_byte_Variable2;                               // 0x0028(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EItemEvolutionRestrictionReason>       CallFunc_CanEvolve_OutRestrictionReasons;          // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CanEvolve_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEvolveRestrictionReasonText_ReturnValue2; // 0x0048(0x0018)()
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue2;              // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemInspectEvolutionConfirmation_C_SetEvolutionRestrictions) == 0x000008, "Wrong alignment on ItemInspectEvolutionConfirmation_C_SetEvolutionRestrictions");
static_assert(sizeof(ItemInspectEvolutionConfirmation_C_SetEvolutionRestrictions) == 0x000068, "Wrong size on ItemInspectEvolutionConfirmation_C_SetEvolutionRestrictions");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetEvolutionRestrictions, Temp_byte_Variable) == 0x000000, "Member 'ItemInspectEvolutionConfirmation_C_SetEvolutionRestrictions::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemInspectEvolutionConfirmation_C_SetEvolutionRestrictions, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'ItemInspectEvolutionConfirmation_C_SetEvolutionRestrictions::CallFunc_GetContext_ReturnValue' has a wrong offset!");
