#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemManagementItemDetailsPanel_OverviewOnly

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemManagementItemDetailsPanel-OverviewOnly.ItemManagementItemDetailsPanel-OverviewOnly_C
// 0x0040 (0x02A0 - 0x0260)
class UItemManagementItemDetailsPanel_OverviewOnly_C final : public UFortItemDetailsPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       ItemDescription;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ItemDisplayNameText;                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NoSelectionDetailsBox;                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NoSelectionText;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        RootWidgetSwitcher;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SelectedItemDetailsOverlay;                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SelectionPromptText;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemManagementItemDetailsPanel_OverviewOnly(int32 EntryPoint);
	void HandleDifferentItemToDetailSet();
	void SetDescriptionText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemManagementItemDetailsPanel-OverviewOnly_C">();
	}
	static class UItemManagementItemDetailsPanel_OverviewOnly_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemManagementItemDetailsPanel_OverviewOnly_C>();
	}
};
static_assert(alignof(UItemManagementItemDetailsPanel_OverviewOnly_C) == 0x000008, "Wrong alignment on UItemManagementItemDetailsPanel_OverviewOnly_C");
static_assert(sizeof(UItemManagementItemDetailsPanel_OverviewOnly_C) == 0x0002A0, "Wrong size on UItemManagementItemDetailsPanel_OverviewOnly_C");
static_assert(offsetof(UItemManagementItemDetailsPanel_OverviewOnly_C, UberGraphFrame) == 0x000260, "Member 'UItemManagementItemDetailsPanel_OverviewOnly_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemManagementItemDetailsPanel_OverviewOnly_C, ItemDescription) == 0x000268, "Member 'UItemManagementItemDetailsPanel_OverviewOnly_C::ItemDescription' has a wrong offset!");
static_assert(offsetof(UItemManagementItemDetailsPanel_OverviewOnly_C, ItemDisplayNameText) == 0x000270, "Member 'UItemManagementItemDetailsPanel_OverviewOnly_C::ItemDisplayNameText' has a wrong offset!");
static_assert(offsetof(UItemManagementItemDetailsPanel_OverviewOnly_C, NoSelectionDetailsBox) == 0x000278, "Member 'UItemManagementItemDetailsPanel_OverviewOnly_C::NoSelectionDetailsBox' has a wrong offset!");
static_assert(offsetof(UItemManagementItemDetailsPanel_OverviewOnly_C, NoSelectionText) == 0x000280, "Member 'UItemManagementItemDetailsPanel_OverviewOnly_C::NoSelectionText' has a wrong offset!");
static_assert(offsetof(UItemManagementItemDetailsPanel_OverviewOnly_C, RootWidgetSwitcher) == 0x000288, "Member 'UItemManagementItemDetailsPanel_OverviewOnly_C::RootWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UItemManagementItemDetailsPanel_OverviewOnly_C, SelectedItemDetailsOverlay) == 0x000290, "Member 'UItemManagementItemDetailsPanel_OverviewOnly_C::SelectedItemDetailsOverlay' has a wrong offset!");
static_assert(offsetof(UItemManagementItemDetailsPanel_OverviewOnly_C, SelectionPromptText) == 0x000298, "Member 'UItemManagementItemDetailsPanel_OverviewOnly_C::SelectionPromptText' has a wrong offset!");

}

