#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemDetailsHeaderItemDisplayText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemDetailsHeaderItemDisplayText.ItemDetailsHeaderItemDisplayText_C
// 0x0018 (0x0288 - 0x0270)
class UItemDetailsHeaderItemDisplayText_C final : public UFortItemDetailElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       ItemDisplayName;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Show_New_System;                                   // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ItemDetailsHeaderItemDisplayText(int32 EntryPoint);
	void HandlePostDifferentItemToDetailSet();
	void HandlePostDifferentItemToCompareWithSet();
	void GetDisplayName(class FText* DisplayName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemDetailsHeaderItemDisplayText_C">();
	}
	static class UItemDetailsHeaderItemDisplayText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemDetailsHeaderItemDisplayText_C>();
	}
};
static_assert(alignof(UItemDetailsHeaderItemDisplayText_C) == 0x000008, "Wrong alignment on UItemDetailsHeaderItemDisplayText_C");
static_assert(sizeof(UItemDetailsHeaderItemDisplayText_C) == 0x000288, "Wrong size on UItemDetailsHeaderItemDisplayText_C");
static_assert(offsetof(UItemDetailsHeaderItemDisplayText_C, UberGraphFrame) == 0x000270, "Member 'UItemDetailsHeaderItemDisplayText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemDetailsHeaderItemDisplayText_C, ItemDisplayName) == 0x000278, "Member 'UItemDetailsHeaderItemDisplayText_C::ItemDisplayName' has a wrong offset!");
static_assert(offsetof(UItemDetailsHeaderItemDisplayText_C, Show_New_System) == 0x000280, "Member 'UItemDetailsHeaderItemDisplayText_C::Show_New_System' has a wrong offset!");

}

