#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemManagementDetailsModeBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C
// 0x0078 (0x04A8 - 0x0430)
class UItemManagementDetailsModeBox_C final : public UFortItemDetailsModeActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UCommonWidgetSwitcher*                  DetailPanelOverrideSwitcher;                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalTabList_C*                   DetailPanelTabList_MB;                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalTabList_C*                   DetailPanelTabList_MS;                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalTabList_C*                   DetailPanelTabList_MSB;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalTabList_C*                   DetailPanelTabList_MSC;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemManagementItemDetailsPanel_OverviewOnly_C* ItemManagementItemDetailsPanel_OverviewOnly;       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ItemSelected;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NoSelectionDetailsBox;                             // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NoSelectionText;                                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                NoTabList;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SelectionPromptText;                               // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TabbedWidgets;                                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  TabListWidgetSwitcher;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuantitySelector_C*                    QuantitySelectorWidget;                            // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemManagementDetailsModeBox(int32 EntryPoint);
	void BndEvt__DetailPanelTabList_MSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void Construct();
	void HandleConsumeItemProgressChangedBP();
	void BndEvt__DetailPanelTabList_OI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void BndEvt__DetailPanelTabList_OP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void BndEvt__DetailPanelTabList_OPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void OnActivated();
	void HandleDifferentItemToDetailSetBP();
	void BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	void HandleClose(bool* PassThrough);
	void HandleInspect(bool* PassThrough);
	void HandleCompare(bool* PassThrough);
	void HandleMulch(bool* PassThrough);
	void HandleSort(bool* PassThrough);
	void TrySetupInputHandling();
	void HandleConsumeItem(bool* PassThrough);
	void HandleCraft(bool* PassThrough);
	void ShowSelection();
	void HandleDrop(bool* PassThrough);
	void RegisterDrop();
	void RegisterCraft();
	void RegisterMulch();
	void RegisterRetire();
	void RegisterInspect();
	void RegisterBack();
	void RegisterSort(bool InGame);
	void RegisterConsumeItem();
	void RegisterCompare();
	void RegisterTrack();
	void HandleTrack(bool* PassThrough);
	void RegisterEquip();
	void HandleEquip(bool* PassThrough);
	void SetupDetailPanels();
	void UpdateConsumeItemButtonState();
	void SetItemVisualization();
	void SetTabStyling(class UObject* Object);
	void RegisterInventoryInspect();
	void HandleWorldItemListChanged(TArray<class UFortWorldItem*>& ItemsAdded, TArray<class UFortWorldItem*>& ItemsRemoved);
	void HandleWorldItemsChanged();
	void RefreshCraftActions();
	void RegisterCraftAndSlot();
	void HandleCraftAndSlot(bool* PassThrough);
	void HandleInputMethodChanged(bool UsingGamepad);
	void DestroyQuantitySelectorWidget();
	void CreateQuantitySelectorWidget(class UFortWorldItem* Item, const class FText& ConfirmationText);
	void DropItem(class UFortWorldItem* Item, int32 Quantity);
	void HandleDropItemCallback(int32 ChosenQuantity, class UFortItem* Item);
	void RegisterCraftingCompare();
	void ForceRefreshTab(class UHorizontalTabList_C* TabList);
	void RefreshMulchAction();
	void RegisterLeaveInventory();
	void HandleQuickbarContentsChanged(EFortQuickBars QuickbarIndex);
	void RegisterInspectUpgrade();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemManagementDetailsModeBox_C">();
	}
	static class UItemManagementDetailsModeBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemManagementDetailsModeBox_C>();
	}
};
static_assert(alignof(UItemManagementDetailsModeBox_C) == 0x000008, "Wrong alignment on UItemManagementDetailsModeBox_C");
static_assert(sizeof(UItemManagementDetailsModeBox_C) == 0x0004A8, "Wrong size on UItemManagementDetailsModeBox_C");
static_assert(offsetof(UItemManagementDetailsModeBox_C, UberGraphFrame) == 0x000430, "Member 'UItemManagementDetailsModeBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemManagementDetailsModeBox_C, DetailPanelOverrideSwitcher) == 0x000438, "Member 'UItemManagementDetailsModeBox_C::DetailPanelOverrideSwitcher' has a wrong offset!");
static_assert(offsetof(UItemManagementDetailsModeBox_C, DetailPanelTabList_MB) == 0x000440, "Member 'UItemManagementDetailsModeBox_C::DetailPanelTabList_MB' has a wrong offset!");
static_assert(offsetof(UItemManagementDetailsModeBox_C, DetailPanelTabList_MS) == 0x000448, "Member 'UItemManagementDetailsModeBox_C::DetailPanelTabList_MS' has a wrong offset!");
static_assert(offsetof(UItemManagementDetailsModeBox_C, DetailPanelTabList_MSB) == 0x000450, "Member 'UItemManagementDetailsModeBox_C::DetailPanelTabList_MSB' has a wrong offset!");
static_assert(offsetof(UItemManagementDetailsModeBox_C, DetailPanelTabList_MSC) == 0x000458, "Member 'UItemManagementDetailsModeBox_C::DetailPanelTabList_MSC' has a wrong offset!");
static_assert(offsetof(UItemManagementDetailsModeBox_C, ItemManagementItemDetailsPanel_OverviewOnly) == 0x000460, "Member 'UItemManagementDetailsModeBox_C::ItemManagementItemDetailsPanel_OverviewOnly' has a wrong offset!");
static_assert(offsetof(UItemManagementDetailsModeBox_C, ItemSelected) == 0x000468, "Member 'UItemManagementDetailsModeBox_C::ItemSelected' has a wrong offset!");
static_assert(offsetof(UItemManagementDetailsModeBox_C, NoSelectionDetailsBox) == 0x000470, "Member 'UItemManagementDetailsModeBox_C::NoSelectionDetailsBox' has a wrong offset!");
static_assert(offsetof(UItemManagementDetailsModeBox_C, NoSelectionText) == 0x000478, "Member 'UItemManagementDetailsModeBox_C::NoSelectionText' has a wrong offset!");
static_assert(offsetof(UItemManagementDetailsModeBox_C, NoTabList) == 0x000480, "Member 'UItemManagementDetailsModeBox_C::NoTabList' has a wrong offset!");
static_assert(offsetof(UItemManagementDetailsModeBox_C, SelectionPromptText) == 0x000488, "Member 'UItemManagementDetailsModeBox_C::SelectionPromptText' has a wrong offset!");
static_assert(offsetof(UItemManagementDetailsModeBox_C, TabbedWidgets) == 0x000490, "Member 'UItemManagementDetailsModeBox_C::TabbedWidgets' has a wrong offset!");
static_assert(offsetof(UItemManagementDetailsModeBox_C, TabListWidgetSwitcher) == 0x000498, "Member 'UItemManagementDetailsModeBox_C::TabListWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UItemManagementDetailsModeBox_C, QuantitySelectorWidget) == 0x0004A0, "Member 'UItemManagementDetailsModeBox_C::QuantitySelectorWidget' has a wrong offset!");

}

