#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemDetailsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemDetailsWidget.ItemDetailsWidget_C
// 0x0038 (0x0298 - 0x0260)
class UItemDetailsWidget_C final : public UFortItemDetailsPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(Transient, DuplicateTransient)
	class UWidgetSwitcher*                        ContentSwitcher;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DescriptionBox;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             IndicatorIconsSlot;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ItemDescription;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemHeaderWidget_C*                    ItemHeaderWidget;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatsListWidget_C*                     StatsListWidget;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemDetailsWidget(int32 EntryPoint);
	void HandleDifferentItemToCompareSet();
	void HandleDifferentItemToDetailSet();
	void PopulateAttributeList();
	void ShowUpgradeComparison();
	void ItemHasStats(class UFortItem* Item, bool* Stats);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemDetailsWidget_C">();
	}
	static class UItemDetailsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemDetailsWidget_C>();
	}
};
static_assert(alignof(UItemDetailsWidget_C) == 0x000008, "Wrong alignment on UItemDetailsWidget_C");
static_assert(sizeof(UItemDetailsWidget_C) == 0x000298, "Wrong size on UItemDetailsWidget_C");
static_assert(offsetof(UItemDetailsWidget_C, UberGraphFrame) == 0x000260, "Member 'UItemDetailsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemDetailsWidget_C, ContentSwitcher) == 0x000268, "Member 'UItemDetailsWidget_C::ContentSwitcher' has a wrong offset!");
static_assert(offsetof(UItemDetailsWidget_C, DescriptionBox) == 0x000270, "Member 'UItemDetailsWidget_C::DescriptionBox' has a wrong offset!");
static_assert(offsetof(UItemDetailsWidget_C, IndicatorIconsSlot) == 0x000278, "Member 'UItemDetailsWidget_C::IndicatorIconsSlot' has a wrong offset!");
static_assert(offsetof(UItemDetailsWidget_C, ItemDescription) == 0x000280, "Member 'UItemDetailsWidget_C::ItemDescription' has a wrong offset!");
static_assert(offsetof(UItemDetailsWidget_C, ItemHeaderWidget) == 0x000288, "Member 'UItemDetailsWidget_C::ItemHeaderWidget' has a wrong offset!");
static_assert(offsetof(UItemDetailsWidget_C, StatsListWidget) == 0x000290, "Member 'UItemDetailsWidget_C::StatsListWidget' has a wrong offset!");

}

