#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemTooltipContent

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "ItemTooltip_DisplayMode_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ItemTooltipContent.ItemTooltipContent_C.ExecuteUbergraph_ItemTooltipContent
// 0x0004 (0x0004 - 0x0000)
struct ItemTooltipContent_C_ExecuteUbergraph_ItemTooltipContent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTooltipContent_C_ExecuteUbergraph_ItemTooltipContent) == 0x000004, "Wrong alignment on ItemTooltipContent_C_ExecuteUbergraph_ItemTooltipContent");
static_assert(sizeof(ItemTooltipContent_C_ExecuteUbergraph_ItemTooltipContent) == 0x000004, "Wrong size on ItemTooltipContent_C_ExecuteUbergraph_ItemTooltipContent");
static_assert(offsetof(ItemTooltipContent_C_ExecuteUbergraph_ItemTooltipContent, EntryPoint) == 0x000000, "Member 'ItemTooltipContent_C_ExecuteUbergraph_ItemTooltipContent::EntryPoint' has a wrong offset!");

// Function ItemTooltipContent.ItemTooltipContent_C.Update
// 0x0018 (0x0018 - 0x0000)
struct ItemTooltipContent_C_Update final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemTooltipContent_C_Update) == 0x000008, "Wrong alignment on ItemTooltipContent_C_Update");
static_assert(sizeof(ItemTooltipContent_C_Update) == 0x000018, "Wrong size on ItemTooltipContent_C_Update");
static_assert(offsetof(ItemTooltipContent_C_Update, Success) == 0x000000, "Member 'ItemTooltipContent_C_Update::Success' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Update, Temp_bool_Variable) == 0x000001, "Member 'ItemTooltipContent_C_Update::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Update, K2Node_Select_Default) == 0x000008, "Member 'ItemTooltipContent_C_Update::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Update, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ItemTooltipContent_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ItemTooltipContent.ItemTooltipContent_C.Set Item Data
// 0x0020 (0x0020 - 0x0000)
struct ItemTooltipContent_C_Set_Item_Data final
{
public:
	class UFortItem*                              Item_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              Comparison_Item;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemTooltip_DisplayMode                      DisplayMode_0;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OverrideQuantity_0;                                // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Update_Success;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemTooltipContent_C_Set_Item_Data) == 0x000008, "Wrong alignment on ItemTooltipContent_C_Set_Item_Data");
static_assert(sizeof(ItemTooltipContent_C_Set_Item_Data) == 0x000020, "Wrong size on ItemTooltipContent_C_Set_Item_Data");
static_assert(offsetof(ItemTooltipContent_C_Set_Item_Data, Item_0) == 0x000000, "Member 'ItemTooltipContent_C_Set_Item_Data::Item_0' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Item_Data, Comparison_Item) == 0x000008, "Member 'ItemTooltipContent_C_Set_Item_Data::Comparison_Item' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Item_Data, DisplayMode_0) == 0x000010, "Member 'ItemTooltipContent_C_Set_Item_Data::DisplayMode_0' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Item_Data, OverrideQuantity_0) == 0x000014, "Member 'ItemTooltipContent_C_Set_Item_Data::OverrideQuantity_0' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Item_Data, CallFunc_Update_Success) == 0x000018, "Member 'ItemTooltipContent_C_Set_Item_Data::CallFunc_Update_Success' has a wrong offset!");

// Function ItemTooltipContent.ItemTooltipContent_C.Build Weapon DPS Stat
// 0x00B8 (0x00B8 - 0x0000)
struct ItemTooltipContent_C_Build_Weapon_DPS_Stat final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTooltipUIContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTooltipContext*                    CallFunc_Init_Tooltip_Context_Tooltip_Context;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponTooltipDPSWidget_C*              CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortDisplayAttribute                  CallFunc_GetTooltipStat_OutDisplayAttribute;       // 0x0030(0x0070)()
	bool                                          CallFunc_GetTooltipStat_ReturnValue;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemTooltipContent_C_Build_Weapon_DPS_Stat) == 0x000008, "Wrong alignment on ItemTooltipContent_C_Build_Weapon_DPS_Stat");
static_assert(sizeof(ItemTooltipContent_C_Build_Weapon_DPS_Stat) == 0x0000B8, "Wrong size on ItemTooltipContent_C_Build_Weapon_DPS_Stat");
static_assert(offsetof(ItemTooltipContent_C_Build_Weapon_DPS_Stat, Temp_byte_Variable) == 0x000000, "Member 'ItemTooltipContent_C_Build_Weapon_DPS_Stat::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Weapon_DPS_Stat, Temp_byte_Variable2) == 0x000001, "Member 'ItemTooltipContent_C_Build_Weapon_DPS_Stat::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Weapon_DPS_Stat, Temp_bool_Variable) == 0x000002, "Member 'ItemTooltipContent_C_Build_Weapon_DPS_Stat::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Weapon_DPS_Stat, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'ItemTooltipContent_C_Build_Weapon_DPS_Stat::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Weapon_DPS_Stat, CallFunc_Init_Tooltip_Context_Tooltip_Context) == 0x000010, "Member 'ItemTooltipContent_C_Build_Weapon_DPS_Stat::CallFunc_Init_Tooltip_Context_Tooltip_Context' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Weapon_DPS_Stat, K2Node_Select_Default) == 0x000018, "Member 'ItemTooltipContent_C_Build_Weapon_DPS_Stat::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Weapon_DPS_Stat, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'ItemTooltipContent_C_Build_Weapon_DPS_Stat::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Weapon_DPS_Stat, CallFunc_Create_ReturnValue) == 0x000028, "Member 'ItemTooltipContent_C_Build_Weapon_DPS_Stat::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Weapon_DPS_Stat, CallFunc_GetTooltipStat_OutDisplayAttribute) == 0x000030, "Member 'ItemTooltipContent_C_Build_Weapon_DPS_Stat::CallFunc_GetTooltipStat_OutDisplayAttribute' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Weapon_DPS_Stat, CallFunc_GetTooltipStat_ReturnValue) == 0x0000A0, "Member 'ItemTooltipContent_C_Build_Weapon_DPS_Stat::CallFunc_GetTooltipStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Weapon_DPS_Stat, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000A8, "Member 'ItemTooltipContent_C_Build_Weapon_DPS_Stat::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Weapon_DPS_Stat, Temp_bool_Variable2) == 0x0000B0, "Member 'ItemTooltipContent_C_Build_Weapon_DPS_Stat::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Weapon_DPS_Stat, K2Node_Select2_Default) == 0x0000B1, "Member 'ItemTooltipContent_C_Build_Weapon_DPS_Stat::K2Node_Select2_Default' has a wrong offset!");

// Function ItemTooltipContent.ItemTooltipContent_C.Build Worker Stats
// 0x0030 (0x0030 - 0x0000)
struct ItemTooltipContent_C_Build_Worker_Stats final
{
public:
	class UObject*                                OccupiedBuildingDefinition;                        // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWorkerTooltipStatsWidget_C*            CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorker*                            K2Node_DynamicCast_AsFort_Worker;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemTooltipContent_C_Build_Worker_Stats) == 0x000008, "Wrong alignment on ItemTooltipContent_C_Build_Worker_Stats");
static_assert(sizeof(ItemTooltipContent_C_Build_Worker_Stats) == 0x000030, "Wrong size on ItemTooltipContent_C_Build_Worker_Stats");
static_assert(offsetof(ItemTooltipContent_C_Build_Worker_Stats, OccupiedBuildingDefinition) == 0x000000, "Member 'ItemTooltipContent_C_Build_Worker_Stats::OccupiedBuildingDefinition' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Worker_Stats, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'ItemTooltipContent_C_Build_Worker_Stats::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Worker_Stats, CallFunc_Create_ReturnValue) == 0x000010, "Member 'ItemTooltipContent_C_Build_Worker_Stats::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Worker_Stats, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000018, "Member 'ItemTooltipContent_C_Build_Worker_Stats::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Worker_Stats, K2Node_DynamicCast_AsFort_Worker) == 0x000020, "Member 'ItemTooltipContent_C_Build_Worker_Stats::K2Node_DynamicCast_AsFort_Worker' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Worker_Stats, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ItemTooltipContent_C_Build_Worker_Stats::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ItemTooltipContent.ItemTooltipContent_C.Build Alteration Info
// 0x0010 (0x0010 - 0x0000)
struct ItemTooltipContent_C_Build_Alteration_Info final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTooltipContent_C_Build_Alteration_Info) == 0x000008, "Wrong alignment on ItemTooltipContent_C_Build_Alteration_Info");
static_assert(sizeof(ItemTooltipContent_C_Build_Alteration_Info) == 0x000010, "Wrong size on ItemTooltipContent_C_Build_Alteration_Info");
static_assert(offsetof(ItemTooltipContent_C_Build_Alteration_Info, Temp_bool_Variable) == 0x000000, "Member 'ItemTooltipContent_C_Build_Alteration_Info::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Alteration_Info, CallFunc_GetLevel_ReturnValue) == 0x000004, "Member 'ItemTooltipContent_C_Build_Alteration_Info::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Alteration_Info, K2Node_Select_Default) == 0x000008, "Member 'ItemTooltipContent_C_Build_Alteration_Info::K2Node_Select_Default' has a wrong offset!");

// Function ItemTooltipContent.ItemTooltipContent_C.Build Durability
// 0x00B0 (0x00B0 - 0x0000)
struct ItemTooltipContent_C_Build_Durability final
{
public:
	class UFortTooltipUIContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTooltipContext*                    CallFunc_Init_Tooltip_Context_Tooltip_Context;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTooltipDurabilityMeter_C*              CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTooltipNumericValue_Value;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTooltipNumericValue_ReturnValue;       // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDisplayAttribute                  CallFunc_GetTooltipStat_OutDisplayAttribute;       // 0x0028(0x0070)()
	bool                                          CallFunc_GetTooltipStat_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBox*                           K2Node_Select_Default;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTooltipContent_C_Build_Durability) == 0x000008, "Wrong alignment on ItemTooltipContent_C_Build_Durability");
static_assert(sizeof(ItemTooltipContent_C_Build_Durability) == 0x0000B0, "Wrong size on ItemTooltipContent_C_Build_Durability");
static_assert(offsetof(ItemTooltipContent_C_Build_Durability, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'ItemTooltipContent_C_Build_Durability::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Durability, CallFunc_Init_Tooltip_Context_Tooltip_Context) == 0x000008, "Member 'ItemTooltipContent_C_Build_Durability::CallFunc_Init_Tooltip_Context_Tooltip_Context' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Durability, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'ItemTooltipContent_C_Build_Durability::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Durability, CallFunc_Create_ReturnValue) == 0x000018, "Member 'ItemTooltipContent_C_Build_Durability::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Durability, CallFunc_GetTooltipNumericValue_Value) == 0x000020, "Member 'ItemTooltipContent_C_Build_Durability::CallFunc_GetTooltipNumericValue_Value' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Durability, CallFunc_GetTooltipNumericValue_ReturnValue) == 0x000024, "Member 'ItemTooltipContent_C_Build_Durability::CallFunc_GetTooltipNumericValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Durability, CallFunc_GetTooltipStat_OutDisplayAttribute) == 0x000028, "Member 'ItemTooltipContent_C_Build_Durability::CallFunc_GetTooltipStat_OutDisplayAttribute' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Durability, CallFunc_GetTooltipStat_ReturnValue) == 0x000098, "Member 'ItemTooltipContent_C_Build_Durability::CallFunc_GetTooltipStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Durability, Temp_bool_Variable) == 0x000099, "Member 'ItemTooltipContent_C_Build_Durability::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Durability, K2Node_Select_Default) == 0x0000A0, "Member 'ItemTooltipContent_C_Build_Durability::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Durability, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000A8, "Member 'ItemTooltipContent_C_Build_Durability::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function ItemTooltipContent.ItemTooltipContent_C.Build Basic Stat Block
// 0x0108 (0x0108 - 0x0000)
struct ItemTooltipContent_C_Build_Basic_Stat_Block final
{
public:
	TArray<struct FFortDisplayAttribute>          StatArray;                                         // 0x0000(0x0010)(Edit, ZeroConstructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTooltipUIContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortDisplayAttribute                  CallFunc_Array_Get_Item;                           // 0x0028(0x0070)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTooltip_DisplayAttribute_C*            CallFunc_Create_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           K2Node_Select_Default;                             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTooltipContext*                    CallFunc_SpawnTooltipContextWithSource_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortDisplayAttribute>          CallFunc_GetTooltipStats_ReturnValue;              // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFortDisplayAttribute>          CallFunc_GetUpgradeStats_ReturnValue;              // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFortDisplayAttribute>          CallFunc_GetComparisonStats_ReturnValue;           // 0x00F8(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(ItemTooltipContent_C_Build_Basic_Stat_Block) == 0x000008, "Wrong alignment on ItemTooltipContent_C_Build_Basic_Stat_Block");
static_assert(sizeof(ItemTooltipContent_C_Build_Basic_Stat_Block) == 0x000108, "Wrong size on ItemTooltipContent_C_Build_Basic_Stat_Block");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, StatArray) == 0x000000, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::StatArray' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, Temp_int_Array_Index_Variable) == 0x000010, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, CallFunc_Array_Get_Item) == 0x000028, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, K2Node_SwitchEnum_CmpSuccess) == 0x00009D, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000A0, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, Temp_bool_Variable) == 0x0000A8, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, CallFunc_Create_ReturnValue) == 0x0000B0, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, K2Node_Select_Default) == 0x0000B8, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000C0, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, CallFunc_GetPlayerController_ReturnValue) == 0x0000C8, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, CallFunc_SpawnTooltipContextWithSource_ReturnValue) == 0x0000D0, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::CallFunc_SpawnTooltipContextWithSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, CallFunc_GetTooltipStats_ReturnValue) == 0x0000D8, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::CallFunc_GetTooltipStats_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, CallFunc_GetUpgradeStats_ReturnValue) == 0x0000E8, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::CallFunc_GetUpgradeStats_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Build_Basic_Stat_Block, CallFunc_GetComparisonStats_ReturnValue) == 0x0000F8, "Member 'ItemTooltipContent_C_Build_Basic_Stat_Block::CallFunc_GetComparisonStats_ReturnValue' has a wrong offset!");

// Function ItemTooltipContent.ItemTooltipContent_C.Set Display Name Text
// 0x0098 (0x0098 - 0x0000)
struct ItemTooltipContent_C_Set_Display_Name_Text final
{
public:
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0000(0x0018)()
	class FText                                   CallFunc_TextTrimPrecedingAndTrailing_ReturnValue; // 0x0018(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0018)()
};
static_assert(alignof(ItemTooltipContent_C_Set_Display_Name_Text) == 0x000008, "Wrong alignment on ItemTooltipContent_C_Set_Display_Name_Text");
static_assert(sizeof(ItemTooltipContent_C_Set_Display_Name_Text) == 0x000098, "Wrong size on ItemTooltipContent_C_Set_Display_Name_Text");
static_assert(offsetof(ItemTooltipContent_C_Set_Display_Name_Text, CallFunc_GetDisplayName_ReturnValue) == 0x000000, "Member 'ItemTooltipContent_C_Set_Display_Name_Text::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Display_Name_Text, CallFunc_TextTrimPrecedingAndTrailing_ReturnValue) == 0x000018, "Member 'ItemTooltipContent_C_Set_Display_Name_Text::CallFunc_TextTrimPrecedingAndTrailing_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Display_Name_Text, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'ItemTooltipContent_C_Set_Display_Name_Text::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Display_Name_Text, K2Node_MakeArray_Array) == 0x000070, "Member 'ItemTooltipContent_C_Set_Display_Name_Text::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Display_Name_Text, CallFunc_Format_ReturnValue) == 0x000080, "Member 'ItemTooltipContent_C_Set_Display_Name_Text::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function ItemTooltipContent.ItemTooltipContent_C.Set Primary Category Text
// 0x0028 (0x0028 - 0x0000)
struct ItemTooltipContent_C_Set_Primary_Category_Text final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPrimaryCategory_ItemCategoryText;      // 0x0008(0x0018)()
	bool                                          CallFunc_GetPrimaryCategory_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemTooltipContent_C_Set_Primary_Category_Text) == 0x000008, "Wrong alignment on ItemTooltipContent_C_Set_Primary_Category_Text");
static_assert(sizeof(ItemTooltipContent_C_Set_Primary_Category_Text) == 0x000028, "Wrong size on ItemTooltipContent_C_Set_Primary_Category_Text");
static_assert(offsetof(ItemTooltipContent_C_Set_Primary_Category_Text, Temp_byte_Variable) == 0x000000, "Member 'ItemTooltipContent_C_Set_Primary_Category_Text::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Primary_Category_Text, Temp_byte_Variable2) == 0x000001, "Member 'ItemTooltipContent_C_Set_Primary_Category_Text::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Primary_Category_Text, Temp_bool_Variable) == 0x000002, "Member 'ItemTooltipContent_C_Set_Primary_Category_Text::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Primary_Category_Text, CallFunc_GetPrimaryCategory_ItemCategoryText) == 0x000008, "Member 'ItemTooltipContent_C_Set_Primary_Category_Text::CallFunc_GetPrimaryCategory_ItemCategoryText' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Primary_Category_Text, CallFunc_GetPrimaryCategory_ReturnValue) == 0x000020, "Member 'ItemTooltipContent_C_Set_Primary_Category_Text::CallFunc_GetPrimaryCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Primary_Category_Text, K2Node_Select_Default) == 0x000021, "Member 'ItemTooltipContent_C_Set_Primary_Category_Text::K2Node_Select_Default' has a wrong offset!");

// Function ItemTooltipContent.ItemTooltipContent_C.Set Secondary Category Icon & Text
// 0x00B8 (0x00B8 - 0x0000)
struct ItemTooltipContent_C_Set_Secondary_Category_Icon___Text final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortBrushSize                                Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBrushSize                                Temp_byte_Variable3;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortBrushSize                                K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSecondaryCategory_ItemCategoryText;    // 0x0008(0x0018)()
	struct FSlateBrush                            CallFunc_GetSecondaryCategory_ItemCategoryBrush;   // 0x0020(0x0090)()
	bool                                          CallFunc_GetSecondaryCategory_ReturnValue;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemTooltipContent_C_Set_Secondary_Category_Icon___Text) == 0x000008, "Wrong alignment on ItemTooltipContent_C_Set_Secondary_Category_Icon___Text");
static_assert(sizeof(ItemTooltipContent_C_Set_Secondary_Category_Icon___Text) == 0x0000B8, "Wrong size on ItemTooltipContent_C_Set_Secondary_Category_Icon___Text");
static_assert(offsetof(ItemTooltipContent_C_Set_Secondary_Category_Icon___Text, Temp_byte_Variable) == 0x000000, "Member 'ItemTooltipContent_C_Set_Secondary_Category_Icon___Text::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Secondary_Category_Icon___Text, Temp_bool_Variable) == 0x000001, "Member 'ItemTooltipContent_C_Set_Secondary_Category_Icon___Text::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Secondary_Category_Icon___Text, Temp_byte_Variable2) == 0x000002, "Member 'ItemTooltipContent_C_Set_Secondary_Category_Icon___Text::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Secondary_Category_Icon___Text, Temp_byte_Variable3) == 0x000003, "Member 'ItemTooltipContent_C_Set_Secondary_Category_Icon___Text::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Secondary_Category_Icon___Text, Temp_byte_Variable4) == 0x000004, "Member 'ItemTooltipContent_C_Set_Secondary_Category_Icon___Text::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Secondary_Category_Icon___Text, Temp_bool_Variable2) == 0x000005, "Member 'ItemTooltipContent_C_Set_Secondary_Category_Icon___Text::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Secondary_Category_Icon___Text, K2Node_Select_Default) == 0x000006, "Member 'ItemTooltipContent_C_Set_Secondary_Category_Icon___Text::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Secondary_Category_Icon___Text, CallFunc_GetSecondaryCategory_ItemCategoryText) == 0x000008, "Member 'ItemTooltipContent_C_Set_Secondary_Category_Icon___Text::CallFunc_GetSecondaryCategory_ItemCategoryText' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Secondary_Category_Icon___Text, CallFunc_GetSecondaryCategory_ItemCategoryBrush) == 0x000020, "Member 'ItemTooltipContent_C_Set_Secondary_Category_Icon___Text::CallFunc_GetSecondaryCategory_ItemCategoryBrush' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Secondary_Category_Icon___Text, CallFunc_GetSecondaryCategory_ReturnValue) == 0x0000B0, "Member 'ItemTooltipContent_C_Set_Secondary_Category_Icon___Text::CallFunc_GetSecondaryCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Secondary_Category_Icon___Text, K2Node_Select2_Default) == 0x0000B1, "Member 'ItemTooltipContent_C_Set_Secondary_Category_Icon___Text::K2Node_Select2_Default' has a wrong offset!");

// Function ItemTooltipContent.ItemTooltipContent_C.Set Tertiary Category Icon & Text
// 0x00B8 (0x00B8 - 0x0000)
struct ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortBrushSize                                Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBrushSize                                Temp_byte_Variable3;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortBrushSize                                K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTertiaryCategory_ItemCategoryText;     // 0x0008(0x0018)()
	struct FSlateBrush                            CallFunc_GetTertiaryCategory_ItemCategoryBrush;    // 0x0020(0x0090)()
	bool                                          CallFunc_GetTertiaryCategory_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text) == 0x000008, "Wrong alignment on ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text");
static_assert(sizeof(ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text) == 0x0000B8, "Wrong size on ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text");
static_assert(offsetof(ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text, Temp_byte_Variable) == 0x000000, "Member 'ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text, Temp_bool_Variable) == 0x000001, "Member 'ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text, Temp_byte_Variable2) == 0x000002, "Member 'ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text, Temp_byte_Variable3) == 0x000003, "Member 'ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text, Temp_byte_Variable4) == 0x000004, "Member 'ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text, Temp_bool_Variable2) == 0x000005, "Member 'ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text, K2Node_Select_Default) == 0x000006, "Member 'ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text, CallFunc_GetTertiaryCategory_ItemCategoryText) == 0x000008, "Member 'ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text::CallFunc_GetTertiaryCategory_ItemCategoryText' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text, CallFunc_GetTertiaryCategory_ItemCategoryBrush) == 0x000020, "Member 'ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text::CallFunc_GetTertiaryCategory_ItemCategoryBrush' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text, CallFunc_GetTertiaryCategory_ReturnValue) == 0x0000B0, "Member 'ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text::CallFunc_GetTertiaryCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text, K2Node_Select2_Default) == 0x0000B1, "Member 'ItemTooltipContent_C_Set_Tertiary_Category_Icon___Text::K2Node_Select2_Default' has a wrong offset!");

// Function ItemTooltipContent.ItemTooltipContent_C.Set Tier
// 0x0080 (0x0080 - 0x0000)
struct ItemTooltipContent_C_Set_Tier final
{
public:
	int32                                         MaxTier;                                           // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentTier;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         ActiveBox;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasTier;                                           // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0018(0x0010)(NoDestructor)
	EFortItemTier                                 CallFunc_GetMaxTier_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemTier                                 CallFunc_GetTier_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Convert_Tier_To_Integer_Numeric_Tier;     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Convert_Tier_To_Integer_Numeric_Tier2;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItem_TierStar_C*                       CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         K2Node_Select2_Default;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemTier                                 CallFunc_GetTier_ReturnValue2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select3_Default;                            // 0x006C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTooltipContent_C_Set_Tier) == 0x000008, "Wrong alignment on ItemTooltipContent_C_Set_Tier");
static_assert(sizeof(ItemTooltipContent_C_Set_Tier) == 0x000080, "Wrong size on ItemTooltipContent_C_Set_Tier");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, MaxTier) == 0x000000, "Member 'ItemTooltipContent_C_Set_Tier::MaxTier' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, CurrentTier) == 0x000004, "Member 'ItemTooltipContent_C_Set_Tier::CurrentTier' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, ActiveBox) == 0x000008, "Member 'ItemTooltipContent_C_Set_Tier::ActiveBox' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, HasTier) == 0x000010, "Member 'ItemTooltipContent_C_Set_Tier::HasTier' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, Temp_bool_Variable) == 0x000011, "Member 'ItemTooltipContent_C_Set_Tier::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, Temp_bool_Variable2) == 0x000012, "Member 'ItemTooltipContent_C_Set_Tier::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, Temp_byte_Variable) == 0x000013, "Member 'ItemTooltipContent_C_Set_Tier::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, Temp_byte_Variable2) == 0x000014, "Member 'ItemTooltipContent_C_Set_Tier::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, K2Node_Select_Default) == 0x000015, "Member 'ItemTooltipContent_C_Set_Tier::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, K2Node_MakeStruct_Margin) == 0x000018, "Member 'ItemTooltipContent_C_Set_Tier::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, CallFunc_GetMaxTier_ReturnValue) == 0x000028, "Member 'ItemTooltipContent_C_Set_Tier::CallFunc_GetMaxTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, CallFunc_GetTier_ReturnValue) == 0x000029, "Member 'ItemTooltipContent_C_Set_Tier::CallFunc_GetTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, CallFunc_Convert_Tier_To_Integer_Numeric_Tier) == 0x00002C, "Member 'ItemTooltipContent_C_Set_Tier::CallFunc_Convert_Tier_To_Integer_Numeric_Tier' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, CallFunc_Convert_Tier_To_Integer_Numeric_Tier2) == 0x000030, "Member 'ItemTooltipContent_C_Set_Tier::CallFunc_Convert_Tier_To_Integer_Numeric_Tier2' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'ItemTooltipContent_C_Set_Tier::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, CallFunc_Create_ReturnValue) == 0x000040, "Member 'ItemTooltipContent_C_Set_Tier::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000048, "Member 'ItemTooltipContent_C_Set_Tier::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, CallFunc_Max_ReturnValue) == 0x000050, "Member 'ItemTooltipContent_C_Set_Tier::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, Temp_int_Variable) == 0x000054, "Member 'ItemTooltipContent_C_Set_Tier::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000058, "Member 'ItemTooltipContent_C_Set_Tier::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x000059, "Member 'ItemTooltipContent_C_Set_Tier::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'ItemTooltipContent_C_Set_Tier::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, K2Node_Select2_Default) == 0x000060, "Member 'ItemTooltipContent_C_Set_Tier::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, CallFunc_GetTier_ReturnValue2) == 0x000068, "Member 'ItemTooltipContent_C_Set_Tier::CallFunc_GetTier_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000069, "Member 'ItemTooltipContent_C_Set_Tier::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, Temp_bool_Variable3) == 0x00006A, "Member 'ItemTooltipContent_C_Set_Tier::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(ItemTooltipContent_C_Set_Tier, K2Node_Select3_Default) == 0x00006C, "Member 'ItemTooltipContent_C_Set_Tier::K2Node_Select3_Default' has a wrong offset!");

// Function ItemTooltipContent.ItemTooltipContent_C.Set Level Text
// 0x0180 (0x0180 - 0x0000)
struct ItemTooltipContent_C_Set_Level_Text final
{
public:
	int32                                         CompareMaxLevel;                                   // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CompareLevel;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasLevel;                                          // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBox*                           ActiveBox;                                         // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxLevel;                                          // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentLevel;                                      // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxLevel_ReturnValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDisplayAttribute                  CallFunc_Create_Custom_Integer_Stat_Display_Attribute; // 0x0038(0x0070)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTooltip_DisplayAttribute_C*            CallFunc_Create_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00C4(0x0010)(NoDestructor)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
