#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemInspectEvolutionChoiceEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemInspectEvolutionChoiceEntry.ItemInspectEvolutionChoiceEntry_C
// 0x0070 (0x02A8 - 0x0238)
class UItemInspectEvolutionChoiceEntry_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UOverlay*                               DisabledOverlay;                                   // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 ItemCard;                                          // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         PanelButton;                                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnEvolutionChoiceHovered;                          // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnEvolutionChoiceUnhovered;                        // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnEvolutionChoiceSelected;                         // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UFortItem*                              ItemRepresented;                                   // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RecipeIndexRepresented;                            // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemInspectEvolutionChoiceEntry(int32 EntryPoint);
	void BndEvt__PanelButton_K2Node_ComponentBoundEvent_30_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__PanelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__PanelButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__PanelButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetItemToRepresent(class UFortItem* Item, int32 RecipeIndex, bool EnabledChoice);
	void DoDesignTimeRandomization();
	void SelectEvolutionChoice();
	void UnselectEvolutionChoice();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemInspectEvolutionChoiceEntry_C">();
	}
	static class UItemInspectEvolutionChoiceEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemInspectEvolutionChoiceEntry_C>();
	}
};
static_assert(alignof(UItemInspectEvolutionChoiceEntry_C) == 0x000008, "Wrong alignment on UItemInspectEvolutionChoiceEntry_C");
static_assert(sizeof(UItemInspectEvolutionChoiceEntry_C) == 0x0002A8, "Wrong size on UItemInspectEvolutionChoiceEntry_C");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, UberGraphFrame) == 0x000238, "Member 'UItemInspectEvolutionChoiceEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, DisabledOverlay) == 0x000240, "Member 'UItemInspectEvolutionChoiceEntry_C::DisabledOverlay' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, Image_0) == 0x000248, "Member 'UItemInspectEvolutionChoiceEntry_C::Image_0' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, Image_1) == 0x000250, "Member 'UItemInspectEvolutionChoiceEntry_C::Image_1' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, ItemCard) == 0x000258, "Member 'UItemInspectEvolutionChoiceEntry_C::ItemCard' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, PanelButton) == 0x000260, "Member 'UItemInspectEvolutionChoiceEntry_C::PanelButton' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, OnEvolutionChoiceHovered) == 0x000268, "Member 'UItemInspectEvolutionChoiceEntry_C::OnEvolutionChoiceHovered' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, OnEvolutionChoiceUnhovered) == 0x000278, "Member 'UItemInspectEvolutionChoiceEntry_C::OnEvolutionChoiceUnhovered' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, OnEvolutionChoiceSelected) == 0x000288, "Member 'UItemInspectEvolutionChoiceEntry_C::OnEvolutionChoiceSelected' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, ItemRepresented) == 0x000298, "Member 'UItemInspectEvolutionChoiceEntry_C::ItemRepresented' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, RecipeIndexRepresented) == 0x0002A0, "Member 'UItemInspectEvolutionChoiceEntry_C::RecipeIndexRepresented' has a wrong offset!");

}

