#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemManagementDetailsModeBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_structs.hpp"


namespace SDK::Params
{

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.ExecuteUbergraph_ItemManagementDetailsModeBox
// 0x0088 (0x0088 - 0x0000)
struct ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId4;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton4;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId3;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton3;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId2;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton2;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_ActiveWidget;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ActiveWidgetIndex;      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDetailsHostPanel*              K2Node_DynamicCast_AsFort_Item_Details_Host_Panel; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDetailsHostPanel*              K2Node_DynamicCast_AsFort_Item_Details_Host_Panel2; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox");
static_assert(sizeof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox) == 0x000088, "Wrong size on ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, EntryPoint) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_TabId) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_TabButton) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_TabId4) == 0x000018, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_TabId4' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_TabButton4) == 0x000020, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_TabButton4' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_TabId3) == 0x000028, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_TabId3' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_TabButton3) == 0x000030, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_TabButton3' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_TabId2) == 0x000038, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_TabId2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_TabButton2) == 0x000040, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_TabButton2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_ActiveWidget) == 0x000050, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_ActiveWidget' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_ActiveWidgetIndex) == 0x000058, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_ActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_DynamicCast_AsFort_Item_Details_Host_Panel) == 0x000060, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_DynamicCast_AsFort_Item_Details_Host_Panel' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x00006C, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x000070, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_DynamicCast_AsFort_Item_Details_Host_Panel2) == 0x000078, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_DynamicCast_AsFort_Item_Details_Host_Panel2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_DynamicCast_bSuccess2) == 0x000080, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.BndEvt__DetailPanelTabList-MSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_MSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_MSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_MSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_MSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_MSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_MSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_MSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_MSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_MSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.BndEvt__DetailPanelTabList-OI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.BndEvt__DetailPanelTabList-OP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.BndEvt__DetailPanelTabList-OPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabList_OPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature final
{
public:
	class UWidget*                                ActiveWidget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveWidgetIndex;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature");
static_assert(sizeof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature) == 0x000010, "Wrong size on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature, ActiveWidget) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature::ActiveWidget' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature, ActiveWidgetIndex) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature::ActiveWidgetIndex' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.HandleClose
// 0x0018 (0x0018 - 0x0000)
struct ItemManagementDetailsModeBox_C_HandleClose final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemManagementScreen_C*                K2Node_DynamicCast_AsItem_Management_Screen;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_HandleClose) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_HandleClose");
static_assert(sizeof(ItemManagementDetailsModeBox_C_HandleClose) == 0x000018, "Wrong size on ItemManagementDetailsModeBox_C_HandleClose");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleClose, PassThrough) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_HandleClose::PassThrough' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleClose, K2Node_DynamicCast_AsItem_Management_Screen) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_HandleClose::K2Node_DynamicCast_AsItem_Management_Screen' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleClose, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_HandleClose::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.HandleInspect
// 0x0001 (0x0001 - 0x0000)
struct ItemManagementDetailsModeBox_C_HandleInspect final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_HandleInspect) == 0x000001, "Wrong alignment on ItemManagementDetailsModeBox_C_HandleInspect");
static_assert(sizeof(ItemManagementDetailsModeBox_C_HandleInspect) == 0x000001, "Wrong size on ItemManagementDetailsModeBox_C_HandleInspect");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleInspect, PassThrough) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_HandleInspect::PassThrough' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.HandleCompare
// 0x0002 (0x0002 - 0x0000)
struct ItemManagementDetailsModeBox_C_HandleCompare final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_HandleCompare) == 0x000001, "Wrong alignment on ItemManagementDetailsModeBox_C_HandleCompare");
static_assert(sizeof(ItemManagementDetailsModeBox_C_HandleCompare) == 0x000002, "Wrong size on ItemManagementDetailsModeBox_C_HandleCompare");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleCompare, PassThrough) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_HandleCompare::PassThrough' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleCompare, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'ItemManagementDetailsModeBox_C_HandleCompare::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.HandleMulch
// 0x0001 (0x0001 - 0x0000)
struct ItemManagementDetailsModeBox_C_HandleMulch final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_HandleMulch) == 0x000001, "Wrong alignment on ItemManagementDetailsModeBox_C_HandleMulch");
static_assert(sizeof(ItemManagementDetailsModeBox_C_HandleMulch) == 0x000001, "Wrong size on ItemManagementDetailsModeBox_C_HandleMulch");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleMulch, PassThrough) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_HandleMulch::PassThrough' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.HandleSort
// 0x0001 (0x0001 - 0x0000)
struct ItemManagementDetailsModeBox_C_HandleSort final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_HandleSort) == 0x000001, "Wrong alignment on ItemManagementDetailsModeBox_C_HandleSort");
static_assert(sizeof(ItemManagementDetailsModeBox_C_HandleSort) == 0x000001, "Wrong size on ItemManagementDetailsModeBox_C_HandleSort");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleSort, PassThrough) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_HandleSort::PassThrough' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.TrySetupInputHandling
// 0x0088 (0x0088 - 0x0000)
struct ItemManagementDetailsModeBox_C_TrySetupInputHandling final
{
public:
	TDelegate<void(bool bUsingGamepad)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EFortQuickBars QuickbarIndex)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<class UFortWorldItem*>& ItemsAdded, TArray<class UFortWorldItem*>& ItemsRemoved)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsSchematic_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue2;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue3;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCommonInputActionHandlerData>  CallFunc_GetInputActions_InputActionDataRows;      // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GetInputActions_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue4;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_TrySetupInputHandling) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_TrySetupInputHandling");
static_assert(sizeof(ItemManagementDetailsModeBox_C_TrySetupInputHandling) == 0x000088, "Wrong size on ItemManagementDetailsModeBox_C_TrySetupInputHandling");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, K2Node_CreateDelegate_OutputDelegate2) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, K2Node_CreateDelegate_OutputDelegate3) == 0x000020, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, K2Node_CreateDelegate_OutputDelegate4) == 0x000030, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, CallFunc_IsSchematic_ReturnValue) == 0x000040, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::CallFunc_IsSchematic_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, CallFunc_GetContext_ReturnValue) == 0x000048, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, CallFunc_GetContext_ReturnValue2) == 0x000050, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, CallFunc_GetContext_ReturnValue3) == 0x000058, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, CallFunc_GetInputActions_InputActionDataRows) == 0x000060, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::CallFunc_GetInputActions_InputActionDataRows' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, CallFunc_GetInputActions_ReturnValue) == 0x000070, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::CallFunc_GetInputActions_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, CallFunc_GetContext_ReturnValue4) == 0x000078, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, K2Node_SwitchEnum_CmpSuccess) == 0x000080, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, K2Node_SwitchEnum2_CmpSuccess) == 0x000081, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000082, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.HandleConsumeItem
// 0x0058 (0x0058 - 0x0000)
struct ItemManagementDetailsModeBox_C_HandleConsumeItem final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBoostsRoot_C*                          CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue4;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConsumableAccountItem*             K2Node_DynamicCast_AsFort_Consumable_Account_Item; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanActivateOnOthers_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanActivateOnSelf_ReturnValue;            // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_HandleConsumeItem) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_HandleConsumeItem");
static_assert(sizeof(ItemManagementDetailsModeBox_C_HandleConsumeItem) == 0x000058, "Wrong size on ItemManagementDetailsModeBox_C_HandleConsumeItem");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, PassThrough) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::PassThrough' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_GetInputManager_ReturnValue) == 0x000018, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_GetContext_ReturnValue3) == 0x000028, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_Create_ReturnValue) == 0x000030, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_IsInZone_ReturnValue) == 0x000038, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_GetContext_ReturnValue4) == 0x000040, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, K2Node_DynamicCast_AsFort_Consumable_Account_Item) == 0x000048, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::K2Node_DynamicCast_AsFort_Consumable_Account_Item' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_CanActivateOnOthers_ReturnValue) == 0x000051, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_CanActivateOnOthers_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_CanActivateOnSelf_ReturnValue) == 0x000052, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_CanActivateOnSelf_ReturnValue' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.HandleCraft
// 0x0018 (0x0018 - 0x0000)
struct ItemManagementDetailsModeBox_C_HandleCraft final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSchematicItem*                     K2Node_DynamicCast_AsFort_Schematic_Item;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_HandleCraft) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_HandleCraft");
static_assert(sizeof(ItemManagementDetailsModeBox_C_HandleCraft) == 0x000018, "Wrong size on ItemManagementDetailsModeBox_C_HandleCraft");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleCraft, PassThrough) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_HandleCraft::PassThrough' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleCraft, K2Node_DynamicCast_AsFort_Schematic_Item) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_HandleCraft::K2Node_DynamicCast_AsFort_Schematic_Item' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleCraft, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_HandleCraft::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.ShowSelection
// 0x0001 (0x0001 - 0x0000)
struct ItemManagementDetailsModeBox_C_ShowSelection final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_ShowSelection) == 0x000001, "Wrong alignment on ItemManagementDetailsModeBox_C_ShowSelection");
static_assert(sizeof(ItemManagementDetailsModeBox_C_ShowSelection) == 0x000001, "Wrong size on ItemManagementDetailsModeBox_C_ShowSelection");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ShowSelection, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_ShowSelection::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.HandleDrop
// 0x0030 (0x0030 - 0x0000)
struct ItemManagementDetailsModeBox_C_HandleDrop final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 ChosenValue, class UFortItem* FortItem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UFortWorldItem*                         K2Node_DynamicCast_AsFort_World_Item;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumInStack_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_HandleDrop) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_HandleDrop");
static_assert(sizeof(ItemManagementDetailsModeBox_C_HandleDrop) == 0x000030, "Wrong size on ItemManagementDetailsModeBox_C_HandleDrop");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleDrop, PassThrough) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_HandleDrop::PassThrough' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleDrop, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_HandleDrop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleDrop, K2Node_DynamicCast_AsFort_World_Item) == 0x000018, "Member 'ItemManagementDetailsModeBox_C_HandleDrop::K2Node_DynamicCast_AsFort_World_Item' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleDrop, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ItemManagementDetailsModeBox_C_HandleDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleDrop, CallFunc_GetNumInStack_ReturnValue) == 0x000024, "Member 'ItemManagementDetailsModeBox_C_HandleDrop::CallFunc_GetNumInStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleDrop, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'ItemManagementDetailsModeBox_C_HandleDrop::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.RegisterDrop
// 0x0020 (0x0020 - 0x0000)
struct ItemManagementDetailsModeBox_C_RegisterDrop final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_RegisterDrop) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_RegisterDrop");
static_assert(sizeof(ItemManagementDetailsModeBox_C_RegisterDrop) == 0x000020, "Wrong size on ItemManagementDetailsModeBox_C_RegisterDrop");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterDrop, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_RegisterDrop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterDrop, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_RegisterDrop::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.RegisterCraft
// 0x0050 (0x0050 - 0x0000)
struct ItemManagementDetailsModeBox_C_RegisterCraft final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<class UFortWorldItem*>& ItemsAdded, TArray<class UFortWorldItem*>& ItemsRemoved)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate3;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0040(0x0010)(NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_RegisterCraft) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_RegisterCraft");
static_assert(sizeof(ItemManagementDetailsModeBox_C_RegisterCraft) == 0x000050, "Wrong size on ItemManagementDetailsModeBox_C_RegisterCraft");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterCraft, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_RegisterCraft::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterCraft, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_RegisterCraft::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterCraft, CallFunc_GetContext_ReturnValue2) == 0x000018, "Member 'ItemManagementDetailsModeBox_C_RegisterCraft::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterCraft, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'ItemManagementDetailsModeBox_C_RegisterCraft::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterCraft, K2Node_CreateDelegate_OutputDelegate3) == 0x000030, "Member 'ItemManagementDetailsModeBox_C_RegisterCraft::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterCraft, K2Node_MakeStruct_DataTableRowHandle) == 0x000040, "Member 'ItemManagementDetailsModeBox_C_RegisterCraft::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.RegisterMulch
// 0x0020 (0x0020 - 0x0000)
struct ItemManagementDetailsModeBox_C_RegisterMulch final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_RegisterMulch) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_RegisterMulch");
static_assert(sizeof(ItemManagementDetailsModeBox_C_RegisterMulch) == 0x000020, "Wrong size on ItemManagementDetailsModeBox_C_RegisterMulch");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterMulch, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_RegisterMulch::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterMulch, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_RegisterMulch::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.RegisterRetire
// 0x0020 (0x0020 - 0x0000)
struct ItemManagementDetailsModeBox_C_RegisterRetire final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_RegisterRetire) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_RegisterRetire");
static_assert(sizeof(ItemManagementDetailsModeBox_C_RegisterRetire) == 0x000020, "Wrong size on ItemManagementDetailsModeBox_C_RegisterRetire");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterRetire, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_RegisterRetire::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterRetire, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_RegisterRetire::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.RegisterInspect
// 0x0020 (0x0020 - 0x0000)
struct ItemManagementDetailsModeBox_C_RegisterInspect final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_RegisterInspect) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_RegisterInspect");
static_assert(sizeof(ItemManagementDetailsModeBox_C_RegisterInspect) == 0x000020, "Wrong size on ItemManagementDetailsModeBox_C_RegisterInspect");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterInspect, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_RegisterInspect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterInspect, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_RegisterInspect::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.RegisterBack
// 0x0020 (0x0020 - 0x0000)
struct ItemManagementDetailsModeBox_C_RegisterBack final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_RegisterBack) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_RegisterBack");
static_assert(sizeof(ItemManagementDetailsModeBox_C_RegisterBack) == 0x000020, "Wrong size on ItemManagementDetailsModeBox_C_RegisterBack");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterBack, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_RegisterBack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterBack, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_RegisterBack::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.RegisterSort
// 0x0048 (0x0048 - 0x0000)
struct ItemManagementDetailsModeBox_C_RegisterSort final
{
public:
	bool                                          InGame;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0008(0x0010)(NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle2;             // 0x0028(0x0010)(NoDestructor)
	struct FDataTableRowHandle                    K2Node_Select_Default;                             // 0x0038(0x0010)(NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_RegisterSort) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_RegisterSort");
static_assert(sizeof(ItemManagementDetailsModeBox_C_RegisterSort) == 0x000048, "Wrong size on ItemManagementDetailsModeBox_C_RegisterSort");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterSort, InGame) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_RegisterSort::InGame' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterSort, Temp_bool_Variable) == 0x000001, "Member 'ItemManagementDetailsModeBox_C_RegisterSort::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterSort, K2Node_MakeStruct_DataTableRowHandle) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_RegisterSort::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterSort, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'ItemManagementDetailsModeBox_C_RegisterSort::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterSort, K2Node_MakeStruct_DataTableRowHandle2) == 0x000028, "Member 'ItemManagementDetailsModeBox_C_RegisterSort::K2Node_MakeStruct_DataTableRowHandle2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterSort, K2Node_Select_Default) == 0x000038, "Member 'ItemManagementDetailsModeBox_C_RegisterSort::K2Node_Select_Default' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.RegisterConsumeItem
// 0x0020 (0x0020 - 0x0000)
struct ItemManagementDetailsModeBox_C_RegisterConsumeItem final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_RegisterConsumeItem) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_RegisterConsumeItem");
static_assert(sizeof(ItemManagementDetailsModeBox_C_RegisterConsumeItem) == 0x000020, "Wrong size on ItemManagementDetailsModeBox_C_RegisterConsumeItem");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterConsumeItem, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_RegisterConsumeItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterConsumeItem, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_RegisterConsumeItem::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.RegisterCompare
// 0x0020 (0x0020 - 0x0000)
struct ItemManagementDetailsModeBox_C_RegisterCompare final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_RegisterCompare) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_RegisterCompare");
static_assert(sizeof(ItemManagementDetailsModeBox_C_RegisterCompare) == 0x000020, "Wrong size on ItemManagementDetailsModeBox_C_RegisterCompare");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterCompare, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_RegisterCompare::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterCompare, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_RegisterCompare::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.RegisterTrack
// 0x0020 (0x0020 - 0x0000)
struct ItemManagementDetailsModeBox_C_RegisterTrack final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
};
