#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaderboardRowWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LeaderboardRowWidget.LeaderboardRowWidget_C
// 0x0038 (0x08E8 - 0x08B0)
class ULeaderboardRowWidget_C final : public UFortLeaderboardEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08B0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Image_4;                                           // 0x08B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               QuestIconOverlay;                                  // 0x08C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QuestTreeIcon;                                     // 0x08C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Rank;                                              // 0x08D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StatValue;                                         // 0x08D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       User;                                              // 0x08E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LeaderboardRowWidget(int32 EntryPoint);
	void OnLeaderboardEntryDataSet();
	void SetDataDirect(class UFortLeaderboardRowProxyInstance* NewData);
	void Refresh(class UFortLeaderboardRowProxyInstance* RowObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LeaderboardRowWidget_C">();
	}
	static class ULeaderboardRowWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaderboardRowWidget_C>();
	}
};
static_assert(alignof(ULeaderboardRowWidget_C) == 0x000008, "Wrong alignment on ULeaderboardRowWidget_C");
static_assert(sizeof(ULeaderboardRowWidget_C) == 0x0008E8, "Wrong size on ULeaderboardRowWidget_C");
static_assert(offsetof(ULeaderboardRowWidget_C, UberGraphFrame) == 0x0008B0, "Member 'ULeaderboardRowWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULeaderboardRowWidget_C, Image_4) == 0x0008B8, "Member 'ULeaderboardRowWidget_C::Image_4' has a wrong offset!");
static_assert(offsetof(ULeaderboardRowWidget_C, QuestIconOverlay) == 0x0008C0, "Member 'ULeaderboardRowWidget_C::QuestIconOverlay' has a wrong offset!");
static_assert(offsetof(ULeaderboardRowWidget_C, QuestTreeIcon) == 0x0008C8, "Member 'ULeaderboardRowWidget_C::QuestTreeIcon' has a wrong offset!");
static_assert(offsetof(ULeaderboardRowWidget_C, Rank) == 0x0008D0, "Member 'ULeaderboardRowWidget_C::Rank' has a wrong offset!");
static_assert(offsetof(ULeaderboardRowWidget_C, StatValue) == 0x0008D8, "Member 'ULeaderboardRowWidget_C::StatValue' has a wrong offset!");
static_assert(offsetof(ULeaderboardRowWidget_C, User) == 0x0008E0, "Member 'ULeaderboardRowWidget_C::User' has a wrong offset!");

}

