#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LegacyItem_DO_NOT_USE

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "ItemTextureSet_structs.hpp"
#include "Engine_structs.hpp"
#include "ItemDisplayStyle_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "ItemDisplayMode_structs.hpp"
#include "ItemTextureStylesheet_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C
// 0x1508 (0x1DA8 - 0x08A0)
class ULegacyItem_DO_NOT_USE_C final : public UFortItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08A0(0x0008)(Transient, DuplicateTransient)
	class UBorder*                                Border_SecondaryIconFill;                          // 0x08A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_SecondaryIconFrame;                         // 0x08B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_TertiaryIconFill;                           // 0x08B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_TertiaryIconFrame;                          // 0x08C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_SubtypeIcons;                        // 0x08C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BaseMaterial;                                // 0x08D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Chamfer;                                     // 0x08D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PrimaryIcon;                                 // 0x08E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SecondaryIcon;                               // 0x08E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TertiaryIcon;                                // 0x08F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x08F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_AmmoCounter;                                  // 0x0900(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_SubtypeIconsAmmoCount;                 // 0x0908(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemCooldownMeter_C*                   Widget_CooldownMeter;                              // 0x0910(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemDurabilityMeter_C*                 Widget_DurabilityMeter;                            // 0x0918(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULegacyRatingWidget_C*                  Widget_Rating;                                     // 0x0920(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemStackCounter_C*                    Widget_StackCounter;                               // 0x0928(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItem_TierBadge_C*                      Widget_TierBadge;                                  // 0x0930(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortRarityItemData                    RarityData;                                        // 0x0938(0x0080)(Edit, BlueprintVisible)
	bool                                          CanBeDragged;                                      // 0x09B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_9B9[0x7];                                      // 0x09B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DragTagString;                                     // 0x09C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UFortItem*                              ItemData;                                          // 0x09D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemDisplayMode                              DisplayMode;                                       // 0x09D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemDisplayStyle                             DisplayStyle;                                      // 0x09D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9DA[0x6];                                      // 0x09DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemTextureSet                        Item_Textures;                                     // 0x09E0(0x0A28)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FItemTextureStylesheet                 Item_Texture_Stylesheet;                           // 0x1408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FFortMultiSizeBrush                    Subtype_Icon_Frame;                                // 0x1418(0x0360)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortMultiSizeFont                     AmmoMultiFont;                                     // 0x1778(0x0270)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TooltipHeaderText;                                 // 0x19E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USlateBrushAsset*                       TooltipHeaderIcon;                                 // 0x1A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InfiniteAmmo;                                      // 0x1A08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A09[0x7];                                     // 0x1A09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    DemoItemData;                                      // 0x1A10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortMultiSizeBrush                    Subtype_Icon_Fill;                                 // 0x1A18(0x0360)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           Subtype_Fill_Color;                                // 0x1D78(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Subtype_Frame_Color;                               // 0x1D88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideSecondaryTypeIconColor;                    // 0x1D98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowSecondaryTypeIcon;                             // 0x1D99(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowTertiaryTypeIcon;                              // 0x1D9A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OverrideTertiaryTypeIconColor;                     // 0x1D9B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OverridePrimaryIconVisibility;                     // 0x1D9C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowStackCounter;                                  // 0x1D9D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          OverrideDisplayStyle;                              // 0x1D9E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowPrimaryIcon;                                   // 0x1D9F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDropOccured;                                      // 0x1DA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_LegacyItem_DO_NOT_USE(int32 EntryPoint);
	void BPOnActivatableChanged(bool bNewActivatable);
	void BPOnCooldownSecondsChanged(int32 NewCooldownSeconds);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
	void BPOnItemSet(class UFortItem* NewItem);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void BPOnItemChanged();
	void Update_Base_Material();
	void Set_Item_Data(class UFortItem* Item_Data);
	void Update_Stack_Counter();
	void Update_All();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	void Update_Size_Box();
	void Get_Item_Texture_Set(EItemDisplayStyle Display_Style, struct FItemTextureSet* Texture_Set);
	void Update_Primary_Icon();
	void Update_Tier_Badge();
	void Get_Display_Style(EFortItemType Item_Type, EItemDisplayStyle* Style_0);
	void Update_Subtype_Icons___Ammo();
	void Set_Ammo_Count(int32 Count);
	void Set_Display_Mode(EFortUIState Current_UI_State, bool Cursor_Mode);
	class UWidget* Get_Item_Tooltip(int32 OverrideStackCount);
	void Set_Tooltip_Header(const class FText& Header_Text, class USlateBrushAsset* Icon_Brush);
	void Update_Durability_Meter();
	void Update_Cooldown_Meter();
	void Set_Durability(float Durability);
	void Set_Stack_Count(int32 Count);
	void Refresh();
	void Resize(EFortBrushSize Brush_Size);
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent);
	void Set_Subtype_Icons___Ammo_Color(bool Override_Secondary_Icon_Color, const struct FLinearColor& Secondary_Icon_Override_Color, bool Override_Tertiary_Icon_Color, const struct FLinearColor& Tertiary_Icon_Override_Color);
	void Set_Primary_Icon_Visibility(bool Override_Icon_Visibility, ESlateVisibility Item_Icon_Visibility);
	void Hide_Subtype_Icons();
	void Set_Display_Style(bool Override_Display_Style, EItemDisplayStyle DisplayStyle_0);
	int32 Get_Num_in_Stack();
	void Get_Texture2D_From_Multi_Size_Brush(const struct FFortMultiSizeBrush& Multi_Size_Brush, EFortBrushSize Brush_Size, class UTexture2D** Texture2D, bool* Success);
	void Update_Rating_Tag();
	void Update_Activatable_State(bool Activatable);
	void Update_Base_Opacity();
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LegacyItem_DO_NOT_USE_C">();
	}
	static class ULegacyItem_DO_NOT_USE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyItem_DO_NOT_USE_C>();
	}
};
static_assert(alignof(ULegacyItem_DO_NOT_USE_C) == 0x000008, "Wrong alignment on ULegacyItem_DO_NOT_USE_C");
static_assert(sizeof(ULegacyItem_DO_NOT_USE_C) == 0x001DA8, "Wrong size on ULegacyItem_DO_NOT_USE_C");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, UberGraphFrame) == 0x0008A0, "Member 'ULegacyItem_DO_NOT_USE_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Border_SecondaryIconFill) == 0x0008A8, "Member 'ULegacyItem_DO_NOT_USE_C::Border_SecondaryIconFill' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Border_SecondaryIconFrame) == 0x0008B0, "Member 'ULegacyItem_DO_NOT_USE_C::Border_SecondaryIconFrame' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Border_TertiaryIconFill) == 0x0008B8, "Member 'ULegacyItem_DO_NOT_USE_C::Border_TertiaryIconFill' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Border_TertiaryIconFrame) == 0x0008C0, "Member 'ULegacyItem_DO_NOT_USE_C::Border_TertiaryIconFrame' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, HorizontalBox_SubtypeIcons) == 0x0008C8, "Member 'ULegacyItem_DO_NOT_USE_C::HorizontalBox_SubtypeIcons' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Image_BaseMaterial) == 0x0008D0, "Member 'ULegacyItem_DO_NOT_USE_C::Image_BaseMaterial' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Image_Chamfer) == 0x0008D8, "Member 'ULegacyItem_DO_NOT_USE_C::Image_Chamfer' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Image_PrimaryIcon) == 0x0008E0, "Member 'ULegacyItem_DO_NOT_USE_C::Image_PrimaryIcon' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Image_SecondaryIcon) == 0x0008E8, "Member 'ULegacyItem_DO_NOT_USE_C::Image_SecondaryIcon' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Image_TertiaryIcon) == 0x0008F0, "Member 'ULegacyItem_DO_NOT_USE_C::Image_TertiaryIcon' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, SizeBox) == 0x0008F8, "Member 'ULegacyItem_DO_NOT_USE_C::SizeBox' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Text_AmmoCounter) == 0x000900, "Member 'ULegacyItem_DO_NOT_USE_C::Text_AmmoCounter' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, VerticalBox_SubtypeIconsAmmoCount) == 0x000908, "Member 'ULegacyItem_DO_NOT_USE_C::VerticalBox_SubtypeIconsAmmoCount' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Widget_CooldownMeter) == 0x000910, "Member 'ULegacyItem_DO_NOT_USE_C::Widget_CooldownMeter' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Widget_DurabilityMeter) == 0x000918, "Member 'ULegacyItem_DO_NOT_USE_C::Widget_DurabilityMeter' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Widget_Rating) == 0x000920, "Member 'ULegacyItem_DO_NOT_USE_C::Widget_Rating' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Widget_StackCounter) == 0x000928, "Member 'ULegacyItem_DO_NOT_USE_C::Widget_StackCounter' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Widget_TierBadge) == 0x000930, "Member 'ULegacyItem_DO_NOT_USE_C::Widget_TierBadge' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, RarityData) == 0x000938, "Member 'ULegacyItem_DO_NOT_USE_C::RarityData' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, CanBeDragged) == 0x0009B8, "Member 'ULegacyItem_DO_NOT_USE_C::CanBeDragged' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, DragTagString) == 0x0009C0, "Member 'ULegacyItem_DO_NOT_USE_C::DragTagString' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, ItemData) == 0x0009D0, "Member 'ULegacyItem_DO_NOT_USE_C::ItemData' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, DisplayMode) == 0x0009D8, "Member 'ULegacyItem_DO_NOT_USE_C::DisplayMode' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, DisplayStyle) == 0x0009D9, "Member 'ULegacyItem_DO_NOT_USE_C::DisplayStyle' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Item_Textures) == 0x0009E0, "Member 'ULegacyItem_DO_NOT_USE_C::Item_Textures' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Item_Texture_Stylesheet) == 0x001408, "Member 'ULegacyItem_DO_NOT_USE_C::Item_Texture_Stylesheet' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Subtype_Icon_Frame) == 0x001418, "Member 'ULegacyItem_DO_NOT_USE_C::Subtype_Icon_Frame' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, AmmoMultiFont) == 0x001778, "Member 'ULegacyItem_DO_NOT_USE_C::AmmoMultiFont' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, TooltipHeaderText) == 0x0019E8, "Member 'ULegacyItem_DO_NOT_USE_C::TooltipHeaderText' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, TooltipHeaderIcon) == 0x001A00, "Member 'ULegacyItem_DO_NOT_USE_C::TooltipHeaderIcon' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, InfiniteAmmo) == 0x001A08, "Member 'ULegacyItem_DO_NOT_USE_C::InfiniteAmmo' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, DemoItemData) == 0x001A10, "Member 'ULegacyItem_DO_NOT_USE_C::DemoItemData' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Subtype_Icon_Fill) == 0x001A18, "Member 'ULegacyItem_DO_NOT_USE_C::Subtype_Icon_Fill' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Subtype_Fill_Color) == 0x001D78, "Member 'ULegacyItem_DO_NOT_USE_C::Subtype_Fill_Color' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, Subtype_Frame_Color) == 0x001D88, "Member 'ULegacyItem_DO_NOT_USE_C::Subtype_Frame_Color' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, OverrideSecondaryTypeIconColor) == 0x001D98, "Member 'ULegacyItem_DO_NOT_USE_C::OverrideSecondaryTypeIconColor' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, ShowSecondaryTypeIcon) == 0x001D99, "Member 'ULegacyItem_DO_NOT_USE_C::ShowSecondaryTypeIcon' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, ShowTertiaryTypeIcon) == 0x001D9A, "Member 'ULegacyItem_DO_NOT_USE_C::ShowTertiaryTypeIcon' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, OverrideTertiaryTypeIconColor) == 0x001D9B, "Member 'ULegacyItem_DO_NOT_USE_C::OverrideTertiaryTypeIconColor' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, OverridePrimaryIconVisibility) == 0x001D9C, "Member 'ULegacyItem_DO_NOT_USE_C::OverridePrimaryIconVisibility' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, ShowStackCounter) == 0x001D9D, "Member 'ULegacyItem_DO_NOT_USE_C::ShowStackCounter' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, OverrideDisplayStyle) == 0x001D9E, "Member 'ULegacyItem_DO_NOT_USE_C::OverrideDisplayStyle' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, ShowPrimaryIcon) == 0x001D9F, "Member 'ULegacyItem_DO_NOT_USE_C::ShowPrimaryIcon' has a wrong offset!");
static_assert(offsetof(ULegacyItem_DO_NOT_USE_C, bDropOccured) == 0x001DA0, "Member 'ULegacyItem_DO_NOT_USE_C::bDropOccured' has a wrong offset!");

}

