#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LegacyButtonIconText

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LegacyButtonIconText.LegacyButtonIconText_C
// 0x0108 (0x0970 - 0x0868)
class ULegacyButtonIconText_C final : public UFortBaseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0868(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Outro;                                        // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Intro;                                        // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentHBox;                                       // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               IconOverlay;                                       // 0x0890(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x0898(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x08A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x08A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DisplayText;                                       // 0x08B0(0x0018)(Edit, BlueprintVisible, Config, ExposeOnSpawn)
	struct FSlateBrush                            IconBrush;                                         // 0x08C8(0x0090)(Edit, BlueprintVisible, Config, ExposeOnSpawn)
	bool                                          HasIcon;                                           // 0x0958(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasText;                                           // 0x0959(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ETextJustify                                  Content_Align;                                     // 0x095A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95B[0x5];                                      // 0x095B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   On_Mouse_Hovered_Changed;                          // 0x0960(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_LegacyButtonIconText(int32 EntryPoint);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void Set_Text(const class FText& InText, bool RefreshPadding);
	void Set_Icon(const struct FSlateBrush& InBrush, bool RefreshPadding);
	void Update_Padding();
	struct FLinearColor Get_Secondary_Color();
	struct FSlateColor Get_Primary_Color();
	void Update_Size_Box();
	void Set_Alignment(ETextJustify Align);
	void Toggle(bool Show_Button);
	void Intro();
	void Outro();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LegacyButtonIconText_C">();
	}
	static class ULegacyButtonIconText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyButtonIconText_C>();
	}
};
static_assert(alignof(ULegacyButtonIconText_C) == 0x000008, "Wrong alignment on ULegacyButtonIconText_C");
static_assert(sizeof(ULegacyButtonIconText_C) == 0x000970, "Wrong size on ULegacyButtonIconText_C");
static_assert(offsetof(ULegacyButtonIconText_C, UberGraphFrame) == 0x000868, "Member 'ULegacyButtonIconText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, Anim_Outro) == 0x000870, "Member 'ULegacyButtonIconText_C::Anim_Outro' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, Anim_Intro) == 0x000878, "Member 'ULegacyButtonIconText_C::Anim_Intro' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, ContentHBox) == 0x000880, "Member 'ULegacyButtonIconText_C::ContentHBox' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, Icon) == 0x000888, "Member 'ULegacyButtonIconText_C::Icon' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, IconOverlay) == 0x000890, "Member 'ULegacyButtonIconText_C::IconOverlay' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, Shadow) == 0x000898, "Member 'ULegacyButtonIconText_C::Shadow' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, SizeBox) == 0x0008A0, "Member 'ULegacyButtonIconText_C::SizeBox' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, TextBlock) == 0x0008A8, "Member 'ULegacyButtonIconText_C::TextBlock' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, DisplayText) == 0x0008B0, "Member 'ULegacyButtonIconText_C::DisplayText' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, IconBrush) == 0x0008C8, "Member 'ULegacyButtonIconText_C::IconBrush' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, HasIcon) == 0x000958, "Member 'ULegacyButtonIconText_C::HasIcon' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, HasText) == 0x000959, "Member 'ULegacyButtonIconText_C::HasText' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, Content_Align) == 0x00095A, "Member 'ULegacyButtonIconText_C::Content_Align' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, On_Mouse_Hovered_Changed) == 0x000960, "Member 'ULegacyButtonIconText_C::On_Mouse_Hovered_Changed' has a wrong offset!");

}

