#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LegacyAlteration_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LegacyAlteration_Widget.LegacyAlteration_Widget_C
// 0x0070 (0x02C8 - 0x0258)
class ULegacyAlteration_Widget_C final : public UFortAlterationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(Transient, DuplicateTransient)
	class UBorder*                                BorderBadge;                                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderBadge_Alt;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderFrame;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxCompactContent;                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageAlteration;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageAlteration_Alt;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LevelText;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LevelText_Alt;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBoxFullContent;                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_AlterationInfo;                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_AlterationName;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcherContent;                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bTextOnly;                                         // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_LegacyAlteration_Widget(int32 EntryPoint);
	void Construct();
	struct FLinearColor GetHighlightColor();
	bool ShouldFadeAlteration();
	void InitFullAlteration();
	void InitSmallAlteration();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LegacyAlteration_Widget_C">();
	}
	static class ULegacyAlteration_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyAlteration_Widget_C>();
	}
};
static_assert(alignof(ULegacyAlteration_Widget_C) == 0x000008, "Wrong alignment on ULegacyAlteration_Widget_C");
static_assert(sizeof(ULegacyAlteration_Widget_C) == 0x0002C8, "Wrong size on ULegacyAlteration_Widget_C");
static_assert(offsetof(ULegacyAlteration_Widget_C, UberGraphFrame) == 0x000258, "Member 'ULegacyAlteration_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULegacyAlteration_Widget_C, BorderBadge) == 0x000260, "Member 'ULegacyAlteration_Widget_C::BorderBadge' has a wrong offset!");
static_assert(offsetof(ULegacyAlteration_Widget_C, BorderBadge_Alt) == 0x000268, "Member 'ULegacyAlteration_Widget_C::BorderBadge_Alt' has a wrong offset!");
static_assert(offsetof(ULegacyAlteration_Widget_C, BorderFrame) == 0x000270, "Member 'ULegacyAlteration_Widget_C::BorderFrame' has a wrong offset!");
static_assert(offsetof(ULegacyAlteration_Widget_C, HorizontalBoxCompactContent) == 0x000278, "Member 'ULegacyAlteration_Widget_C::HorizontalBoxCompactContent' has a wrong offset!");
static_assert(offsetof(ULegacyAlteration_Widget_C, ImageAlteration) == 0x000280, "Member 'ULegacyAlteration_Widget_C::ImageAlteration' has a wrong offset!");
static_assert(offsetof(ULegacyAlteration_Widget_C, ImageAlteration_Alt) == 0x000288, "Member 'ULegacyAlteration_Widget_C::ImageAlteration_Alt' has a wrong offset!");
static_assert(offsetof(ULegacyAlteration_Widget_C, LevelText) == 0x000290, "Member 'ULegacyAlteration_Widget_C::LevelText' has a wrong offset!");
static_assert(offsetof(ULegacyAlteration_Widget_C, LevelText_Alt) == 0x000298, "Member 'ULegacyAlteration_Widget_C::LevelText_Alt' has a wrong offset!");
static_assert(offsetof(ULegacyAlteration_Widget_C, ScaleBoxFullContent) == 0x0002A0, "Member 'ULegacyAlteration_Widget_C::ScaleBoxFullContent' has a wrong offset!");
static_assert(offsetof(ULegacyAlteration_Widget_C, Text_AlterationInfo) == 0x0002A8, "Member 'ULegacyAlteration_Widget_C::Text_AlterationInfo' has a wrong offset!");
static_assert(offsetof(ULegacyAlteration_Widget_C, Text_AlterationName) == 0x0002B0, "Member 'ULegacyAlteration_Widget_C::Text_AlterationName' has a wrong offset!");
static_assert(offsetof(ULegacyAlteration_Widget_C, WidgetSwitcherContent) == 0x0002B8, "Member 'ULegacyAlteration_Widget_C::WidgetSwitcherContent' has a wrong offset!");
static_assert(offsetof(ULegacyAlteration_Widget_C, bTextOnly) == 0x0002C0, "Member 'ULegacyAlteration_Widget_C::bTextOnly' has a wrong offset!");

}

