#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LegacyRatingWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LegacyRatingWidget.LegacyRatingWidget_C
// 0x15C8 (0x1E30 - 0x0868)
class ULegacyRatingWidget_C final : public UFortBaseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0868(0x0008)(Transient, DuplicateTransient)
	class UBorder*                                Border_Base;                                       // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortNumericTextBlock*                  NumericText_RatingValue;                           // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         RatingValue;                                       // 0x0890(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_894[0x4];                                      // 0x0894(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       UniqueId;                                          // 0x0898(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         InterpDuration;                                    // 0x08B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_8B4[0x4];                                      // 0x08B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMultiSizeBrush                    MBrush_Silhouette;                                 // 0x08B8(0x0360)(Edit, BlueprintVisible)
	struct FFortMultiSizeBrush                    MBrush_Chamfer;                                    // 0x0C18(0x0360)(Edit, BlueprintVisible)
	struct FFortMultiSizeBrush                    MBrush_Shadow;                                     // 0x0F78(0x0360)(Edit, BlueprintVisible)
	struct FFortMultiSizeBrush                    MBrush_Icon;                                       // 0x12D8(0x0360)(Edit, BlueprintVisible)
	bool                                          OverrideDefaultColor;                              // 0x1638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1639[0x3];                                     // 0x1639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color_Light;                                       // 0x163C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Medium;                                      // 0x164C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Dark;                                        // 0x165C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Default_Color_Light;                               // 0x166C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Default_Color_Medium;                              // 0x167C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Default_Color_Dark;                                // 0x168C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169C[0x4];                                     // 0x169C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMultiSizeBrush                    MBrush_Icon_Alt;                                   // 0x16A0(0x0360)(Edit, BlueprintVisible)
	bool                                          UseAlternateIcon;                                  // 0x1A00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_1A01[0x7];                                     // 0x1A01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMultiSizeBrush                    MBrush_Shadow_Alt;                                 // 0x1A08(0x0360)(Edit, BlueprintVisible)
	struct FFortMultiSizeMargin                   MMargin_Alt;                                       // 0x1D68(0x0060)(Edit, BlueprintVisible, NoDestructor)
	struct FFortMultiSizeMargin                   MMargin;                                           // 0x1DC8(0x0060)(Edit, BlueprintVisible, NoDestructor)
	bool                                          ShowTeamPowerRating;                               // 0x1E28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_LegacyRatingWidget(int32 EntryPoint);
	void PlayerStateChanged(const struct FFortTeamMemberInfo& PlayerInfo);
	void Construct();
	void PlayerInfoChanged(const struct FUniqueNetIdRepl& UniqueId_0);
	void PreConstruct(bool IsDesignTime);
	void Update_Rating_Value(int32 Rating);
	void Set_Size_Box();
	void Set_Padding();
	void Update();
	void Set_Unique_ID(const struct FUniqueNetIdRepl& ID);
	void Update_From_Unique_ID();
	void Update_Base_Material();
	void Set_Texture2D_Parameter_From_Multi_Size_Brush(class UMaterialInstanceDynamic* Mid, class FName Parameter, const struct FFortMultiSizeBrush& MBrush);
	void Override_Default_Color_Set(bool Override, const struct FLinearColor& Light_Color, const struct FLinearColor& Medium_Color, const struct FLinearColor& Dark_Color);
	void SetShouldShowTeamPowerRating(bool ShowTeamRating);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LegacyRatingWidget_C">();
	}
	static class ULegacyRatingWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyRatingWidget_C>();
	}
};
static_assert(alignof(ULegacyRatingWidget_C) == 0x000008, "Wrong alignment on ULegacyRatingWidget_C");
static_assert(sizeof(ULegacyRatingWidget_C) == 0x001E30, "Wrong size on ULegacyRatingWidget_C");
static_assert(offsetof(ULegacyRatingWidget_C, UberGraphFrame) == 0x000868, "Member 'ULegacyRatingWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, Border_Base) == 0x000870, "Member 'ULegacyRatingWidget_C::Border_Base' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, HorizontalBox) == 0x000878, "Member 'ULegacyRatingWidget_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, NumericText_RatingValue) == 0x000880, "Member 'ULegacyRatingWidget_C::NumericText_RatingValue' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, SizeBox) == 0x000888, "Member 'ULegacyRatingWidget_C::SizeBox' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, RatingValue) == 0x000890, "Member 'ULegacyRatingWidget_C::RatingValue' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, UniqueId) == 0x000898, "Member 'ULegacyRatingWidget_C::UniqueId' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, InterpDuration) == 0x0008B0, "Member 'ULegacyRatingWidget_C::InterpDuration' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, MBrush_Silhouette) == 0x0008B8, "Member 'ULegacyRatingWidget_C::MBrush_Silhouette' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, MBrush_Chamfer) == 0x000C18, "Member 'ULegacyRatingWidget_C::MBrush_Chamfer' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, MBrush_Shadow) == 0x000F78, "Member 'ULegacyRatingWidget_C::MBrush_Shadow' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, MBrush_Icon) == 0x0012D8, "Member 'ULegacyRatingWidget_C::MBrush_Icon' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, OverrideDefaultColor) == 0x001638, "Member 'ULegacyRatingWidget_C::OverrideDefaultColor' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, Color_Light) == 0x00163C, "Member 'ULegacyRatingWidget_C::Color_Light' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, Color_Medium) == 0x00164C, "Member 'ULegacyRatingWidget_C::Color_Medium' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, Color_Dark) == 0x00165C, "Member 'ULegacyRatingWidget_C::Color_Dark' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, Default_Color_Light) == 0x00166C, "Member 'ULegacyRatingWidget_C::Default_Color_Light' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, Default_Color_Medium) == 0x00167C, "Member 'ULegacyRatingWidget_C::Default_Color_Medium' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, Default_Color_Dark) == 0x00168C, "Member 'ULegacyRatingWidget_C::Default_Color_Dark' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, MBrush_Icon_Alt) == 0x0016A0, "Member 'ULegacyRatingWidget_C::MBrush_Icon_Alt' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, UseAlternateIcon) == 0x001A00, "Member 'ULegacyRatingWidget_C::UseAlternateIcon' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, MBrush_Shadow_Alt) == 0x001A08, "Member 'ULegacyRatingWidget_C::MBrush_Shadow_Alt' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, MMargin_Alt) == 0x001D68, "Member 'ULegacyRatingWidget_C::MMargin_Alt' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, MMargin) == 0x001DC8, "Member 'ULegacyRatingWidget_C::MMargin' has a wrong offset!");
static_assert(offsetof(ULegacyRatingWidget_C, ShowTeamPowerRating) == 0x001E28, "Member 'ULegacyRatingWidget_C::ShowTeamPowerRating' has a wrong offset!");

}

