#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LegacyAlterationGroup_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LegacyAlterationGroup_Widget.LegacyAlterationGroup_Widget_C
// 0x0030 (0x0288 - 0x0258)
class ULegacyAlterationGroup_Widget_C final : public UFortAlterationsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(Transient, DuplicateTransient)
	class ULegacyAlteration_Widget_C*             AlterationWidget;                                  // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULegacyAlteration_Widget_C*             AlterationWidget_0;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULegacyAlteration_Widget_C*             AlterationWidget_1;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxAlterations;                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bTextOnly;                                         // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_LegacyAlterationGroup_Widget(int32 EntryPoint);
	void OnGenerateAlteration(const struct FFortUIAlteration& AlterationInfo);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LegacyAlterationGroup_Widget_C">();
	}
	static class ULegacyAlterationGroup_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyAlterationGroup_Widget_C>();
	}
};
static_assert(alignof(ULegacyAlterationGroup_Widget_C) == 0x000008, "Wrong alignment on ULegacyAlterationGroup_Widget_C");
static_assert(sizeof(ULegacyAlterationGroup_Widget_C) == 0x000288, "Wrong size on ULegacyAlterationGroup_Widget_C");
static_assert(offsetof(ULegacyAlterationGroup_Widget_C, UberGraphFrame) == 0x000258, "Member 'ULegacyAlterationGroup_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULegacyAlterationGroup_Widget_C, AlterationWidget) == 0x000260, "Member 'ULegacyAlterationGroup_Widget_C::AlterationWidget' has a wrong offset!");
static_assert(offsetof(ULegacyAlterationGroup_Widget_C, AlterationWidget_0) == 0x000268, "Member 'ULegacyAlterationGroup_Widget_C::AlterationWidget_0' has a wrong offset!");
static_assert(offsetof(ULegacyAlterationGroup_Widget_C, AlterationWidget_1) == 0x000270, "Member 'ULegacyAlterationGroup_Widget_C::AlterationWidget_1' has a wrong offset!");
static_assert(offsetof(ULegacyAlterationGroup_Widget_C, VerticalBoxAlterations) == 0x000278, "Member 'ULegacyAlterationGroup_Widget_C::VerticalBoxAlterations' has a wrong offset!");
static_assert(offsetof(ULegacyAlterationGroup_Widget_C, bTextOnly) == 0x000280, "Member 'ULegacyAlterationGroup_Widget_C::bTextOnly' has a wrong offset!");

}

