#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LegacyBasicGradientFill

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function LegacyBasicGradientFill.LegacyBasicGradientFill_C.ExecuteUbergraph_LegacyBasicGradientFill
// 0x0008 (0x0008 - 0x0000)
struct LegacyBasicGradientFill_C_ExecuteUbergraph_LegacyBasicGradientFill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LegacyBasicGradientFill_C_ExecuteUbergraph_LegacyBasicGradientFill) == 0x000004, "Wrong alignment on LegacyBasicGradientFill_C_ExecuteUbergraph_LegacyBasicGradientFill");
static_assert(sizeof(LegacyBasicGradientFill_C_ExecuteUbergraph_LegacyBasicGradientFill) == 0x000008, "Wrong size on LegacyBasicGradientFill_C_ExecuteUbergraph_LegacyBasicGradientFill");
static_assert(offsetof(LegacyBasicGradientFill_C_ExecuteUbergraph_LegacyBasicGradientFill, EntryPoint) == 0x000000, "Member 'LegacyBasicGradientFill_C_ExecuteUbergraph_LegacyBasicGradientFill::EntryPoint' has a wrong offset!");
static_assert(offsetof(LegacyBasicGradientFill_C_ExecuteUbergraph_LegacyBasicGradientFill, K2Node_Event_IsDesignTime) == 0x000004, "Member 'LegacyBasicGradientFill_C_ExecuteUbergraph_LegacyBasicGradientFill::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function LegacyBasicGradientFill.LegacyBasicGradientFill_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LegacyBasicGradientFill_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LegacyBasicGradientFill_C_PreConstruct) == 0x000001, "Wrong alignment on LegacyBasicGradientFill_C_PreConstruct");
static_assert(sizeof(LegacyBasicGradientFill_C_PreConstruct) == 0x000001, "Wrong size on LegacyBasicGradientFill_C_PreConstruct");
static_assert(offsetof(LegacyBasicGradientFill_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LegacyBasicGradientFill_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function LegacyBasicGradientFill.LegacyBasicGradientFill_C.Set Fill
// 0x0038 (0x0038 - 0x0000)
struct LegacyBasicGradientFill_C_Set_Fill final
{
public:
	struct FLinearColor                           Color_1_0;                                         // 0x0000(0x0010)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_2_0;                                         // 0x0010(0x0010)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rotation__0___1_;                                  // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LegacyBasicGradientFill_C_Set_Fill) == 0x000008, "Wrong alignment on LegacyBasicGradientFill_C_Set_Fill");
static_assert(sizeof(LegacyBasicGradientFill_C_Set_Fill) == 0x000038, "Wrong size on LegacyBasicGradientFill_C_Set_Fill");
static_assert(offsetof(LegacyBasicGradientFill_C_Set_Fill, Color_1_0) == 0x000000, "Member 'LegacyBasicGradientFill_C_Set_Fill::Color_1_0' has a wrong offset!");
static_assert(offsetof(LegacyBasicGradientFill_C_Set_Fill, Color_2_0) == 0x000010, "Member 'LegacyBasicGradientFill_C_Set_Fill::Color_2_0' has a wrong offset!");
static_assert(offsetof(LegacyBasicGradientFill_C_Set_Fill, Rotation__0___1_) == 0x000020, "Member 'LegacyBasicGradientFill_C_Set_Fill::Rotation__0___1_' has a wrong offset!");
static_assert(offsetof(LegacyBasicGradientFill_C_Set_Fill, CallFunc_FClamp_ReturnValue) == 0x000024, "Member 'LegacyBasicGradientFill_C_Set_Fill::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyBasicGradientFill_C_Set_Fill, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'LegacyBasicGradientFill_C_Set_Fill::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyBasicGradientFill_C_Set_Fill, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'LegacyBasicGradientFill_C_Set_Fill::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function LegacyBasicGradientFill.LegacyBasicGradientFill_C.Set Brush Size
// 0x0098 (0x0098 - 0x0000)
struct LegacyBasicGradientFill_C_Set_Brush_Size final
{
public:
	struct FVector2D                              Brush_Size_0;                                      // 0x0000(0x0008)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0008(0x0090)()
};
static_assert(alignof(LegacyBasicGradientFill_C_Set_Brush_Size) == 0x000008, "Wrong alignment on LegacyBasicGradientFill_C_Set_Brush_Size");
static_assert(sizeof(LegacyBasicGradientFill_C_Set_Brush_Size) == 0x000098, "Wrong size on LegacyBasicGradientFill_C_Set_Brush_Size");
static_assert(offsetof(LegacyBasicGradientFill_C_Set_Brush_Size, Brush_Size_0) == 0x000000, "Member 'LegacyBasicGradientFill_C_Set_Brush_Size::Brush_Size_0' has a wrong offset!");
static_assert(offsetof(LegacyBasicGradientFill_C_Set_Brush_Size, K2Node_MakeStruct_SlateBrush) == 0x000008, "Member 'LegacyBasicGradientFill_C_Set_Brush_Size::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

}

