#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LegacyItem_DO_NOT_USE

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ItemDisplayStyle_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ItemTextureSet_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "ItemDisplayMode_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C.ExecuteUbergraph_LegacyItem_DO_NOT_USE
// 0x0150 (0x0150 - 0x0000)
struct LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget*                   CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInCursorMode_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortUIState                                  CallFunc__BPGetCurrentUIState_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget*                   CallFunc_GetUIManagerWidget_ReturnValue2;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortUIState                                  CallFunc__BPGetCurrentUIState_ReturnValue2;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              K2Node_Event_NewItem;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bCursorModeEnabled;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_CursorModeContentWidget;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0068(0x0034)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00A0(0x0078)(ConstParm)
	int32                                         K2Node_Event_NewCooldownSeconds;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewActivatable;                      // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue;                  // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Num_in_Stack_ReturnValue;             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Num_in_Stack_ReturnValue2;            // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Get_Item_Tooltip_ReturnValue;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Get_Item_Tooltip_ReturnValue2;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE) == 0x000008, "Wrong alignment on LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE");
static_assert(sizeof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE) == 0x000150, "Wrong size on LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, EntryPoint) == 0x000000, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::EntryPoint' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, CallFunc_IsInCursorMode_ReturnValue) == 0x000018, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::CallFunc_IsInCursorMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, CallFunc__BPGetCurrentUIState_ReturnValue) == 0x000019, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::CallFunc__BPGetCurrentUIState_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, CallFunc_GetUIManagerWidget_ReturnValue2) == 0x000020, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::CallFunc_GetUIManagerWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, CallFunc__BPGetCurrentUIState_ReturnValue2) == 0x000029, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::CallFunc__BPGetCurrentUIState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, K2Node_Event_IsDesignTime) == 0x00002A, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, K2Node_Event_NewItem) == 0x000030, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::K2Node_Event_NewItem' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, K2Node_CustomEvent_bCursorModeEnabled) == 0x000038, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::K2Node_CustomEvent_bCursorModeEnabled' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, K2Node_CustomEvent_ActionName) == 0x000040, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, K2Node_CustomEvent_CursorModeContentWidget) == 0x000048, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::K2Node_CustomEvent_CursorModeContentWidget' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x000050, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, K2Node_Event_MyGeometry) == 0x000068, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, K2Node_Event_MouseEvent) == 0x0000A0, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, K2Node_Event_NewCooldownSeconds) == 0x000118, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::K2Node_Event_NewCooldownSeconds' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, K2Node_Event_bNewActivatable) == 0x00011C, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::K2Node_Event_bNewActivatable' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000120, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, CallFunc_FromSeconds_ReturnValue) == 0x000128, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::CallFunc_FromSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, CallFunc_GetContext_ReturnValue2) == 0x000130, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, CallFunc_Get_Num_in_Stack_ReturnValue) == 0x000138, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::CallFunc_Get_Num_in_Stack_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, CallFunc_Get_Num_in_Stack_ReturnValue2) == 0x00013C, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::CallFunc_Get_Num_in_Stack_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, CallFunc_Get_Item_Tooltip_ReturnValue) == 0x000140, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::CallFunc_Get_Item_Tooltip_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE, CallFunc_Get_Item_Tooltip_ReturnValue2) == 0x000148, "Member 'LegacyItem_DO_NOT_USE_C_ExecuteUbergraph_LegacyItem_DO_NOT_USE::CallFunc_Get_Item_Tooltip_ReturnValue2' has a wrong offset!");

// Function LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C.BPOnActivatableChanged
// 0x0001 (0x0001 - 0x0000)
struct LegacyItem_DO_NOT_USE_C_BPOnActivatableChanged final
{
public:
	bool                                          bNewActivatable;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LegacyItem_DO_NOT_USE_C_BPOnActivatableChanged) == 0x000001, "Wrong alignment on LegacyItem_DO_NOT_USE_C_BPOnActivatableChanged");
static_assert(sizeof(LegacyItem_DO_NOT_USE_C_BPOnActivatableChanged) == 0x000001, "Wrong size on LegacyItem_DO_NOT_USE_C_BPOnActivatableChanged");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_BPOnActivatableChanged, bNewActivatable) == 0x000000, "Member 'LegacyItem_DO_NOT_USE_C_BPOnActivatableChanged::bNewActivatable' has a wrong offset!");

// Function LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C.BPOnCooldownSecondsChanged
// 0x0004 (0x0004 - 0x0000)
struct LegacyItem_DO_NOT_USE_C_BPOnCooldownSecondsChanged final
{
public:
	int32                                         NewCooldownSeconds;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LegacyItem_DO_NOT_USE_C_BPOnCooldownSecondsChanged) == 0x000004, "Wrong alignment on LegacyItem_DO_NOT_USE_C_BPOnCooldownSecondsChanged");
static_assert(sizeof(LegacyItem_DO_NOT_USE_C_BPOnCooldownSecondsChanged) == 0x000004, "Wrong size on LegacyItem_DO_NOT_USE_C_BPOnCooldownSecondsChanged");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_BPOnCooldownSecondsChanged, NewCooldownSeconds) == 0x000000, "Member 'LegacyItem_DO_NOT_USE_C_BPOnCooldownSecondsChanged::NewCooldownSeconds' has a wrong offset!");

// Function LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct LegacyItem_DO_NOT_USE_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LegacyItem_DO_NOT_USE_C_OnMouseEnter) == 0x000008, "Wrong alignment on LegacyItem_DO_NOT_USE_C_OnMouseEnter");
static_assert(sizeof(LegacyItem_DO_NOT_USE_C_OnMouseEnter) == 0x0000B0, "Wrong size on LegacyItem_DO_NOT_USE_C_OnMouseEnter");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'LegacyItem_DO_NOT_USE_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'LegacyItem_DO_NOT_USE_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C.OnCursorModeChanged
// 0x0018 (0x0018 - 0x0000)
struct LegacyItem_DO_NOT_USE_C_OnCursorModeChanged final
{
public:
	bool                                          bCursorModeEnabled;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CursorModeContentWidget;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LegacyItem_DO_NOT_USE_C_OnCursorModeChanged) == 0x000008, "Wrong alignment on LegacyItem_DO_NOT_USE_C_OnCursorModeChanged");
static_assert(sizeof(LegacyItem_DO_NOT_USE_C_OnCursorModeChanged) == 0x000018, "Wrong size on LegacyItem_DO_NOT_USE_C_OnCursorModeChanged");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnCursorModeChanged, bCursorModeEnabled) == 0x000000, "Member 'LegacyItem_DO_NOT_USE_C_OnCursorModeChanged::bCursorModeEnabled' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnCursorModeChanged, ActionName) == 0x000008, "Member 'LegacyItem_DO_NOT_USE_C_OnCursorModeChanged::ActionName' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnCursorModeChanged, CursorModeContentWidget) == 0x000010, "Member 'LegacyItem_DO_NOT_USE_C_OnCursorModeChanged::CursorModeContentWidget' has a wrong offset!");

// Function LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C.BPOnItemSet
// 0x0008 (0x0008 - 0x0000)
struct LegacyItem_DO_NOT_USE_C_BPOnItemSet final
{
public:
	class UFortItem*                              NewItem;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LegacyItem_DO_NOT_USE_C_BPOnItemSet) == 0x000008, "Wrong alignment on LegacyItem_DO_NOT_USE_C_BPOnItemSet");
static_assert(sizeof(LegacyItem_DO_NOT_USE_C_BPOnItemSet) == 0x000008, "Wrong size on LegacyItem_DO_NOT_USE_C_BPOnItemSet");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_BPOnItemSet, NewItem) == 0x000000, "Member 'LegacyItem_DO_NOT_USE_C_BPOnItemSet::NewItem' has a wrong offset!");

// Function LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LegacyItem_DO_NOT_USE_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LegacyItem_DO_NOT_USE_C_PreConstruct) == 0x000001, "Wrong alignment on LegacyItem_DO_NOT_USE_C_PreConstruct");
static_assert(sizeof(LegacyItem_DO_NOT_USE_C_PreConstruct) == 0x000001, "Wrong size on LegacyItem_DO_NOT_USE_C_PreConstruct");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LegacyItem_DO_NOT_USE_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C.Update Base Material
// 0x00F0 (0x00F0 - 0x0000)
struct LegacyItem_DO_NOT_USE_C_Update_Base_Material final
{
public:
	class UMaterialInstanceDynamic*               Icon_Material;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Base_Material;                                     // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue2;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue3;           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue2;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue; // 0x0038(0x0090)(ConstParm)
	class UTexture2D*                             CallFunc_Get_Texture2D_From_Multi_Size_Brush_Texture2D; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Texture2D_From_Multi_Size_Brush_Success; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Get_Texture2D_From_Multi_Size_Brush_Texture2D2; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Texture2D_From_Multi_Size_Brush_Success2; // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue2;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LegacyItem_DO_NOT_USE_C_Update_Base_Material) == 0x000008, "Wrong alignment on LegacyItem_DO_NOT_USE_C_Update_Base_Material");
static_assert(sizeof(LegacyItem_DO_NOT_USE_C_Update_Base_Material) == 0x0000F0, "Wrong size on LegacyItem_DO_NOT_USE_C_Update_Base_Material");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, Icon_Material) == 0x000000, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::Icon_Material' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, Base_Material) == 0x000008, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::Base_Material' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, Temp_byte_Variable) == 0x000010, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000020, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, Temp_byte_Variable2) == 0x000021, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000024, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, CallFunc_NotEqual_ByteByte_ReturnValue2) == 0x000028, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::CallFunc_NotEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, CallFunc_NotEqual_ByteByte_ReturnValue3) == 0x000029, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::CallFunc_NotEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, CallFunc_Conv_BoolToFloat_ReturnValue2) == 0x00002C, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::CallFunc_Conv_BoolToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, Temp_bool_Variable) == 0x000030, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, K2Node_Select_Default) == 0x000031, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue) == 0x000038, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, CallFunc_Get_Texture2D_From_Multi_Size_Brush_Texture2D) == 0x0000C8, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::CallFunc_Get_Texture2D_From_Multi_Size_Brush_Texture2D' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, CallFunc_Get_Texture2D_From_Multi_Size_Brush_Success) == 0x0000D0, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::CallFunc_Get_Texture2D_From_Multi_Size_Brush_Success' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, CallFunc_Get_Texture2D_From_Multi_Size_Brush_Texture2D2) == 0x0000D8, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::CallFunc_Get_Texture2D_From_Multi_Size_Brush_Texture2D2' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, CallFunc_Get_Texture2D_From_Multi_Size_Brush_Success2) == 0x0000E0, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::CallFunc_Get_Texture2D_From_Multi_Size_Brush_Success2' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Base_Material, CallFunc_GetDynamicMaterial_ReturnValue2) == 0x0000E8, "Member 'LegacyItem_DO_NOT_USE_C_Update_Base_Material::CallFunc_GetDynamicMaterial_ReturnValue2' has a wrong offset!");

// Function LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C.Set Item Data
// 0x0098 (0x0098 - 0x0000)
struct LegacyItem_DO_NOT_USE_C_Set_Item_Data final
{
public:
	class UFortItem*                              Item_Data;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0010(0x0080)()
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemDisplayStyle                             CallFunc_Get_Display_Style_Style;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LegacyItem_DO_NOT_USE_C_Set_Item_Data) == 0x000008, "Wrong alignment on LegacyItem_DO_NOT_USE_C_Set_Item_Data");
static_assert(sizeof(LegacyItem_DO_NOT_USE_C_Set_Item_Data) == 0x000098, "Wrong size on LegacyItem_DO_NOT_USE_C_Set_Item_Data");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Set_Item_Data, Item_Data) == 0x000000, "Member 'LegacyItem_DO_NOT_USE_C_Set_Item_Data::Item_Data' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Set_Item_Data, CallFunc_GetRarity_ReturnValue) == 0x000008, "Member 'LegacyItem_DO_NOT_USE_C_Set_Item_Data::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Set_Item_Data, CallFunc_BPGetRarityData_ReturnValue) == 0x000010, "Member 'LegacyItem_DO_NOT_USE_C_Set_Item_Data::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Set_Item_Data, CallFunc_GetType_ReturnValue) == 0x000090, "Member 'LegacyItem_DO_NOT_USE_C_Set_Item_Data::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Set_Item_Data, CallFunc_Get_Display_Style_Style) == 0x000091, "Member 'LegacyItem_DO_NOT_USE_C_Set_Item_Data::CallFunc_Get_Display_Style_Style' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Set_Item_Data, CallFunc_IsValid_ReturnValue) == 0x000092, "Member 'LegacyItem_DO_NOT_USE_C_Set_Item_Data::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C.Update Stack Counter
// 0x000C (0x000C - 0x0000)
struct LegacyItem_DO_NOT_USE_C_Update_Stack_Counter final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Get_Num_in_Stack_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LegacyItem_DO_NOT_USE_C_Update_Stack_Counter) == 0x000004, "Wrong alignment on LegacyItem_DO_NOT_USE_C_Update_Stack_Counter");
static_assert(sizeof(LegacyItem_DO_NOT_USE_C_Update_Stack_Counter) == 0x00000C, "Wrong size on LegacyItem_DO_NOT_USE_C_Update_Stack_Counter");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Stack_Counter, Temp_bool_Variable) == 0x000000, "Member 'LegacyItem_DO_NOT_USE_C_Update_Stack_Counter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Stack_Counter, Temp_byte_Variable) == 0x000001, "Member 'LegacyItem_DO_NOT_USE_C_Update_Stack_Counter::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Stack_Counter, Temp_byte_Variable2) == 0x000002, "Member 'LegacyItem_DO_NOT_USE_C_Update_Stack_Counter::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Stack_Counter, CallFunc_Get_Num_in_Stack_ReturnValue) == 0x000004, "Member 'LegacyItem_DO_NOT_USE_C_Update_Stack_Counter::CallFunc_Get_Num_in_Stack_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Stack_Counter, K2Node_Select_Default) == 0x000008, "Member 'LegacyItem_DO_NOT_USE_C_Update_Stack_Counter::K2Node_Select_Default' has a wrong offset!");

// Function LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C.Update All
// 0x0A78 (0x0A78 - 0x0000)
struct LegacyItem_DO_NOT_USE_C_Update_All final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetCooldownMaterial_CooldownMat;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_IsActivatable_FailureReason;              // 0x0028(0x0020)()
	bool                                          CallFunc_IsActivatable_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemTextureSet                        CallFunc_Get_Item_Texture_Set_Texture_Set;         // 0x0050(0x0A28)(HasGetValueTypeHash)
};
static_assert(alignof(LegacyItem_DO_NOT_USE_C_Update_All) == 0x000008, "Wrong alignment on LegacyItem_DO_NOT_USE_C_Update_All");
static_assert(sizeof(LegacyItem_DO_NOT_USE_C_Update_All) == 0x000A78, "Wrong size on LegacyItem_DO_NOT_USE_C_Update_All");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_All, CallFunc_GetCooldownMaterial_CooldownMat) == 0x000000, "Member 'LegacyItem_DO_NOT_USE_C_Update_All::CallFunc_GetCooldownMaterial_CooldownMat' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_All, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000008, "Member 'LegacyItem_DO_NOT_USE_C_Update_All::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_All, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'LegacyItem_DO_NOT_USE_C_Update_All::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_All, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000018, "Member 'LegacyItem_DO_NOT_USE_C_Update_All::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_All, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'LegacyItem_DO_NOT_USE_C_Update_All::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_All, CallFunc_IsActivatable_FailureReason) == 0x000028, "Member 'LegacyItem_DO_NOT_USE_C_Update_All::CallFunc_IsActivatable_FailureReason' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_All, CallFunc_IsActivatable_ReturnValue) == 0x000048, "Member 'LegacyItem_DO_NOT_USE_C_Update_All::CallFunc_IsActivatable_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_All, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'LegacyItem_DO_NOT_USE_C_Update_All::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_All, CallFunc_Get_Item_Texture_Set_Texture_Set) == 0x000050, "Member 'LegacyItem_DO_NOT_USE_C_Update_All::CallFunc_Get_Item_Texture_Set_Texture_Set' has a wrong offset!");

// Function LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C.OnMouseButtonDown
// 0x0390 (0x0390 - 0x0000)
struct LegacyItem_DO_NOT_USE_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            Result;                                            // 0x0168(0x00B8)(Edit)
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x0220(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x02D8(0x00B8)()
};
static_assert(alignof(LegacyItem_DO_NOT_USE_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on LegacyItem_DO_NOT_USE_C_OnMouseButtonDown");
static_assert(sizeof(LegacyItem_DO_NOT_USE_C_OnMouseButtonDown) == 0x000390, "Wrong size on LegacyItem_DO_NOT_USE_C_OnMouseButtonDown");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'LegacyItem_DO_NOT_USE_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'LegacyItem_DO_NOT_USE_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'LegacyItem_DO_NOT_USE_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnMouseButtonDown, Result) == 0x000168, "Member 'LegacyItem_DO_NOT_USE_C_OnMouseButtonDown::Result' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue) == 0x000220, "Member 'LegacyItem_DO_NOT_USE_C_OnMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x0002D8, "Member 'LegacyItem_DO_NOT_USE_C_OnMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C.OnDragDetected
// 0x0118 (0x0118 - 0x0000)
struct LegacyItem_DO_NOT_USE_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Drag_Icon_Texture;                                 // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDragDropOperation*                     CallFunc_CreateDragDropOperation_ReturnValue;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue;         // 0x00D0(0x0020)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_AssetToObject_ReturnValue;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemDragIcon_C*                        CallFunc_Create_ReturnValue;                       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LegacyItem_DO_NOT_USE_C_OnDragDetected) == 0x000008, "Wrong alignment on LegacyItem_DO_NOT_USE_C_OnDragDetected");
static_assert(sizeof(LegacyItem_DO_NOT_USE_C_OnDragDetected) == 0x000118, "Wrong size on LegacyItem_DO_NOT_USE_C_OnDragDetected");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'LegacyItem_DO_NOT_USE_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'LegacyItem_DO_NOT_USE_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnDragDetected, Operation) == 0x0000B0, "Member 'LegacyItem_DO_NOT_USE_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnDragDetected, Drag_Icon_Texture) == 0x0000B8, "Member 'LegacyItem_DO_NOT_USE_C_OnDragDetected::Drag_Icon_Texture' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnDragDetected, CallFunc_CreateDragDropOperation_ReturnValue) == 0x0000C0, "Member 'LegacyItem_DO_NOT_USE_C_OnDragDetected::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnDragDetected, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'LegacyItem_DO_NOT_USE_C_OnDragDetected::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnDragDetected, CallFunc_GetSmallPreviewImage_ReturnValue) == 0x0000D0, "Member 'LegacyItem_DO_NOT_USE_C_OnDragDetected::CallFunc_GetSmallPreviewImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnDragDetected, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000F0, "Member 'LegacyItem_DO_NOT_USE_C_OnDragDetected::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnDragDetected, CallFunc_Conv_AssetToObject_ReturnValue) == 0x0000F8, "Member 'LegacyItem_DO_NOT_USE_C_OnDragDetected::CallFunc_Conv_AssetToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnDragDetected, CallFunc_Create_ReturnValue) == 0x000100, "Member 'LegacyItem_DO_NOT_USE_C_OnDragDetected::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnDragDetected, K2Node_DynamicCast_AsTexture_2D) == 0x000108, "Member 'LegacyItem_DO_NOT_USE_C_OnDragDetected::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_OnDragDetected, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'LegacyItem_DO_NOT_USE_C_OnDragDetected::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C.Update Size Box
// 0x0010 (0x0010 - 0x0000)
struct LegacyItem_DO_NOT_USE_C_Update_Size_Box final
{
public:
	struct FVector2D                              CallFunc_Get_Item_Size_Item_Size;                  // 0x0000(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LegacyItem_DO_NOT_USE_C_Update_Size_Box) == 0x000004, "Wrong alignment on LegacyItem_DO_NOT_USE_C_Update_Size_Box");
static_assert(sizeof(LegacyItem_DO_NOT_USE_C_Update_Size_Box) == 0x000010, "Wrong size on LegacyItem_DO_NOT_USE_C_Update_Size_Box");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Size_Box, CallFunc_Get_Item_Size_Item_Size) == 0x000000, "Member 'LegacyItem_DO_NOT_USE_C_Update_Size_Box::CallFunc_Get_Item_Size_Item_Size' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Size_Box, CallFunc_BreakVector2D_X) == 0x000008, "Member 'LegacyItem_DO_NOT_USE_C_Update_Size_Box::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Size_Box, CallFunc_BreakVector2D_Y) == 0x00000C, "Member 'LegacyItem_DO_NOT_USE_C_Update_Size_Box::CallFunc_BreakVector2D_Y' has a wrong offset!");

// Function LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C.Get Item Texture Set
// 0x1EA8 (0x1EA8 - 0x0000)
struct LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set final
{
public:
	EItemDisplayStyle                             Display_Style;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemTextureSet                        Texture_Set;                                       // 0x0008(0x0A28)(Parm, OutParm, HasGetValueTypeHash)
	struct FItemTextureSet                        Item_Texture_Set;                                  // 0x0A30(0x0A28)(Edit, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x1458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1459[0x3];                                     // 0x1459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x145C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x1460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1461[0x3];                                     // 0x1461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x1464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x1468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x146C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x1470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1471[0x7];                                     // 0x1471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemTextureSet                        CallFunc_Array_Get_Item;                           // 0x1478(0x0A28)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x1EA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x1EA1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set) == 0x000008, "Wrong alignment on LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set");
static_assert(sizeof(LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set) == 0x001EA8, "Wrong size on LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set, Display_Style) == 0x000000, "Member 'LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set::Display_Style' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set, Texture_Set) == 0x000008, "Member 'LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set::Texture_Set' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set, Item_Texture_Set) == 0x000A30, "Member 'LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set::Item_Texture_Set' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set, Temp_bool_True_if_break_was_hit_Variable) == 0x001458, "Member 'LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set, Temp_int_Array_Index_Variable) == 0x00145C, "Member 'LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set, CallFunc_Not_PreBool_ReturnValue) == 0x001460, "Member 'LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set, Temp_int_Loop_Counter_Variable) == 0x001464, "Member 'LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set, CallFunc_Add_IntInt_ReturnValue) == 0x001468, "Member 'LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set, CallFunc_Array_Length_ReturnValue) == 0x00146C, "Member 'LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set, CallFunc_Less_IntInt_ReturnValue) == 0x001470, "Member 'LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set, CallFunc_Array_Get_Item) == 0x001478, "Member 'LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set, CallFunc_BooleanAND_ReturnValue) == 0x001EA0, "Member 'LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x001EA1, "Member 'LegacyItem_DO_NOT_USE_C_Get_Item_Texture_Set::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C.Update Primary Icon
// 0x0068 (0x0068 - 0x0000)
struct LegacyItem_DO_NOT_USE_C_Update_Primary_Icon final
{
public:
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Icon_Size;                                         // 0x0008(0x0008)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue2;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue2;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue;         // 0x0030(0x0020)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_AssetToObject_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LegacyItem_DO_NOT_USE_C_Update_Primary_Icon) == 0x000008, "Wrong alignment on LegacyItem_DO_NOT_USE_C_Update_Primary_Icon");
static_assert(sizeof(LegacyItem_DO_NOT_USE_C_Update_Primary_Icon) == 0x000068, "Wrong size on LegacyItem_DO_NOT_USE_C_Update_Primary_Icon");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Primary_Icon, Mid) == 0x000000, "Member 'LegacyItem_DO_NOT_USE_C_Update_Primary_Icon::Mid' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Primary_Icon, Icon_Size) == 0x000008, "Member 'LegacyItem_DO_NOT_USE_C_Update_Primary_Icon::Icon_Size' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Primary_Icon, Temp_byte_Variable) == 0x000010, "Member 'LegacyItem_DO_NOT_USE_C_Update_Primary_Icon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Primary_Icon, Temp_byte_Variable2) == 0x000011, "Member 'LegacyItem_DO_NOT_USE_C_Update_Primary_Icon::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Primary_Icon, Temp_bool_Variable) == 0x000012, "Member 'LegacyItem_DO_NOT_USE_C_Update_Primary_Icon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Primary_Icon, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000013, "Member 'LegacyItem_DO_NOT_USE_C_Update_Primary_Icon::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Primary_Icon, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000014, "Member 'LegacyItem_DO_NOT_USE_C_Update_Primary_Icon::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Primary_Icon, CallFunc_NotEqual_ByteByte_ReturnValue2) == 0x000018, "Member 'LegacyItem_DO_NOT_USE_C_Update_Primary_Icon::CallFunc_NotEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LegacyItem_DO_NOT_USE_C_Update_Primary_Icon, CallFunc_Conv_BoolToFloat_ReturnValue2) == 0x00001C, "Member 'LegacyItem_DO_NOT_USE_C_Update_Primary_Icon::CallFunc_Conv_BoolToFloat_ReturnValue2' has a wrong offset!");
