#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyPlayerAddPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C
// 0x0028 (0x0260 - 0x0238)
class ULobbyPlayerAddPlayer_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UPanelButton_C*                         ButtonEmptySpot;                                   // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayEmptySlot;                                  // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayInputAction;                                // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PlayerID;                                          // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LobbyPlayerAddPlayer(int32 EntryPoint);
	void BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_46_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyPlayerAddPlayer_C">();
	}
	static class ULobbyPlayerAddPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULobbyPlayerAddPlayer_C>();
	}
};
static_assert(alignof(ULobbyPlayerAddPlayer_C) == 0x000008, "Wrong alignment on ULobbyPlayerAddPlayer_C");
static_assert(sizeof(ULobbyPlayerAddPlayer_C) == 0x000260, "Wrong size on ULobbyPlayerAddPlayer_C");
static_assert(offsetof(ULobbyPlayerAddPlayer_C, UberGraphFrame) == 0x000238, "Member 'ULobbyPlayerAddPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerAddPlayer_C, ButtonEmptySpot) == 0x000240, "Member 'ULobbyPlayerAddPlayer_C::ButtonEmptySpot' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerAddPlayer_C, OverlayEmptySlot) == 0x000248, "Member 'ULobbyPlayerAddPlayer_C::OverlayEmptySlot' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerAddPlayer_C, OverlayInputAction) == 0x000250, "Member 'ULobbyPlayerAddPlayer_C::OverlayInputAction' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerAddPlayer_C, PlayerID) == 0x000258, "Member 'ULobbyPlayerAddPlayer_C::PlayerID' has a wrong offset!");

}

