#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniCraftingIngredientListEntry

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function MiniCraftingIngredientListEntry.MiniCraftingIngredientListEntry_C.ExecuteUbergraph_MiniCraftingIngredientListEntry
// 0x0008 (0x0008 - 0x0000)
struct MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsBeingReset;                         // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry) == 0x000004, "Wrong alignment on MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry");
static_assert(sizeof(MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry) == 0x000008, "Wrong size on MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry, EntryPoint) == 0x000000, "Member 'MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry, K2Node_Event_IsBeingReset) == 0x000004, "Member 'MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry::K2Node_Event_IsBeingReset' has a wrong offset!");

// Function MiniCraftingIngredientListEntry.MiniCraftingIngredientListEntry_C.HandleDifferentItemOrQuantitySetBP
// 0x0001 (0x0001 - 0x0000)
struct MiniCraftingIngredientListEntry_C_HandleDifferentItemOrQuantitySetBP final
{
public:
	bool                                          IsBeingReset;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MiniCraftingIngredientListEntry_C_HandleDifferentItemOrQuantitySetBP) == 0x000001, "Wrong alignment on MiniCraftingIngredientListEntry_C_HandleDifferentItemOrQuantitySetBP");
static_assert(sizeof(MiniCraftingIngredientListEntry_C_HandleDifferentItemOrQuantitySetBP) == 0x000001, "Wrong size on MiniCraftingIngredientListEntry_C_HandleDifferentItemOrQuantitySetBP");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_HandleDifferentItemOrQuantitySetBP, IsBeingReset) == 0x000000, "Member 'MiniCraftingIngredientListEntry_C_HandleDifferentItemOrQuantitySetBP::IsBeingReset' has a wrong offset!");

// Function MiniCraftingIngredientListEntry.MiniCraftingIngredientListEntry_C.Refresh
// 0x0008 (0x0008 - 0x0000)
struct MiniCraftingIngredientListEntry_C_Refresh final
{
public:
	class UFortItemDefinition*                    CallFunc_GetItemDefinition_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MiniCraftingIngredientListEntry_C_Refresh) == 0x000008, "Wrong alignment on MiniCraftingIngredientListEntry_C_Refresh");
static_assert(sizeof(MiniCraftingIngredientListEntry_C_Refresh) == 0x000008, "Wrong size on MiniCraftingIngredientListEntry_C_Refresh");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_Refresh, CallFunc_GetItemDefinition_ReturnValue) == 0x000000, "Member 'MiniCraftingIngredientListEntry_C_Refresh::CallFunc_GetItemDefinition_ReturnValue' has a wrong offset!");

// Function MiniCraftingIngredientListEntry.MiniCraftingIngredientListEntry_C.RefreshBeingPreviewed
// 0x0008 (0x0008 - 0x0000)
struct MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed final
{
public:
	struct FFortItemEntryPreviewData              CallFunc_GetPreviewData_OutPreviewData;            // 0x0000(0x0004)(NoDestructor)
	bool                                          CallFunc_IsBeingPreviewed_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed) == 0x000004, "Wrong alignment on MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed");
static_assert(sizeof(MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed) == 0x000008, "Wrong size on MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed, CallFunc_GetPreviewData_OutPreviewData) == 0x000000, "Member 'MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed::CallFunc_GetPreviewData_OutPreviewData' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed, CallFunc_IsBeingPreviewed_ReturnValue) == 0x000004, "Member 'MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed::CallFunc_IsBeingPreviewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000005, "Member 'MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

