#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieScene

#include "Basic.hpp"


namespace SDK::Params
{

// Function MovieScene.MovieSceneSequencePlayer.PlayLooping
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSequencePlayer_PlayLooping final
{
public:
	int32                                         NumLoops;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieSceneSequencePlayer_PlayLooping) == 0x000004, "Wrong alignment on MovieSceneSequencePlayer_PlayLooping");
static_assert(sizeof(MovieSceneSequencePlayer_PlayLooping) == 0x000004, "Wrong size on MovieSceneSequencePlayer_PlayLooping");
static_assert(offsetof(MovieSceneSequencePlayer_PlayLooping, NumLoops) == 0x000000, "Member 'MovieSceneSequencePlayer_PlayLooping::NumLoops' has a wrong offset!");

// Function MovieScene.MovieSceneSequencePlayer.SetPlaybackPosition
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSequencePlayer_SetPlaybackPosition final
{
public:
	float                                         NewPlaybackPosition;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieSceneSequencePlayer_SetPlaybackPosition) == 0x000004, "Wrong alignment on MovieSceneSequencePlayer_SetPlaybackPosition");
static_assert(sizeof(MovieSceneSequencePlayer_SetPlaybackPosition) == 0x000004, "Wrong size on MovieSceneSequencePlayer_SetPlaybackPosition");
static_assert(offsetof(MovieSceneSequencePlayer_SetPlaybackPosition, NewPlaybackPosition) == 0x000000, "Member 'MovieSceneSequencePlayer_SetPlaybackPosition::NewPlaybackPosition' has a wrong offset!");

// Function MovieScene.MovieSceneSequencePlayer.SetPlaybackRange
// 0x0008 (0x0008 - 0x0000)
struct MovieSceneSequencePlayer_SetPlaybackRange final
{
public:
	float                                         NewStartTime;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewEndTime;                                        // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieSceneSequencePlayer_SetPlaybackRange) == 0x000004, "Wrong alignment on MovieSceneSequencePlayer_SetPlaybackRange");
static_assert(sizeof(MovieSceneSequencePlayer_SetPlaybackRange) == 0x000008, "Wrong size on MovieSceneSequencePlayer_SetPlaybackRange");
static_assert(offsetof(MovieSceneSequencePlayer_SetPlaybackRange, NewStartTime) == 0x000000, "Member 'MovieSceneSequencePlayer_SetPlaybackRange::NewStartTime' has a wrong offset!");
static_assert(offsetof(MovieSceneSequencePlayer_SetPlaybackRange, NewEndTime) == 0x000004, "Member 'MovieSceneSequencePlayer_SetPlaybackRange::NewEndTime' has a wrong offset!");

// Function MovieScene.MovieSceneSequencePlayer.SetPlayRate
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSequencePlayer_SetPlayRate final
{
public:
	float                                         PlayRate;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieSceneSequencePlayer_SetPlayRate) == 0x000004, "Wrong alignment on MovieSceneSequencePlayer_SetPlayRate");
static_assert(sizeof(MovieSceneSequencePlayer_SetPlayRate) == 0x000004, "Wrong size on MovieSceneSequencePlayer_SetPlayRate");
static_assert(offsetof(MovieSceneSequencePlayer_SetPlayRate, PlayRate) == 0x000000, "Member 'MovieSceneSequencePlayer_SetPlayRate::PlayRate' has a wrong offset!");

// Function MovieScene.MovieSceneSequencePlayer.GetLength
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSequencePlayer_GetLength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieSceneSequencePlayer_GetLength) == 0x000004, "Wrong alignment on MovieSceneSequencePlayer_GetLength");
static_assert(sizeof(MovieSceneSequencePlayer_GetLength) == 0x000004, "Wrong size on MovieSceneSequencePlayer_GetLength");
static_assert(offsetof(MovieSceneSequencePlayer_GetLength, ReturnValue) == 0x000000, "Member 'MovieSceneSequencePlayer_GetLength::ReturnValue' has a wrong offset!");

// Function MovieScene.MovieSceneSequencePlayer.GetPlaybackEnd
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSequencePlayer_GetPlaybackEnd final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieSceneSequencePlayer_GetPlaybackEnd) == 0x000004, "Wrong alignment on MovieSceneSequencePlayer_GetPlaybackEnd");
static_assert(sizeof(MovieSceneSequencePlayer_GetPlaybackEnd) == 0x000004, "Wrong size on MovieSceneSequencePlayer_GetPlaybackEnd");
static_assert(offsetof(MovieSceneSequencePlayer_GetPlaybackEnd, ReturnValue) == 0x000000, "Member 'MovieSceneSequencePlayer_GetPlaybackEnd::ReturnValue' has a wrong offset!");

// Function MovieScene.MovieSceneSequencePlayer.GetPlaybackPosition
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSequencePlayer_GetPlaybackPosition final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieSceneSequencePlayer_GetPlaybackPosition) == 0x000004, "Wrong alignment on MovieSceneSequencePlayer_GetPlaybackPosition");
static_assert(sizeof(MovieSceneSequencePlayer_GetPlaybackPosition) == 0x000004, "Wrong size on MovieSceneSequencePlayer_GetPlaybackPosition");
static_assert(offsetof(MovieSceneSequencePlayer_GetPlaybackPosition, ReturnValue) == 0x000000, "Member 'MovieSceneSequencePlayer_GetPlaybackPosition::ReturnValue' has a wrong offset!");

// Function MovieScene.MovieSceneSequencePlayer.GetPlaybackStart
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSequencePlayer_GetPlaybackStart final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieSceneSequencePlayer_GetPlaybackStart) == 0x000004, "Wrong alignment on MovieSceneSequencePlayer_GetPlaybackStart");
static_assert(sizeof(MovieSceneSequencePlayer_GetPlaybackStart) == 0x000004, "Wrong size on MovieSceneSequencePlayer_GetPlaybackStart");
static_assert(offsetof(MovieSceneSequencePlayer_GetPlaybackStart, ReturnValue) == 0x000000, "Member 'MovieSceneSequencePlayer_GetPlaybackStart::ReturnValue' has a wrong offset!");

// Function MovieScene.MovieSceneSequencePlayer.GetPlayRate
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSequencePlayer_GetPlayRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieSceneSequencePlayer_GetPlayRate) == 0x000004, "Wrong alignment on MovieSceneSequencePlayer_GetPlayRate");
static_assert(sizeof(MovieSceneSequencePlayer_GetPlayRate) == 0x000004, "Wrong size on MovieSceneSequencePlayer_GetPlayRate");
static_assert(offsetof(MovieSceneSequencePlayer_GetPlayRate, ReturnValue) == 0x000000, "Member 'MovieSceneSequencePlayer_GetPlayRate::ReturnValue' has a wrong offset!");

// Function MovieScene.MovieSceneSequencePlayer.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSequencePlayer_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieSceneSequencePlayer_IsPlaying) == 0x000001, "Wrong alignment on MovieSceneSequencePlayer_IsPlaying");
static_assert(sizeof(MovieSceneSequencePlayer_IsPlaying) == 0x000001, "Wrong size on MovieSceneSequencePlayer_IsPlaying");
static_assert(offsetof(MovieSceneSequencePlayer_IsPlaying, ReturnValue) == 0x000000, "Member 'MovieSceneSequencePlayer_IsPlaying::ReturnValue' has a wrong offset!");

}

