#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MTXButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function MTXButton.MTXButton_C.ExecuteUbergraph_MTXButton
// 0x0098 (0x0098 - 0x0000)
struct MTXButton_C_ExecuteUbergraph_MTXButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bUsingGamepad)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	struct FFortPrivateAccountInfo                K2Node_CustomEvent_NewInfo;                        // 0x0030(0x0014)(NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue3;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortPrivateAccountInfo                CallFunc_GetLocalAccountInfo_Result;               // 0x0050(0x0014)(NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FFortPrivateAccountInfo& NewInfo)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_bUsingGamepad;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MTXButton_C_ExecuteUbergraph_MTXButton) == 0x000008, "Wrong alignment on MTXButton_C_ExecuteUbergraph_MTXButton");
static_assert(sizeof(MTXButton_C_ExecuteUbergraph_MTXButton) == 0x000098, "Wrong size on MTXButton_C_ExecuteUbergraph_MTXButton");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, EntryPoint) == 0x000000, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_IsInZone_ReturnValue) == 0x000018, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, K2Node_CustomEvent_NewInfo) == 0x000030, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::K2Node_CustomEvent_NewInfo' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_GetContext_ReturnValue3) == 0x000048, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_GetLocalAccountInfo_Result) == 0x000050, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_GetLocalAccountInfo_Result' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, K2Node_ComponentBoundEvent_Button) == 0x000068, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000070, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, K2Node_CreateDelegate_OutputDelegate2) == 0x000078, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, K2Node_CustomEvent_bUsingGamepad) == 0x000088, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::K2Node_CustomEvent_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_GetUINavigationManager_ReturnValue) == 0x000090, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function MTXButton.MTXButton_C.HandleInputActionChnaged
// 0x0001 (0x0001 - 0x0000)
struct MTXButton_C_HandleInputActionChnaged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MTXButton_C_HandleInputActionChnaged) == 0x000001, "Wrong alignment on MTXButton_C_HandleInputActionChnaged");
static_assert(sizeof(MTXButton_C_HandleInputActionChnaged) == 0x000001, "Wrong size on MTXButton_C_HandleInputActionChnaged");
static_assert(offsetof(MTXButton_C_HandleInputActionChnaged, bUsingGamepad) == 0x000000, "Member 'MTXButton_C_HandleInputActionChnaged::bUsingGamepad' has a wrong offset!");

// Function MTXButton.MTXButton_C.BndEvt__VBucksButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MTXButton_C_BndEvt__VBucksButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button_0;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MTXButton_C_BndEvt__VBucksButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on MTXButton_C_BndEvt__VBucksButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(MTXButton_C_BndEvt__VBucksButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on MTXButton_C_BndEvt__VBucksButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(MTXButton_C_BndEvt__VBucksButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature, Button_0) == 0x000000, "Member 'MTXButton_C_BndEvt__VBucksButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature::Button_0' has a wrong offset!");

// Function MTXButton.MTXButton_C.HandleLocalAccountInfoChanged
// 0x0014 (0x0014 - 0x0000)
struct MTXButton_C_HandleLocalAccountInfoChanged final
{
public:
	struct FFortPrivateAccountInfo                NewInfo;                                           // 0x0000(0x0014)(Parm, NoDestructor)
};
static_assert(alignof(MTXButton_C_HandleLocalAccountInfoChanged) == 0x000004, "Wrong alignment on MTXButton_C_HandleLocalAccountInfoChanged");
static_assert(sizeof(MTXButton_C_HandleLocalAccountInfoChanged) == 0x000014, "Wrong size on MTXButton_C_HandleLocalAccountInfoChanged");
static_assert(offsetof(MTXButton_C_HandleLocalAccountInfoChanged, NewInfo) == 0x000000, "Member 'MTXButton_C_HandleLocalAccountInfoChanged::NewInfo' has a wrong offset!");

// Function MTXButton.MTXButton_C.UpdateAmount
// 0x0018 (0x0018 - 0x0000)
struct MTXButton_C_UpdateAmount final
{
public:
	struct FFortPrivateAccountInfo                FortPrivateAccountInfo;                            // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MTXButton_C_UpdateAmount) == 0x000004, "Wrong alignment on MTXButton_C_UpdateAmount");
static_assert(sizeof(MTXButton_C_UpdateAmount) == 0x000018, "Wrong size on MTXButton_C_UpdateAmount");
static_assert(offsetof(MTXButton_C_UpdateAmount, FortPrivateAccountInfo) == 0x000000, "Member 'MTXButton_C_UpdateAmount::FortPrivateAccountInfo' has a wrong offset!");
static_assert(offsetof(MTXButton_C_UpdateAmount, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000014, "Member 'MTXButton_C_UpdateAmount::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

// Function MTXButton.MTXButton_C.Get_Button_ToolTipWidget_0
// 0x0090 (0x0090 - 0x0000)
struct MTXButton_C_Get_Button_ToolTipWidget_0 final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue2;             // 0x0040(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue3;             // 0x0058(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0070(0x0018)()
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MTXButton_C_Get_Button_ToolTipWidget_0) == 0x000008, "Wrong alignment on MTXButton_C_Get_Button_ToolTipWidget_0");
static_assert(sizeof(MTXButton_C_Get_Button_ToolTipWidget_0) == 0x000090, "Wrong size on MTXButton_C_Get_Button_ToolTipWidget_0");
static_assert(offsetof(MTXButton_C_Get_Button_ToolTipWidget_0, ReturnValue) == 0x000000, "Member 'MTXButton_C_Get_Button_ToolTipWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_Get_Button_ToolTipWidget_0, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'MTXButton_C_Get_Button_ToolTipWidget_0::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_Get_Button_ToolTipWidget_0, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'MTXButton_C_Get_Button_ToolTipWidget_0::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MTXButton_C_Get_Button_ToolTipWidget_0, CallFunc_IsInZone_ReturnValue) == 0x000018, "Member 'MTXButton_C_Get_Button_ToolTipWidget_0::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_Get_Button_ToolTipWidget_0, CallFunc_IsUsingGamepad_ReturnValue) == 0x000019, "Member 'MTXButton_C_Get_Button_ToolTipWidget_0::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_Get_Button_ToolTipWidget_0, CallFunc_MakeLiteralText_ReturnValue) == 0x000020, "Member 'MTXButton_C_Get_Button_ToolTipWidget_0::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_Get_Button_ToolTipWidget_0, Temp_bool_Variable) == 0x000038, "Member 'MTXButton_C_Get_Button_ToolTipWidget_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MTXButton_C_Get_Button_ToolTipWidget_0, CallFunc_MakeLiteralText_ReturnValue2) == 0x000040, "Member 'MTXButton_C_Get_Button_ToolTipWidget_0::CallFunc_MakeLiteralText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MTXButton_C_Get_Button_ToolTipWidget_0, CallFunc_MakeLiteralText_ReturnValue3) == 0x000058, "Member 'MTXButton_C_Get_Button_ToolTipWidget_0::CallFunc_MakeLiteralText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MTXButton_C_Get_Button_ToolTipWidget_0, K2Node_Select_Default) == 0x000070, "Member 'MTXButton_C_Get_Button_ToolTipWidget_0::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MTXButton_C_Get_Button_ToolTipWidget_0, CallFunc_Create_Basic_Tooltip_Output) == 0x000088, "Member 'MTXButton_C_Get_Button_ToolTipWidget_0::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");

// Function MTXButton.MTXButton_C.UpdateState
// 0x0020 (0x0020 - 0x0000)
struct MTXButton_C_UpdateState final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MTXButton_C_UpdateState) == 0x000008, "Wrong alignment on MTXButton_C_UpdateState");
static_assert(sizeof(MTXButton_C_UpdateState) == 0x000020, "Wrong size on MTXButton_C_UpdateState");
static_assert(offsetof(MTXButton_C_UpdateState, Temp_byte_Variable) == 0x000000, "Member 'MTXButton_C_UpdateState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MTXButton_C_UpdateState, Temp_byte_Variable2) == 0x000001, "Member 'MTXButton_C_UpdateState::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(MTXButton_C_UpdateState, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'MTXButton_C_UpdateState::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_UpdateState, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'MTXButton_C_UpdateState::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MTXButton_C_UpdateState, CallFunc_IsUsingGamepad_ReturnValue) == 0x000018, "Member 'MTXButton_C_UpdateState::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_UpdateState, CallFunc_IsInZone_ReturnValue) == 0x000019, "Member 'MTXButton_C_UpdateState::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_UpdateState, Temp_bool_Variable) == 0x00001A, "Member 'MTXButton_C_UpdateState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MTXButton_C_UpdateState, K2Node_Select_Default) == 0x00001B, "Member 'MTXButton_C_UpdateState::K2Node_Select_Default' has a wrong offset!");

}

