#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MtxOffer_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MtxOffer_2.MtxOffer_2_C
// 0x0200 (0x0438 - 0x0238)
class UMtxOffer_2_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Embiggen;                                          // 0x0240(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Bonus_SizeBox;                                     // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonBuy;                                         // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_Bonus_T;                                // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BonusText;                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_Description;                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_PriceCents;                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_PriceDollars;                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_417;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_glow;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MovingBack;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MTX_Currency_Image;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   BuyItem;                                           // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FMtxPackage                            Package;                                           // 0x02C0(0x00A0)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         BaseOfferAmount;                                   // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   MtxOfferMouseEnter_EventDispatcher;                // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   MtxOfferMouseLeave_EventDispatcher;                // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UTexture2D*>                     CoinCollection;                                    // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	struct FMtxPackage                            Package_0;                                         // 0x0398(0x00A0)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_MtxOffer_2(int32 EntryPoint);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_3_On_Mouse_Hovered_Changed__DelegateSignature(bool Is_Hovered);
	void Construct();
	void BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_516_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MtxOffer_2_C">();
	}
	static class UMtxOffer_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMtxOffer_2_C>();
	}
};
static_assert(alignof(UMtxOffer_2_C) == 0x000008, "Wrong alignment on UMtxOffer_2_C");
static_assert(sizeof(UMtxOffer_2_C) == 0x000438, "Wrong size on UMtxOffer_2_C");
static_assert(offsetof(UMtxOffer_2_C, UberGraphFrame) == 0x000238, "Member 'UMtxOffer_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, Embiggen) == 0x000240, "Member 'UMtxOffer_2_C::Embiggen' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, Bonus_SizeBox) == 0x000248, "Member 'UMtxOffer_2_C::Bonus_SizeBox' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, ButtonBuy) == 0x000250, "Member 'UMtxOffer_2_C::ButtonBuy' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, CommonText_Bonus_T) == 0x000258, "Member 'UMtxOffer_2_C::CommonText_Bonus_T' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, CommonText_BonusText) == 0x000260, "Member 'UMtxOffer_2_C::CommonText_BonusText' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, CommonText_Description) == 0x000268, "Member 'UMtxOffer_2_C::CommonText_Description' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, CommonText_PriceCents) == 0x000270, "Member 'UMtxOffer_2_C::CommonText_PriceCents' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, CommonText_PriceDollars) == 0x000278, "Member 'UMtxOffer_2_C::CommonText_PriceDollars' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, Image_1) == 0x000280, "Member 'UMtxOffer_2_C::Image_1' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, Image_9) == 0x000288, "Member 'UMtxOffer_2_C::Image_9' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, Image_417) == 0x000290, "Member 'UMtxOffer_2_C::Image_417' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, Image_glow) == 0x000298, "Member 'UMtxOffer_2_C::Image_glow' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, MovingBack) == 0x0002A0, "Member 'UMtxOffer_2_C::MovingBack' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, MTX_Currency_Image) == 0x0002A8, "Member 'UMtxOffer_2_C::MTX_Currency_Image' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, BuyItem) == 0x0002B0, "Member 'UMtxOffer_2_C::BuyItem' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, Package) == 0x0002C0, "Member 'UMtxOffer_2_C::Package' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, BaseOfferAmount) == 0x000360, "Member 'UMtxOffer_2_C::BaseOfferAmount' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, MtxOfferMouseEnter_EventDispatcher) == 0x000368, "Member 'UMtxOffer_2_C::MtxOfferMouseEnter_EventDispatcher' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, MtxOfferMouseLeave_EventDispatcher) == 0x000378, "Member 'UMtxOffer_2_C::MtxOfferMouseLeave_EventDispatcher' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, CoinCollection) == 0x000388, "Member 'UMtxOffer_2_C::CoinCollection' has a wrong offset!");
static_assert(offsetof(UMtxOffer_2_C, Package_0) == 0x000398, "Member 'UMtxOffer_2_C::Package_0' has a wrong offset!");

}

