#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MtxOffer_2

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MtxOffer_2.MtxOffer_2_C.ExecuteUbergraph_MtxOffer_2
// 0x0250 (0x0250 - 0x0000)
struct MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button2;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FString                                 CallFunc_LeftChop_ReturnValue;                     // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_Right_ReturnValue;                        // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x00D8(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue2;              // 0x00F8(0x0018)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue4;           // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue3;              // 0x0118(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0130(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x0170(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x01B0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array3;                           // 0x01C0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x01D0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue3;                      // 0x01E8(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue2;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue3;          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue4;          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue5;          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue6;          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue7;          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue8;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Is_Hovered;             // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2) == 0x000008, "Wrong alignment on MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2");
static_assert(sizeof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2) == 0x000250, "Wrong size on MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, EntryPoint) == 0x000000, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, K2Node_ComponentBoundEvent_Button2) == 0x000008, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_Conv_TextToString_ReturnValue) == 0x000010, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_LeftChop_ReturnValue) == 0x000038, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_LeftChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, K2Node_MakeArray_Array) == 0x0000A0, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_Right_ReturnValue) == 0x0000B0, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_Right_ReturnValue' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_Format_ReturnValue) == 0x0000C0, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_Conv_StringToText_ReturnValue2) == 0x0000D8, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000F0, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_Conv_IntToText_ReturnValue2) == 0x0000F8, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_Conv_IntToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000110, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000111, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x000112, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_EqualEqual_IntInt_ReturnValue3) == 0x000113, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_EqualEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_EqualEqual_IntInt_ReturnValue4) == 0x000114, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_EqualEqual_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_Conv_IntToText_ReturnValue3) == 0x000118, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_Conv_IntToText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, K2Node_MakeStruct_FormatArgumentData2) == 0x000130, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, K2Node_MakeStruct_FormatArgumentData3) == 0x000170, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, K2Node_MakeArray_Array2) == 0x0001B0, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, K2Node_MakeArray_Array3) == 0x0001C0, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_Format_ReturnValue2) == 0x0001D0, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_Format_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_Format_ReturnValue3) == 0x0001E8, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_Format_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000200, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_GetDynamicMaterial_ReturnValue2) == 0x000208, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_GetDynamicMaterial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_GetDynamicMaterial_ReturnValue3) == 0x000210, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_GetDynamicMaterial_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_GetDynamicMaterial_ReturnValue4) == 0x000218, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_GetDynamicMaterial_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_GetDynamicMaterial_ReturnValue5) == 0x000220, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_GetDynamicMaterial_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_GetDynamicMaterial_ReturnValue6) == 0x000228, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_GetDynamicMaterial_ReturnValue6' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_GetDynamicMaterial_ReturnValue7) == 0x000230, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_GetDynamicMaterial_ReturnValue7' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, CallFunc_GetDynamicMaterial_ReturnValue8) == 0x000238, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::CallFunc_GetDynamicMaterial_ReturnValue8' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, K2Node_ComponentBoundEvent_Is_Hovered) == 0x000240, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::K2Node_ComponentBoundEvent_Is_Hovered' has a wrong offset!");
static_assert(offsetof(MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2, K2Node_ComponentBoundEvent_Button) == 0x000248, "Member 'MtxOffer_2_C_ExecuteUbergraph_MtxOffer_2::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function MtxOffer_2.MtxOffer_2_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MtxOffer_2_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MtxOffer_2_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on MtxOffer_2_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(MtxOffer_2_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on MtxOffer_2_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(MtxOffer_2_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'MtxOffer_2_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function MtxOffer_2.MtxOffer_2_C.BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_3_On Mouse Hovered Changed__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MtxOffer_2_C_BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_3_On_Mouse_Hovered_Changed__DelegateSignature final
{
public:
	bool                                          Is_Hovered;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MtxOffer_2_C_BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_3_On_Mouse_Hovered_Changed__DelegateSignature) == 0x000001, "Wrong alignment on MtxOffer_2_C_BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_3_On_Mouse_Hovered_Changed__DelegateSignature");
static_assert(sizeof(MtxOffer_2_C_BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_3_On_Mouse_Hovered_Changed__DelegateSignature) == 0x000001, "Wrong size on MtxOffer_2_C_BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_3_On_Mouse_Hovered_Changed__DelegateSignature");
static_assert(offsetof(MtxOffer_2_C_BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_3_On_Mouse_Hovered_Changed__DelegateSignature, Is_Hovered) == 0x000000, "Member 'MtxOffer_2_C_BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_3_On_Mouse_Hovered_Changed__DelegateSignature::Is_Hovered' has a wrong offset!");

// Function MtxOffer_2.MtxOffer_2_C.BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_516_FortBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MtxOffer_2_C_BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_516_FortBaseButtonClicked__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MtxOffer_2_C_BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_516_FortBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on MtxOffer_2_C_BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_516_FortBaseButtonClicked__DelegateSignature");
static_assert(sizeof(MtxOffer_2_C_BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_516_FortBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on MtxOffer_2_C_BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_516_FortBaseButtonClicked__DelegateSignature");
static_assert(offsetof(MtxOffer_2_C_BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_516_FortBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'MtxOffer_2_C_BndEvt__Purchase_Button_K2Node_ComponentBoundEvent_516_FortBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

}

