#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MtxStoreRoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MtxStoreRoot.MtxStoreRoot_C
// 0x0048 (0x0450 - 0x0408)
class UMtxStoreRoot_C final : public UFortActivatablePanel
{
public:
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(Transient, DuplicateTransient)
	class UIconTextButton_C*                      CancelButton;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_583;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMTXButton_C*                           MTXButton_465;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMtxOffersList_2_C*                     MtxOffersList_2;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AFort_Entry_Music_Controller_BP_C*      Fort_Entry_Music_Controller;                       // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        StoreSoundLoop;                                    // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MtxStoreRoot(int32 EntryPoint);
	void BndEvt__MtxOffersList_2_K2Node_ComponentBoundEvent_31_PurchaseComplete__DelegateSignature(bool bSuccess);
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_215_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void ClosePopup();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MtxStoreRoot_C">();
	}
	static class UMtxStoreRoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMtxStoreRoot_C>();
	}
};
static_assert(alignof(UMtxStoreRoot_C) == 0x000008, "Wrong alignment on UMtxStoreRoot_C");
static_assert(sizeof(UMtxStoreRoot_C) == 0x000450, "Wrong size on UMtxStoreRoot_C");
static_assert(offsetof(UMtxStoreRoot_C, UberGraphFrame) == 0x000410, "Member 'UMtxStoreRoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMtxStoreRoot_C, CancelButton) == 0x000418, "Member 'UMtxStoreRoot_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UMtxStoreRoot_C, Image_583) == 0x000420, "Member 'UMtxStoreRoot_C::Image_583' has a wrong offset!");
static_assert(offsetof(UMtxStoreRoot_C, Lightbox) == 0x000428, "Member 'UMtxStoreRoot_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UMtxStoreRoot_C, MTXButton_465) == 0x000430, "Member 'UMtxStoreRoot_C::MTXButton_465' has a wrong offset!");
static_assert(offsetof(UMtxStoreRoot_C, MtxOffersList_2) == 0x000438, "Member 'UMtxStoreRoot_C::MtxOffersList_2' has a wrong offset!");
static_assert(offsetof(UMtxStoreRoot_C, Fort_Entry_Music_Controller) == 0x000440, "Member 'UMtxStoreRoot_C::Fort_Entry_Music_Controller' has a wrong offset!");
static_assert(offsetof(UMtxStoreRoot_C, StoreSoundLoop) == 0x000448, "Member 'UMtxStoreRoot_C::StoreSoundLoop' has a wrong offset!");

}

