#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenu

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function OptionsMenu.OptionsMenu_C.ExecuteUbergraph_OptionsMenu
// 0x0220 (0x0220 - 0x0000)
struct OptionsMenu_C_ExecuteUbergraph_OptionsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_ActiveWidget;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ActiveWidgetIndex;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortOptionsTab*                        K2Node_DynamicCast_AsFort_Options_Tab;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTabGameOptions_C*                      K2Node_DynamicCast_AsTab_Game_Options;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTabAccountLinkage_C*                   K2Node_DynamicCast_AsTab_Account_Linkage;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTabGamePadConfig_C*                    K2Node_DynamicCast_AsTab_Game_Pad_Config;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTabVideoOptions_C*                     K2Node_DynamicCast_AsTab_Video_Options;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTabInputOptions_C*                     K2Node_DynamicCast_AsTab_Input_Options;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Accept_Input2;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Overlay_Text;                   // 0x0090(0x0018)()
	bool                                          K2Node_CustomEvent_Accept_Input;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00B0(0x0018)()
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortVideoOptions*                      K2Node_DynamicCast_AsFort_Video_Options;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Accept_Input, class FText Overlay_Text)> K2Node_CreateDelegate_OutputDelegate;              // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	class UFortOptionsTab*                        K2Node_DynamicCast_AsFort_Options_Tab2;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTabInputOptions_C*                     K2Node_DynamicCast_AsTab_Input_Options2;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTabVideoOptions_C*                     K2Node_DynamicCast_AsTab_Video_Options2;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Gamepad_Enabled)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bCursorModeEnabled)>      K2Node_CreateDelegate_OutputDelegate3;             // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_Gamepad_Enabled;                // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActiveTab_ReturnValue;                 // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTabButton_C*                       K2Node_DynamicCast_AsIcon_Tab_Button;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortOptionsTab*                        CallFunc_Array_Get_Item;                           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x01D8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Accept_Input)>            K2Node_CreateDelegate_OutputDelegate7;             // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Handle_Reset_PassThrough;                 // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Handle_Reset_PassThrough2;                // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu) == 0x000008, "Wrong alignment on OptionsMenu_C_ExecuteUbergraph_OptionsMenu");
static_assert(sizeof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu) == 0x000220, "Wrong size on OptionsMenu_C_ExecuteUbergraph_OptionsMenu");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, EntryPoint) == 0x000000, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_ComponentBoundEvent_ActiveWidget) == 0x000010, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_ComponentBoundEvent_ActiveWidget' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_ComponentBoundEvent_ActiveWidgetIndex) == 0x000018, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_ComponentBoundEvent_ActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsFort_Options_Tab) == 0x000020, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsFort_Options_Tab' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetChildrenCount_ReturnValue) == 0x00002C, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsTab_Game_Options) == 0x000030, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsTab_Game_Options' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess2) == 0x000038, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsTab_Account_Linkage) == 0x000040, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsTab_Account_Linkage' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess3) == 0x000048, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsTab_Game_Pad_Config) == 0x000050, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsTab_Game_Pad_Config' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess4) == 0x000058, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsTab_Video_Options) == 0x000060, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsTab_Video_Options' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess5) == 0x000068, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsTab_Input_Options) == 0x000070, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsTab_Input_Options' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess6) == 0x000078, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_int_Variable) == 0x00007C, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000080, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Add_IntInt_ReturnValue2) == 0x000084, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CustomEvent_Accept_Input2) == 0x000088, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CustomEvent_Accept_Input2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CustomEvent_Overlay_Text) == 0x000090, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CustomEvent_Overlay_Text' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CustomEvent_Accept_Input) == 0x0000A8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CustomEvent_Accept_Input' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_MakeLiteralText_ReturnValue) == 0x0000B0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_ComponentBoundEvent_Button3) == 0x0000C8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_ComponentBoundEvent_Button2) == 0x0000D0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x0000D8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x0000E0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsFort_Video_Options) == 0x0000E8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsFort_Video_Options' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess7) == 0x0000F0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetChildAt_ReturnValue) == 0x0000F8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000100, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsFort_Options_Tab2) == 0x000110, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsFort_Options_Tab2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess8) == 0x000118, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsTab_Input_Options2) == 0x000120, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsTab_Input_Options2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess9) == 0x000128, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsTab_Video_Options2) == 0x000130, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsTab_Video_Options2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess10) == 0x000138, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetContext_ReturnValue) == 0x000140, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_IsInZone_ReturnValue) == 0x000148, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate2) == 0x000150, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetContext_ReturnValue2) == 0x000160, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate3) == 0x000168, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate4) == 0x000178, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CustomEvent_Gamepad_Enabled) == 0x000188, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CustomEvent_Gamepad_Enabled' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_ComponentBoundEvent_TabId) == 0x000190, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_ComponentBoundEvent_TabButton) == 0x000198, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetActiveTab_ReturnValue) == 0x0001A0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetActiveTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsIcon_Tab_Button) == 0x0001A8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsIcon_Tab_Button' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess11) == 0x0001B0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess11' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001B1, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_BooleanAND_ReturnValue) == 0x0001B2, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_NotEqual_NameName_ReturnValue) == 0x0001B3, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetContext_ReturnValue3) == 0x0001B8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_BooleanOR_ReturnValue) == 0x0001C0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Array_Get_Item) == 0x0001C8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Array_Length_ReturnValue) == 0x0001D0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Less_IntInt_ReturnValue) == 0x0001D4, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate5) == 0x0001D8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_IsVisible_ReturnValue) == 0x0001E8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate6) == 0x0001F0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_ComponentBoundEvent_Button) == 0x000200, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate7) == 0x000208, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Handle_Reset_PassThrough) == 0x000218, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Handle_Reset_PassThrough' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Handle_Reset_PassThrough2) == 0x000219, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Handle_Reset_PassThrough2' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.BndEvt__LanguageOk_K2Node_ComponentBoundEvent_112_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenu_C_BndEvt__LanguageOk_K2Node_ComponentBoundEvent_112_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_BndEvt__LanguageOk_K2Node_ComponentBoundEvent_112_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenu_C_BndEvt__LanguageOk_K2Node_ComponentBoundEvent_112_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(OptionsMenu_C_BndEvt__LanguageOk_K2Node_ComponentBoundEvent_112_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on OptionsMenu_C_BndEvt__LanguageOk_K2Node_ComponentBoundEvent_112_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(OptionsMenu_C_BndEvt__LanguageOk_K2Node_ComponentBoundEvent_112_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'OptionsMenu_C_BndEvt__LanguageOk_K2Node_ComponentBoundEvent_112_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.Gamepad Changed
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenu_C_Gamepad_Changed final
{
public:
	bool                                          Gamepad_Enabled;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_Gamepad_Changed) == 0x000001, "Wrong alignment on OptionsMenu_C_Gamepad_Changed");
static_assert(sizeof(OptionsMenu_C_Gamepad_Changed) == 0x000001, "Wrong size on OptionsMenu_C_Gamepad_Changed");
static_assert(offsetof(OptionsMenu_C_Gamepad_Changed, Gamepad_Enabled) == 0x000000, "Member 'OptionsMenu_C_Gamepad_Changed::Gamepad_Enabled' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.BndEvt__VideoSettingsCancel_K2Node_ComponentBoundEvent_43_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenu_C_BndEvt__VideoSettingsCancel_K2Node_ComponentBoundEvent_43_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_BndEvt__VideoSettingsCancel_K2Node_ComponentBoundEvent_43_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenu_C_BndEvt__VideoSettingsCancel_K2Node_ComponentBoundEvent_43_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(OptionsMenu_C_BndEvt__VideoSettingsCancel_K2Node_ComponentBoundEvent_43_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on OptionsMenu_C_BndEvt__VideoSettingsCancel_K2Node_ComponentBoundEvent_43_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(OptionsMenu_C_BndEvt__VideoSettingsCancel_K2Node_ComponentBoundEvent_43_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'OptionsMenu_C_BndEvt__VideoSettingsCancel_K2Node_ComponentBoundEvent_43_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.BndEvt__VideoSettingsAccept_K2Node_ComponentBoundEvent_22_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenu_C_BndEvt__VideoSettingsAccept_K2Node_ComponentBoundEvent_22_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_BndEvt__VideoSettingsAccept_K2Node_ComponentBoundEvent_22_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenu_C_BndEvt__VideoSettingsAccept_K2Node_ComponentBoundEvent_22_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(OptionsMenu_C_BndEvt__VideoSettingsAccept_K2Node_ComponentBoundEvent_22_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on OptionsMenu_C_BndEvt__VideoSettingsAccept_K2Node_ComponentBoundEvent_22_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(OptionsMenu_C_BndEvt__VideoSettingsAccept_K2Node_ComponentBoundEvent_22_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'OptionsMenu_C_BndEvt__VideoSettingsAccept_K2Node_ComponentBoundEvent_22_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.Enable Overlay Video
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenu_C_Enable_Overlay_Video final
{
public:
	bool                                          Accept_Input_0;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_Enable_Overlay_Video) == 0x000001, "Wrong alignment on OptionsMenu_C_Enable_Overlay_Video");
static_assert(sizeof(OptionsMenu_C_Enable_Overlay_Video) == 0x000001, "Wrong size on OptionsMenu_C_Enable_Overlay_Video");
static_assert(offsetof(OptionsMenu_C_Enable_Overlay_Video, Accept_Input_0) == 0x000000, "Member 'OptionsMenu_C_Enable_Overlay_Video::Accept_Input_0' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.Enable Overlay Input
// 0x0020 (0x0020 - 0x0000)
struct OptionsMenu_C_Enable_Overlay_Input final
{
public:
	bool                                          Accept_Input_0;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Overlay_Text;                                      // 0x0008(0x0018)(Parm)
};
static_assert(alignof(OptionsMenu_C_Enable_Overlay_Input) == 0x000008, "Wrong alignment on OptionsMenu_C_Enable_Overlay_Input");
static_assert(sizeof(OptionsMenu_C_Enable_Overlay_Input) == 0x000020, "Wrong size on OptionsMenu_C_Enable_Overlay_Input");
static_assert(offsetof(OptionsMenu_C_Enable_Overlay_Input, Accept_Input_0) == 0x000000, "Member 'OptionsMenu_C_Enable_Overlay_Input::Accept_Input_0' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Enable_Overlay_Input, Overlay_Text) == 0x000008, "Member 'OptionsMenu_C_Enable_Overlay_Input::Overlay_Text' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.BndEvt__CurrentTabSwitcher_K2Node_ComponentBoundEvent_13_OnActiveWidgetChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct OptionsMenu_C_BndEvt__CurrentTabSwitcher_K2Node_ComponentBoundEvent_13_OnActiveWidgetChanged__DelegateSignature final
{
public:
	class UWidget*                                ActiveWidget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveWidgetIndex;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_BndEvt__CurrentTabSwitcher_K2Node_ComponentBoundEvent_13_OnActiveWidgetChanged__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenu_C_BndEvt__CurrentTabSwitcher_K2Node_ComponentBoundEvent_13_OnActiveWidgetChanged__DelegateSignature");
static_assert(sizeof(OptionsMenu_C_BndEvt__CurrentTabSwitcher_K2Node_ComponentBoundEvent_13_OnActiveWidgetChanged__DelegateSignature) == 0x000010, "Wrong size on OptionsMenu_C_BndEvt__CurrentTabSwitcher_K2Node_ComponentBoundEvent_13_OnActiveWidgetChanged__DelegateSignature");
static_assert(offsetof(OptionsMenu_C_BndEvt__CurrentTabSwitcher_K2Node_ComponentBoundEvent_13_OnActiveWidgetChanged__DelegateSignature, ActiveWidget) == 0x000000, "Member 'OptionsMenu_C_BndEvt__CurrentTabSwitcher_K2Node_ComponentBoundEvent_13_OnActiveWidgetChanged__DelegateSignature::ActiveWidget' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_BndEvt__CurrentTabSwitcher_K2Node_ComponentBoundEvent_13_OnActiveWidgetChanged__DelegateSignature, ActiveWidgetIndex) == 0x000008, "Member 'OptionsMenu_C_BndEvt__CurrentTabSwitcher_K2Node_ComponentBoundEvent_13_OnActiveWidgetChanged__DelegateSignature::ActiveWidgetIndex' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.Initialize
// 0x0098 (0x0098 - 0x0000)
struct OptionsMenu_C_Initialize final
{
public:
	EFortAccountLinkingUIConfig                   CallFunc_GetAccountLinkingUIConfig_ReturnValue;    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAccountLinkingEnabled_ReturnValue;      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShowGameOptions_ReturnValue;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	bool                                          CallFunc_HasWidgets_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortOptionsTab*                        K2Node_DynamicCast_AsFort_Options_Tab;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable2;                               // 0x0058(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShowInputOptions_ReturnValue;             // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0078(0x0018)()
	bool                                          CallFunc_ShowVideoOptions_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShowControllerOptions_ReturnValue;        // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_Initialize) == 0x000008, "Wrong alignment on OptionsMenu_C_Initialize");
static_assert(sizeof(OptionsMenu_C_Initialize) == 0x000098, "Wrong size on OptionsMenu_C_Initialize");
static_assert(offsetof(OptionsMenu_C_Initialize, CallFunc_GetAccountLinkingUIConfig_ReturnValue) == 0x000000, "Member 'OptionsMenu_C_Initialize::CallFunc_GetAccountLinkingUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, CallFunc_IsAccountLinkingEnabled_ReturnValue) == 0x000001, "Member 'OptionsMenu_C_Initialize::CallFunc_IsAccountLinkingEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000002, "Member 'OptionsMenu_C_Initialize::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'OptionsMenu_C_Initialize::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, CallFunc_GetPlatformName_ReturnValue) == 0x000008, "Member 'OptionsMenu_C_Initialize::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000018, "Member 'OptionsMenu_C_Initialize::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, CallFunc_ShowGameOptions_ReturnValue) == 0x000019, "Member 'OptionsMenu_C_Initialize::CallFunc_ShowGameOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, Temp_text_Variable) == 0x000020, "Member 'OptionsMenu_C_Initialize::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, CallFunc_HasWidgets_ReturnValue) == 0x000038, "Member 'OptionsMenu_C_Initialize::CallFunc_HasWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x000040, "Member 'OptionsMenu_C_Initialize::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, K2Node_DynamicCast_AsFort_Options_Tab) == 0x000048, "Member 'OptionsMenu_C_Initialize::K2Node_DynamicCast_AsFort_Options_Tab' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'OptionsMenu_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, Temp_text_Variable2) == 0x000058, "Member 'OptionsMenu_C_Initialize::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, Temp_bool_Variable) == 0x000070, "Member 'OptionsMenu_C_Initialize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, CallFunc_ShowInputOptions_ReturnValue) == 0x000071, "Member 'OptionsMenu_C_Initialize::CallFunc_ShowInputOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, K2Node_Select_Default) == 0x000078, "Member 'OptionsMenu_C_Initialize::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, CallFunc_ShowVideoOptions_ReturnValue) == 0x000090, "Member 'OptionsMenu_C_Initialize::CallFunc_ShowVideoOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Initialize, CallFunc_ShowControllerOptions_ReturnValue) == 0x000091, "Member 'OptionsMenu_C_Initialize::CallFunc_ShowControllerOptions_ReturnValue' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.OnPreviewMouseButtonDown
// 0x0320 (0x0320 - 0x0000)
struct OptionsMenu_C_OnPreviewMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0168(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0180(0x00B8)()
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0240(0x00B8)()
	int32                                         Temp_int_Variable;                                 // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTabInputOptions_C*                     K2Node_DynamicCast_AsTab_Input_Options;            // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31A[0x2];                                      // 0x031A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_OnPreviewMouseButtonDown) == 0x000008, "Wrong alignment on OptionsMenu_C_OnPreviewMouseButtonDown");
static_assert(sizeof(OptionsMenu_C_OnPreviewMouseButtonDown) == 0x000320, "Wrong size on OptionsMenu_C_OnPreviewMouseButtonDown");
static_assert(offsetof(OptionsMenu_C_OnPreviewMouseButtonDown, MyGeometry) == 0x000000, "Member 'OptionsMenu_C_OnPreviewMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnPreviewMouseButtonDown, MouseEvent) == 0x000038, "Member 'OptionsMenu_C_OnPreviewMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnPreviewMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'OptionsMenu_C_OnPreviewMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnPreviewMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000168, "Member 'OptionsMenu_C_OnPreviewMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnPreviewMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000180, "Member 'OptionsMenu_C_OnPreviewMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnPreviewMouseButtonDown, CallFunc_IsVisible_ReturnValue) == 0x000238, "Member 'OptionsMenu_C_OnPreviewMouseButtonDown::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnPreviewMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000240, "Member 'OptionsMenu_C_OnPreviewMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnPreviewMouseButtonDown, Temp_int_Variable) == 0x0002F8, "Member 'OptionsMenu_C_OnPreviewMouseButtonDown::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnPreviewMouseButtonDown, CallFunc_GetChildAt_ReturnValue) == 0x000300, "Member 'OptionsMenu_C_OnPreviewMouseButtonDown::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnPreviewMouseButtonDown, CallFunc_GetChildrenCount_ReturnValue) == 0x000308, "Member 'OptionsMenu_C_OnPreviewMouseButtonDown::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnPreviewMouseButtonDown, K2Node_DynamicCast_AsTab_Input_Options) == 0x000310, "Member 'OptionsMenu_C_OnPreviewMouseButtonDown::K2Node_DynamicCast_AsTab_Input_Options' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnPreviewMouseButtonDown, K2Node_DynamicCast_bSuccess) == 0x000318, "Member 'OptionsMenu_C_OnPreviewMouseButtonDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnPreviewMouseButtonDown, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000319, "Member 'OptionsMenu_C_OnPreviewMouseButtonDown::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnPreviewMouseButtonDown, CallFunc_Add_IntInt_ReturnValue) == 0x00031C, "Member 'OptionsMenu_C_OnPreviewMouseButtonDown::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.OnMouseWheel
// 0x0310 (0x0310 - 0x0000)
struct OptionsMenu_C_OnMouseWheel final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	float                                         CallFunc_PointerEvent_GetWheelDelta_ReturnValue;   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0170(0x00B8)()
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0230(0x00B8)()
	int32                                         Temp_int_Variable;                                 // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTabInputOptions_C*                     K2Node_DynamicCast_AsTab_Input_Options;            // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30A[0x2];                                      // 0x030A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_OnMouseWheel) == 0x000008, "Wrong alignment on OptionsMenu_C_OnMouseWheel");
static_assert(sizeof(OptionsMenu_C_OnMouseWheel) == 0x000310, "Wrong size on OptionsMenu_C_OnMouseWheel");
static_assert(offsetof(OptionsMenu_C_OnMouseWheel, MyGeometry) == 0x000000, "Member 'OptionsMenu_C_OnMouseWheel::MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnMouseWheel, MouseEvent) == 0x000038, "Member 'OptionsMenu_C_OnMouseWheel::MouseEvent' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnMouseWheel, ReturnValue) == 0x0000B0, "Member 'OptionsMenu_C_OnMouseWheel::ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnMouseWheel, CallFunc_PointerEvent_GetWheelDelta_ReturnValue) == 0x000168, "Member 'OptionsMenu_C_OnMouseWheel::CallFunc_PointerEvent_GetWheelDelta_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnMouseWheel, CallFunc_Handled_ReturnValue) == 0x000170, "Member 'OptionsMenu_C_OnMouseWheel::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnMouseWheel, CallFunc_Less_FloatFloat_ReturnValue) == 0x000228, "Member 'OptionsMenu_C_OnMouseWheel::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnMouseWheel, CallFunc_IsVisible_ReturnValue) == 0x000229, "Member 'OptionsMenu_C_OnMouseWheel::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
