#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkTierWidgetNew

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PerkTierWidgetNew.PerkTierWidgetNew_C
// 0x0030 (0x02B8 - 0x0288)
class UPerkTierWidgetNew_C final : public UFortPerkTierWidget_NUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(Transient, DuplicateTransient)
	class UVerticalBox*                           PerkList;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkWidget_C*                          PerkWidget;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkWidget_C*                          PerkWidget_0;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkWidget_C*                          PerkWidget_1;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIncludeName;                                      // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bFirstPerkDone;                                    // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIncludeDescription;                               // 0x02B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	EFortBrushSize                                IconSize;                                          // 0x02B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PerkTierWidgetNew(int32 EntryPoint);
	void OnGeneratePerk(const struct FFortUIPerk& Perk, class UFortPerkWidget_NUI* PerkWidget_0);
	void Construct();
	void InitializeSettings(bool bIncludeName_0, bool bIncludeDescription_0, EFortBrushSize IconSize_0, const struct FFortUIPerkTier& FortPerkTier_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PerkTierWidgetNew_C">();
	}
	static class UPerkTierWidgetNew_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerkTierWidgetNew_C>();
	}
};
static_assert(alignof(UPerkTierWidgetNew_C) == 0x000008, "Wrong alignment on UPerkTierWidgetNew_C");
static_assert(sizeof(UPerkTierWidgetNew_C) == 0x0002B8, "Wrong size on UPerkTierWidgetNew_C");
static_assert(offsetof(UPerkTierWidgetNew_C, UberGraphFrame) == 0x000288, "Member 'UPerkTierWidgetNew_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPerkTierWidgetNew_C, PerkList) == 0x000290, "Member 'UPerkTierWidgetNew_C::PerkList' has a wrong offset!");
static_assert(offsetof(UPerkTierWidgetNew_C, PerkWidget) == 0x000298, "Member 'UPerkTierWidgetNew_C::PerkWidget' has a wrong offset!");
static_assert(offsetof(UPerkTierWidgetNew_C, PerkWidget_0) == 0x0002A0, "Member 'UPerkTierWidgetNew_C::PerkWidget_0' has a wrong offset!");
static_assert(offsetof(UPerkTierWidgetNew_C, PerkWidget_1) == 0x0002A8, "Member 'UPerkTierWidgetNew_C::PerkWidget_1' has a wrong offset!");
static_assert(offsetof(UPerkTierWidgetNew_C, bIncludeName) == 0x0002B0, "Member 'UPerkTierWidgetNew_C::bIncludeName' has a wrong offset!");
static_assert(offsetof(UPerkTierWidgetNew_C, bFirstPerkDone) == 0x0002B1, "Member 'UPerkTierWidgetNew_C::bFirstPerkDone' has a wrong offset!");
static_assert(offsetof(UPerkTierWidgetNew_C, bIncludeDescription) == 0x0002B2, "Member 'UPerkTierWidgetNew_C::bIncludeDescription' has a wrong offset!");
static_assert(offsetof(UPerkTierWidgetNew_C, IconSize) == 0x0002B3, "Member 'UPerkTierWidgetNew_C::IconSize' has a wrong offset!");

}

