#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressModalWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgressModalWidget.ProgressModalWidget_C
// 0x00E8 (0x04F0 - 0x0408)
class UProgressModalWidget_C final : public UFortActivatablePanel
{
public:
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(Transient, DuplicateTransient)
	class ULightbox_C*                            Lightbox;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressWidget_C*                      ProgressWidget;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x0428(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Description;                                       // 0x0440(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateBrush                            Icon;                                              // 0x0458(0x0090)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bIntroOutrEnabled;                                 // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bAutoInitialize;                                   // 0x04E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bFocusSelf;                                        // 0x04EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bConsumeAnalogInput;                               // 0x04EB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_ProgressModalWidget(int32 EntryPoint);
	void Destruct();
	void OnBeginOutro();
	void OnBeginIntro();
	void HandleOutroEnded();
	void HandleIntroEnded();
	void Construct();
	void Initialize();
	void SetTitle(const class FText& Title_0);
	void SetDescription(const class FText& Description_0);
	void SetIcon(const struct FSlateBrush& Icon_0);
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgressModalWidget_C">();
	}
	static class UProgressModalWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressModalWidget_C>();
	}
};
static_assert(alignof(UProgressModalWidget_C) == 0x000008, "Wrong alignment on UProgressModalWidget_C");
static_assert(sizeof(UProgressModalWidget_C) == 0x0004F0, "Wrong size on UProgressModalWidget_C");
static_assert(offsetof(UProgressModalWidget_C, UberGraphFrame) == 0x000410, "Member 'UProgressModalWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProgressModalWidget_C, Lightbox) == 0x000418, "Member 'UProgressModalWidget_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UProgressModalWidget_C, ProgressWidget) == 0x000420, "Member 'UProgressModalWidget_C::ProgressWidget' has a wrong offset!");
static_assert(offsetof(UProgressModalWidget_C, Title) == 0x000428, "Member 'UProgressModalWidget_C::Title' has a wrong offset!");
static_assert(offsetof(UProgressModalWidget_C, Description) == 0x000440, "Member 'UProgressModalWidget_C::Description' has a wrong offset!");
static_assert(offsetof(UProgressModalWidget_C, Icon) == 0x000458, "Member 'UProgressModalWidget_C::Icon' has a wrong offset!");
static_assert(offsetof(UProgressModalWidget_C, bIntroOutrEnabled) == 0x0004E8, "Member 'UProgressModalWidget_C::bIntroOutrEnabled' has a wrong offset!");
static_assert(offsetof(UProgressModalWidget_C, bAutoInitialize) == 0x0004E9, "Member 'UProgressModalWidget_C::bAutoInitialize' has a wrong offset!");
static_assert(offsetof(UProgressModalWidget_C, bFocusSelf) == 0x0004EA, "Member 'UProgressModalWidget_C::bFocusSelf' has a wrong offset!");
static_assert(offsetof(UProgressModalWidget_C, bConsumeAnalogInput) == 0x0004EB, "Member 'UProgressModalWidget_C::bConsumeAnalogInput' has a wrong offset!");

}

