#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuantitySelector

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuantitySelector.QuantitySelector_C
// 0x0780 (0x0B88 - 0x0408)
class UQuantitySelector_C final : public UFortActivatablePanel
{
public:
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       AdditionalInfo;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CancelButton;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ConfirmButton;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                CurrentAmount;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 ItemCard;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                MaxAmount;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      MaxButton;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAnalogSlider*                          ValueSlider;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       WindowTitle;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentValue;                                      // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxValue;                                          // 0x046C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnButtonClickedDispatcher;                         // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnStackValueChangedDispatcher;                     // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UFortItem*                              Item;                                              // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSliderStyle                           SliderStyle_MouseKeyboard;                         // 0x0498(0x0250)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSliderStyle                           SliderStyle_XboxOne;                               // 0x06E8(0x0250)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSliderStyle                           SliderStyle_PS4;                                   // 0x0938(0x0250)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_QuantitySelector(int32 EntryPoint);
	void HandleChangeInputMode(bool bUsingGamepad);
	void Construct();
	void OnDeactivated();
	void OnActivated();
	void BndEvt__MaxButton_K2Node_ComponentBoundEvent_343_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__AnalogSlider_0_K2Node_ComponentBoundEvent_434_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_166_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_86_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetSplitData(int32 StartingCount, int32 MaximumCount, class UFortItem* Item_0, const class FText& TitleText, const class FText& ButtonText, const class FText& AdditionalInfoText);
	void SetAdditionalText(const class FText& AdditionalInfoText);
	void CloseSelector();
	void HandleMaxPressed(bool* PassThrough);
	void HandleTransferPressed(bool* PassThrough);
	void HandleCancelPressed(bool* PassThrough);
	void SliderValueChanged();
	void SetupForInputMode(bool IsUsingGamepad);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuantitySelector_C">();
	}
	static class UQuantitySelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuantitySelector_C>();
	}
};
static_assert(alignof(UQuantitySelector_C) == 0x000008, "Wrong alignment on UQuantitySelector_C");
static_assert(sizeof(UQuantitySelector_C) == 0x000B88, "Wrong size on UQuantitySelector_C");
static_assert(offsetof(UQuantitySelector_C, UberGraphFrame) == 0x000410, "Member 'UQuantitySelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, AdditionalInfo) == 0x000418, "Member 'UQuantitySelector_C::AdditionalInfo' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, CancelButton) == 0x000420, "Member 'UQuantitySelector_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, ConfirmButton) == 0x000428, "Member 'UQuantitySelector_C::ConfirmButton' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, CurrentAmount) == 0x000430, "Member 'UQuantitySelector_C::CurrentAmount' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, ItemCard) == 0x000438, "Member 'UQuantitySelector_C::ItemCard' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, Lightbox) == 0x000440, "Member 'UQuantitySelector_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, MaxAmount) == 0x000448, "Member 'UQuantitySelector_C::MaxAmount' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, MaxButton) == 0x000450, "Member 'UQuantitySelector_C::MaxButton' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, ValueSlider) == 0x000458, "Member 'UQuantitySelector_C::ValueSlider' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, WindowTitle) == 0x000460, "Member 'UQuantitySelector_C::WindowTitle' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, CurrentValue) == 0x000468, "Member 'UQuantitySelector_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, MaxValue) == 0x00046C, "Member 'UQuantitySelector_C::MaxValue' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, OnButtonClickedDispatcher) == 0x000470, "Member 'UQuantitySelector_C::OnButtonClickedDispatcher' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, OnStackValueChangedDispatcher) == 0x000480, "Member 'UQuantitySelector_C::OnStackValueChangedDispatcher' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, Item) == 0x000490, "Member 'UQuantitySelector_C::Item' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, SliderStyle_MouseKeyboard) == 0x000498, "Member 'UQuantitySelector_C::SliderStyle_MouseKeyboard' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, SliderStyle_XboxOne) == 0x0006E8, "Member 'UQuantitySelector_C::SliderStyle_XboxOne' has a wrong offset!");
static_assert(offsetof(UQuantitySelector_C, SliderStyle_PS4) == 0x000938, "Member 'UQuantitySelector_C::SliderStyle_PS4' has a wrong offset!");

}

