#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RatingWidget_NUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RatingWidget_NUI.RatingWidget_NUI_C
// 0x15C8 (0x1800 - 0x0238)
class URatingWidget_NUI_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UCommonNumericTextBlock*                CommonNumericTextRatingValue;                      // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         RatingValue;                                       // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       UniqueId;                                          // 0x0268(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         InterpDuration;                                    // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMultiSizeBrush                    MBrush_Silhouette;                                 // 0x0288(0x0360)(Edit, BlueprintVisible)
	struct FFortMultiSizeBrush                    MBrush_Chamfer;                                    // 0x05E8(0x0360)(Edit, BlueprintVisible)
	struct FFortMultiSizeBrush                    MBrush_Shadow;                                     // 0x0948(0x0360)(Edit, BlueprintVisible)
	struct FFortMultiSizeBrush                    MBrush_Icon;                                       // 0x0CA8(0x0360)(Edit, BlueprintVisible)
	bool                                          OverrideDefaultColor;                              // 0x1008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1009[0x3];                                     // 0x1009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color_Light;                                       // 0x100C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Medium;                                      // 0x101C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Dark;                                        // 0x102C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Default_Color_Light;                               // 0x103C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Default_Color_Medium;                              // 0x104C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Default_Color_Dark;                                // 0x105C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106C[0x4];                                     // 0x106C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMultiSizeBrush                    MBrush_Icon_Alt;                                   // 0x1070(0x0360)(Edit, BlueprintVisible)
	bool                                          UseAlternateIcon;                                  // 0x13D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_13D1[0x7];                                     // 0x13D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMultiSizeBrush                    MBrush_Shadow_Alt;                                 // 0x13D8(0x0360)(Edit, BlueprintVisible)
	struct FFortMultiSizeMargin                   MMargin_Alt;                                       // 0x1738(0x0060)(Edit, BlueprintVisible, NoDestructor)
	struct FFortMultiSizeMargin                   MMargin;                                           // 0x1798(0x0060)(Edit, BlueprintVisible, NoDestructor)
	bool                                          ShowTeamPowerRating;                               // 0x17F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EFortBrushSize                                Brush_Size;                                        // 0x17F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseRatingValuesFromPlayer;                        // 0x17FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_RatingWidget_NUI(int32 EntryPoint);
	void PlayerStateChanged(const struct FFortTeamMemberInfo& PlayerInfo);
	void Construct();
	void PlayerInfoChanged(const struct FUniqueNetIdRepl& UniqueId_0);
	void PreConstruct(bool IsDesignTime);
	void Update_Rating_Value(int32 Rating);
	void Update();
	void Set_Unique_ID(const struct FUniqueNetIdRepl& ID);
	void Update_From_Unique_ID();
	void Set_Texture2D_Parameter_From_Multi_Size_Brush(class UMaterialInstanceDynamic* Mid, class FName Parameter, const struct FFortMultiSizeBrush& MBrush);
	void Override_Default_Color_Set(bool Override, const struct FLinearColor& Light_Color, const struct FLinearColor& Medium_Color, const struct FLinearColor& Dark_Color);
	void SetShouldShowTeamPowerRating(bool ShowTeamRating);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RatingWidget_NUI_C">();
	}
	static class URatingWidget_NUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URatingWidget_NUI_C>();
	}
};
static_assert(alignof(URatingWidget_NUI_C) == 0x000008, "Wrong alignment on URatingWidget_NUI_C");
static_assert(sizeof(URatingWidget_NUI_C) == 0x001800, "Wrong size on URatingWidget_NUI_C");
static_assert(offsetof(URatingWidget_NUI_C, UberGraphFrame) == 0x000238, "Member 'URatingWidget_NUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, CommonNumericTextRatingValue) == 0x000240, "Member 'URatingWidget_NUI_C::CommonNumericTextRatingValue' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, HorizontalBox) == 0x000248, "Member 'URatingWidget_NUI_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, Image_0) == 0x000250, "Member 'URatingWidget_NUI_C::Image_0' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, SizeBox) == 0x000258, "Member 'URatingWidget_NUI_C::SizeBox' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, RatingValue) == 0x000260, "Member 'URatingWidget_NUI_C::RatingValue' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, UniqueId) == 0x000268, "Member 'URatingWidget_NUI_C::UniqueId' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, InterpDuration) == 0x000280, "Member 'URatingWidget_NUI_C::InterpDuration' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, MBrush_Silhouette) == 0x000288, "Member 'URatingWidget_NUI_C::MBrush_Silhouette' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, MBrush_Chamfer) == 0x0005E8, "Member 'URatingWidget_NUI_C::MBrush_Chamfer' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, MBrush_Shadow) == 0x000948, "Member 'URatingWidget_NUI_C::MBrush_Shadow' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, MBrush_Icon) == 0x000CA8, "Member 'URatingWidget_NUI_C::MBrush_Icon' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, OverrideDefaultColor) == 0x001008, "Member 'URatingWidget_NUI_C::OverrideDefaultColor' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, Color_Light) == 0x00100C, "Member 'URatingWidget_NUI_C::Color_Light' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, Color_Medium) == 0x00101C, "Member 'URatingWidget_NUI_C::Color_Medium' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, Color_Dark) == 0x00102C, "Member 'URatingWidget_NUI_C::Color_Dark' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, Default_Color_Light) == 0x00103C, "Member 'URatingWidget_NUI_C::Default_Color_Light' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, Default_Color_Medium) == 0x00104C, "Member 'URatingWidget_NUI_C::Default_Color_Medium' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, Default_Color_Dark) == 0x00105C, "Member 'URatingWidget_NUI_C::Default_Color_Dark' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, MBrush_Icon_Alt) == 0x001070, "Member 'URatingWidget_NUI_C::MBrush_Icon_Alt' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, UseAlternateIcon) == 0x0013D0, "Member 'URatingWidget_NUI_C::UseAlternateIcon' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, MBrush_Shadow_Alt) == 0x0013D8, "Member 'URatingWidget_NUI_C::MBrush_Shadow_Alt' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, MMargin_Alt) == 0x001738, "Member 'URatingWidget_NUI_C::MMargin_Alt' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, MMargin) == 0x001798, "Member 'URatingWidget_NUI_C::MMargin' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, ShowTeamPowerRating) == 0x0017F8, "Member 'URatingWidget_NUI_C::ShowTeamPowerRating' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, Brush_Size) == 0x0017F9, "Member 'URatingWidget_NUI_C::Brush_Size' has a wrong offset!");
static_assert(offsetof(URatingWidget_NUI_C, bUseRatingValuesFromPlayer) == 0x0017FA, "Member 'URatingWidget_NUI_C::bUseRatingValuesFromPlayer' has a wrong offset!");

}

