#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScrollingTextButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ScrollingTextButton.ScrollingTextButton_C
// 0x00F0 (0x0990 - 0x08A0)
class UScrollingTextButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08A0(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x08A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x08B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftSideImage;                                     // 0x08B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x08C0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateBrush                            IconBrush;                                         // 0x08D8(0x0090)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UClass*                                 ControllerInputStyle;                              // 0x0968(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 MouseKeyboardStyle;                                // 0x0970(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    ButtonClickAction;                                 // 0x0978(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	EHorizontalAlignment                          ContentAlignment;                                  // 0x0988(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMouseKeyboardStyleSet;                            // 0x0989(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ScrollingTextButton(int32 EntryPoint);
	void Construct();
	void OnActionComplete();
	void OnActionProgress(float HeldPercent);
	void OnTriggeredInputActionChanged(const struct FDataTableRowHandle& NewTriggeredAction);
	void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);
	void PreConstruct(bool IsDesignTime);
	void OnCurrentTextStyleChanged();
	void Set_Text(const class FText& ButtonText_0);
	void Set_Icon(const struct FSlateBrush& IconBrush_0);
	void InitializeButton();
	void UpdateTextAndStyle(bool bUsingGamepad);
	void SetControllerStyle(class UClass* ControllerInputStyle_0);
	void UpdateText();
	void UpdateStyle(bool UsingGamepad);
	void SetMouseKeyboardStyle(class UClass* ControllerInputStyle_0);
	void UpdateContentAlignment();
	void SetContentAlignment(EHorizontalAlignment ContentAlignment_0);
	void UpdateTextStyle();
	void SetInitialMouseKeyboardStyle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ScrollingTextButton_C">();
	}
	static class UScrollingTextButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScrollingTextButton_C>();
	}
};
static_assert(alignof(UScrollingTextButton_C) == 0x000008, "Wrong alignment on UScrollingTextButton_C");
static_assert(sizeof(UScrollingTextButton_C) == 0x000990, "Wrong size on UScrollingTextButton_C");
static_assert(offsetof(UScrollingTextButton_C, UberGraphFrame) == 0x0008A0, "Member 'UScrollingTextButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UScrollingTextButton_C, CenterButtonTextWidget) == 0x0008A8, "Member 'UScrollingTextButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UScrollingTextButton_C, ContentBorder) == 0x0008B0, "Member 'UScrollingTextButton_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UScrollingTextButton_C, LeftSideImage) == 0x0008B8, "Member 'UScrollingTextButton_C::LeftSideImage' has a wrong offset!");
static_assert(offsetof(UScrollingTextButton_C, ButtonText) == 0x0008C0, "Member 'UScrollingTextButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UScrollingTextButton_C, IconBrush) == 0x0008D8, "Member 'UScrollingTextButton_C::IconBrush' has a wrong offset!");
static_assert(offsetof(UScrollingTextButton_C, ControllerInputStyle) == 0x000968, "Member 'UScrollingTextButton_C::ControllerInputStyle' has a wrong offset!");
static_assert(offsetof(UScrollingTextButton_C, MouseKeyboardStyle) == 0x000970, "Member 'UScrollingTextButton_C::MouseKeyboardStyle' has a wrong offset!");
static_assert(offsetof(UScrollingTextButton_C, ButtonClickAction) == 0x000978, "Member 'UScrollingTextButton_C::ButtonClickAction' has a wrong offset!");
static_assert(offsetof(UScrollingTextButton_C, ContentAlignment) == 0x000988, "Member 'UScrollingTextButton_C::ContentAlignment' has a wrong offset!");
static_assert(offsetof(UScrollingTextButton_C, bMouseKeyboardStyleSet) == 0x000989, "Member 'UScrollingTextButton_C::bMouseKeyboardStyleSet' has a wrong offset!");

}

