#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleSquadSlotButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SimpleSquadSlotButton.SimpleSquadSlotButton_C
// 0x0100 (0x09F8 - 0x08F8)
class USimpleSquadSlotButton_C final : public UFortSquadSlotSelectorButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08F8(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          CommonBorder_0;                                    // 0x0900(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageSlotType;                                     // 0x0908(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageSlotTypeShadow;                               // 0x0910(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        InputActionOverride;                               // 0x0918(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNormalBangWrapper_C*                   NormalBangWrapper;                                 // 0x0920(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TooltipBody;                                       // 0x0928(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   TooltipHeader;                                     // 0x0940(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          ShowSubTypeIcon;                                   // 0x0958(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_959[0x7];                                      // 0x0959(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SubTypeIcon;                                       // 0x0960(0x0090)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bSuppressTooltip;                                  // 0x09F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	EFortItemCardSize                             SlottedItemCardSize;                               // 0x09F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_SimpleSquadSlotButton(int32 EntryPoint);
	void OnSelected();
	void SquadSlotWidgetUpdated();
	void HandlePostDifferentSquadSlotSetBP();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	class UWidget* GetSimpleSquadButtonTooltipWidget();
	void Update_Bang_State();
	void Mark_Squad_Slot_Seen_State();
	void IsSlotEmpty(bool* isEmpty);
	void Update_SubType_Icon_Image();
	void Update_SubType_Icon_Glow(bool GlowIcon);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SimpleSquadSlotButton_C">();
	}
	static class USimpleSquadSlotButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleSquadSlotButton_C>();
	}
};
static_assert(alignof(USimpleSquadSlotButton_C) == 0x000008, "Wrong alignment on USimpleSquadSlotButton_C");
static_assert(sizeof(USimpleSquadSlotButton_C) == 0x0009F8, "Wrong size on USimpleSquadSlotButton_C");
static_assert(offsetof(USimpleSquadSlotButton_C, UberGraphFrame) == 0x0008F8, "Member 'USimpleSquadSlotButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USimpleSquadSlotButton_C, CommonBorder_0) == 0x000900, "Member 'USimpleSquadSlotButton_C::CommonBorder_0' has a wrong offset!");
static_assert(offsetof(USimpleSquadSlotButton_C, ImageSlotType) == 0x000908, "Member 'USimpleSquadSlotButton_C::ImageSlotType' has a wrong offset!");
static_assert(offsetof(USimpleSquadSlotButton_C, ImageSlotTypeShadow) == 0x000910, "Member 'USimpleSquadSlotButton_C::ImageSlotTypeShadow' has a wrong offset!");
static_assert(offsetof(USimpleSquadSlotButton_C, InputActionOverride) == 0x000918, "Member 'USimpleSquadSlotButton_C::InputActionOverride' has a wrong offset!");
static_assert(offsetof(USimpleSquadSlotButton_C, NormalBangWrapper) == 0x000920, "Member 'USimpleSquadSlotButton_C::NormalBangWrapper' has a wrong offset!");
static_assert(offsetof(USimpleSquadSlotButton_C, TooltipBody) == 0x000928, "Member 'USimpleSquadSlotButton_C::TooltipBody' has a wrong offset!");
static_assert(offsetof(USimpleSquadSlotButton_C, TooltipHeader) == 0x000940, "Member 'USimpleSquadSlotButton_C::TooltipHeader' has a wrong offset!");
static_assert(offsetof(USimpleSquadSlotButton_C, ShowSubTypeIcon) == 0x000958, "Member 'USimpleSquadSlotButton_C::ShowSubTypeIcon' has a wrong offset!");
static_assert(offsetof(USimpleSquadSlotButton_C, SubTypeIcon) == 0x000960, "Member 'USimpleSquadSlotButton_C::SubTypeIcon' has a wrong offset!");
static_assert(offsetof(USimpleSquadSlotButton_C, bSuppressTooltip) == 0x0009F0, "Member 'USimpleSquadSlotButton_C::bSuppressTooltip' has a wrong offset!");
static_assert(offsetof(USimpleSquadSlotButton_C, SlottedItemCardSize) == 0x0009F1, "Member 'USimpleSquadSlotButton_C::SlottedItemCardSize' has a wrong offset!");

}

