#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SurvivorTraitsDetailWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function SurvivorTraitsDetailWidget.SurvivorTraitsDetailWidget_C.ExecuteUbergraph_SurvivorTraitsDetailWidget
// 0x0790 (0x0790 - 0x0000)
struct SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TryGetCategory_OutCategoryDisplayName;    // 0x0010(0x0018)()
	bool                                          CallFunc_TryGetCategory_OutHasIcon;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMultiSizeBrush                    CallFunc_TryGetCategory_OutCategoryIconBrush;      // 0x0030(0x0360)()
	bool                                          CallFunc_TryGetCategory_ReturnValue;               // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TryGetCategory_OutCategoryDisplayName2;   // 0x0398(0x0018)()
	bool                                          CallFunc_TryGetCategory_OutHasIcon2;               // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMultiSizeBrush                    CallFunc_TryGetCategory_OutCategoryIconBrush2;     // 0x03B8(0x0360)()
	bool                                          CallFunc_TryGetCategory_ReturnValue2;              // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0719(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x071A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x071B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71C[0x4];                                      // 0x071C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0720(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0738(0x0018)()
	bool                                          Temp_bool_Variable3;                               // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_751[0x7];                                      // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHero*                              K2Node_DynamicCast_AsFort_Hero;                    // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0761(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_762[0x6];                                      // 0x0762(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select3_Default;                            // 0x0768(0x0018)()
	class UFortWorker*                            K2Node_DynamicCast_AsFort_Worker;                  // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0789(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTemporaryItem_ReturnValue;              // 0x078A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x078B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x078C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x078D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget) == 0x000008, "Wrong alignment on SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget");
static_assert(sizeof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget) == 0x000790, "Wrong size on SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, EntryPoint) == 0x000000, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_bool_Variable) == 0x000004, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_byte_Variable) == 0x000005, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_byte_Variable2) == 0x000006, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_bool_Variable2) == 0x000007, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_byte_Variable3) == 0x000008, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_byte_Variable4) == 0x000009, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_byte_Variable5) == 0x00000A, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_TryGetCategory_OutCategoryDisplayName) == 0x000010, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_TryGetCategory_OutCategoryDisplayName' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_TryGetCategory_OutHasIcon) == 0x000028, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_TryGetCategory_OutHasIcon' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_TryGetCategory_OutCategoryIconBrush) == 0x000030, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_TryGetCategory_OutCategoryIconBrush' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_TryGetCategory_ReturnValue) == 0x000390, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_TryGetCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_TryGetCategory_OutCategoryDisplayName2) == 0x000398, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_TryGetCategory_OutCategoryDisplayName2' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_TryGetCategory_OutHasIcon2) == 0x0003B0, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_TryGetCategory_OutHasIcon2' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_TryGetCategory_OutCategoryIconBrush2) == 0x0003B8, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_TryGetCategory_OutCategoryIconBrush2' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_TryGetCategory_ReturnValue2) == 0x000718, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_TryGetCategory_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000719, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, K2Node_Select_Default) == 0x00071A, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, K2Node_Select2_Default) == 0x00071B, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_text_Variable) == 0x000720, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_text_Variable2) == 0x000738, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_bool_Variable3) == 0x000750, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, K2Node_DynamicCast_AsFort_Hero) == 0x000758, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::K2Node_DynamicCast_AsFort_Hero' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, K2Node_DynamicCast_bSuccess) == 0x000760, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_Not_PreBool_ReturnValue2) == 0x000761, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, K2Node_Select3_Default) == 0x000768, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, K2Node_DynamicCast_AsFort_Worker) == 0x000780, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::K2Node_DynamicCast_AsFort_Worker' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, K2Node_DynamicCast_bSuccess2) == 0x000788, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_BooleanAND_ReturnValue) == 0x000789, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_IsTemporaryItem_ReturnValue) == 0x00078A, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_IsTemporaryItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_byte_Variable6) == 0x00078B, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_bool_Variable4) == 0x00078C, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, K2Node_Select4_Default) == 0x00078D, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::K2Node_Select4_Default' has a wrong offset!");

}

