#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SurvivorSquadBonusTraitsDetailWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SurvivorSquadBonusTraitsDetailWidget.SurvivorSquadBonusTraitsDetailWidget_C
// 0x0068 (0x0328 - 0x02C0)
class USurvivorSquadBonusTraitsDetailWidget_C final : public UFortSquadSlotSurvivorTraitMatchesDetailWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 LeaderMatchesSquadTypeImageIndicator;              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MatchesLeaderPersonalityImageIndicator;            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        PersonalityTraitValueWidgetSwitcher;               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemCategoryIndicator*             SecondaryCategoryIndicator;                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                SetBonusMatchCountText;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SetBonusMatchesBox;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                SetBonusSizeText;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                SubordinatePersonalityMatchCountNumericText;       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SubordinatePersonalityMatchesBox;                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemCategoryIndicator*             TertiaryCategoryIndicator;                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        TertiaryTraitValueWidgetSwitcher;                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextTertiararyHeader;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SurvivorSquadBonusTraitsDetailWidget(int32 EntryPoint);
	void HandleTraitValuesUpdatedBP();
	void HandlePostDifferentSquadSlotSetBP();
	void HandlePostDifferentItemToDetailSet();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SurvivorSquadBonusTraitsDetailWidget_C">();
	}
	static class USurvivorSquadBonusTraitsDetailWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USurvivorSquadBonusTraitsDetailWidget_C>();
	}
};
static_assert(alignof(USurvivorSquadBonusTraitsDetailWidget_C) == 0x000008, "Wrong alignment on USurvivorSquadBonusTraitsDetailWidget_C");
static_assert(sizeof(USurvivorSquadBonusTraitsDetailWidget_C) == 0x000328, "Wrong size on USurvivorSquadBonusTraitsDetailWidget_C");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, UberGraphFrame) == 0x0002C0, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, LeaderMatchesSquadTypeImageIndicator) == 0x0002C8, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::LeaderMatchesSquadTypeImageIndicator' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, MatchesLeaderPersonalityImageIndicator) == 0x0002D0, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::MatchesLeaderPersonalityImageIndicator' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, PersonalityTraitValueWidgetSwitcher) == 0x0002D8, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::PersonalityTraitValueWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, SecondaryCategoryIndicator) == 0x0002E0, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::SecondaryCategoryIndicator' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, SetBonusMatchCountText) == 0x0002E8, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::SetBonusMatchCountText' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, SetBonusMatchesBox) == 0x0002F0, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::SetBonusMatchesBox' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, SetBonusSizeText) == 0x0002F8, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::SetBonusSizeText' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, SubordinatePersonalityMatchCountNumericText) == 0x000300, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::SubordinatePersonalityMatchCountNumericText' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, SubordinatePersonalityMatchesBox) == 0x000308, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::SubordinatePersonalityMatchesBox' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, TertiaryCategoryIndicator) == 0x000310, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::TertiaryCategoryIndicator' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, TertiaryTraitValueWidgetSwitcher) == 0x000318, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::TertiaryTraitValueWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, TextTertiararyHeader) == 0x000320, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::TextTertiararyHeader' has a wrong offset!");

}

