#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabAudioOptions

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function TabAudioOptions.TabAudioOptions_C.ExecuteUbergraph_TabAudioOptions
// 0x0030 (0x0030 - 0x0000)
struct TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Slider_Value4;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value3;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value2;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index4;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index3;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index2;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions) == 0x000004, "Wrong alignment on TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions");
static_assert(sizeof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions) == 0x000030, "Wrong size on TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, EntryPoint) == 0x000000, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::EntryPoint' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Selected_Index) == 0x000004, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Selected_Index' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, CallFunc_Conv_IntToBool_ReturnValue) == 0x000008, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Slider_Value4) == 0x00000C, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Slider_Value4' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Slider_Value3) == 0x000010, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Slider_Value3' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Slider_Value2) == 0x000014, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Slider_Value2' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Slider_Value) == 0x000018, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Slider_Value' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Selected_Index4) == 0x00001C, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Selected_Index4' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, CallFunc_Conv_IntToBool_ReturnValue2) == 0x000020, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::CallFunc_Conv_IntToBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Selected_Index3) == 0x000024, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Selected_Index3' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Selected_Index2) == 0x000028, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Selected_Index2' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, CallFunc_Conv_IntToBool_ReturnValue3) == 0x00002C, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::CallFunc_Conv_IntToBool_ReturnValue3' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__VoiceChatPushToTalk_K2Node_ComponentBoundEvent_36_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__VoiceChatPushToTalk_K2Node_ComponentBoundEvent_36_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__VoiceChatPushToTalk_K2Node_ComponentBoundEvent_36_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__VoiceChatPushToTalk_K2Node_ComponentBoundEvent_36_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__VoiceChatPushToTalk_K2Node_ComponentBoundEvent_36_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__VoiceChatPushToTalk_K2Node_ComponentBoundEvent_36_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__VoiceChatPushToTalk_K2Node_ComponentBoundEvent_36_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__VoiceChatPushToTalk_K2Node_ComponentBoundEvent_36_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__VoiceChatEnable_K2Node_ComponentBoundEvent_18_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__VoiceChatEnable_K2Node_ComponentBoundEvent_18_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__VoiceChatEnable_K2Node_ComponentBoundEvent_18_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__VoiceChatEnable_K2Node_ComponentBoundEvent_18_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__VoiceChatEnable_K2Node_ComponentBoundEvent_18_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__VoiceChatEnable_K2Node_ComponentBoundEvent_18_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__VoiceChatEnable_K2Node_ComponentBoundEvent_18_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__VoiceChatEnable_K2Node_ComponentBoundEvent_18_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__Quality_K2Node_ComponentBoundEvent_43_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__Quality_K2Node_ComponentBoundEvent_43_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__Quality_K2Node_ComponentBoundEvent_43_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__Quality_K2Node_ComponentBoundEvent_43_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__Quality_K2Node_ComponentBoundEvent_43_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__Quality_K2Node_ComponentBoundEvent_43_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__Quality_K2Node_ComponentBoundEvent_43_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__Quality_K2Node_ComponentBoundEvent_43_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__Subtitles_K2Node_ComponentBoundEvent_45_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__Subtitles_K2Node_ComponentBoundEvent_45_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__Subtitles_K2Node_ComponentBoundEvent_45_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__Subtitles_K2Node_ComponentBoundEvent_45_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__Subtitles_K2Node_ComponentBoundEvent_45_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__Subtitles_K2Node_ComponentBoundEvent_45_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__Subtitles_K2Node_ComponentBoundEvent_45_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__Subtitles_K2Node_ComponentBoundEvent_45_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__ChatVolume_K2Node_ComponentBoundEvent_15_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__ChatVolume_K2Node_ComponentBoundEvent_15_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__ChatVolume_K2Node_ComponentBoundEvent_15_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__ChatVolume_K2Node_ComponentBoundEvent_15_SliderChanged__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__ChatVolume_K2Node_ComponentBoundEvent_15_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__ChatVolume_K2Node_ComponentBoundEvent_15_SliderChanged__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__ChatVolume_K2Node_ComponentBoundEvent_15_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__ChatVolume_K2Node_ComponentBoundEvent_15_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__DialogVolume_K2Node_ComponentBoundEvent_11_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__DialogVolume_K2Node_ComponentBoundEvent_11_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__DialogVolume_K2Node_ComponentBoundEvent_11_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__DialogVolume_K2Node_ComponentBoundEvent_11_SliderChanged__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__DialogVolume_K2Node_ComponentBoundEvent_11_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__DialogVolume_K2Node_ComponentBoundEvent_11_SliderChanged__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__DialogVolume_K2Node_ComponentBoundEvent_11_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__DialogVolume_K2Node_ComponentBoundEvent_11_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__MusicVolume_K2Node_ComponentBoundEvent_2_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__MusicVolume_K2Node_ComponentBoundEvent_2_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__MusicVolume_K2Node_ComponentBoundEvent_2_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__MusicVolume_K2Node_ComponentBoundEvent_2_SliderChanged__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__MusicVolume_K2Node_ComponentBoundEvent_2_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__MusicVolume_K2Node_ComponentBoundEvent_2_SliderChanged__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__MusicVolume_K2Node_ComponentBoundEvent_2_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__MusicVolume_K2Node_ComponentBoundEvent_2_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__SoundFXVolume_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__SoundFXVolume_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__SoundFXVolume_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__SoundFXVolume_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__SoundFXVolume_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__SoundFXVolume_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__SoundFXVolume_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__SoundFXVolume_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.Update Data
// 0x0100 (0x0100 - 0x0000)
struct TabAudioOptions_C_Update_Data final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable3;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetVoiceChatPTTEnabled_ReturnValue;       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetVoiceChatEnabled_ReturnValue;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetQuality_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0020(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue2;             // 0x0038(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue3;             // 0x0050(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue4;             // 0x0068(0x0018)()
	bool                                          Temp_bool_Variable2;                               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSubtitlesEnabled_ReturnValue;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select2_Default;                            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetChatVolumeValue_ReturnValue;           // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDialogVolumeValue_ReturnValue;         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSoundFXVolumeValue_ReturnValue;        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMusicVolumeValue_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue5;             // 0x00A0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue6;             // 0x00B8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue7;             // 0x00D0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue8;             // 0x00E8(0x0018)()
};
static_assert(alignof(TabAudioOptions_C_Update_Data) == 0x000008, "Wrong alignment on TabAudioOptions_C_Update_Data");
static_assert(sizeof(TabAudioOptions_C_Update_Data) == 0x000100, "Wrong size on TabAudioOptions_C_Update_Data");
static_assert(offsetof(TabAudioOptions_C_Update_Data, Temp_int_Variable) == 0x000000, "Member 'TabAudioOptions_C_Update_Data::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, Temp_int_Variable2) == 0x000004, "Member 'TabAudioOptions_C_Update_Data::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, Temp_bool_Variable) == 0x000008, "Member 'TabAudioOptions_C_Update_Data::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, Temp_int_Variable3) == 0x00000C, "Member 'TabAudioOptions_C_Update_Data::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, Temp_int_Variable4) == 0x000010, "Member 'TabAudioOptions_C_Update_Data::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetVoiceChatPTTEnabled_ReturnValue) == 0x000014, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetVoiceChatPTTEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetVoiceChatEnabled_ReturnValue) == 0x000015, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetVoiceChatEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetQuality_ReturnValue) == 0x000018, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, K2Node_Select_Default) == 0x00001C, "Member 'TabAudioOptions_C_Update_Data::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue) == 0x000020, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue2) == 0x000038, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue3) == 0x000050, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue4) == 0x000068, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue4' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, Temp_bool_Variable2) == 0x000080, "Member 'TabAudioOptions_C_Update_Data::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetSubtitlesEnabled_ReturnValue) == 0x000081, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetSubtitlesEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, K2Node_Select2_Default) == 0x000084, "Member 'TabAudioOptions_C_Update_Data::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_Conv_BoolToInt_ReturnValue) == 0x000088, "Member 'TabAudioOptions_C_Update_Data::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetChatVolumeValue_ReturnValue) == 0x00008C, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetChatVolumeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetDialogVolumeValue_ReturnValue) == 0x000090, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetDialogVolumeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetSoundFXVolumeValue_ReturnValue) == 0x000094, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetSoundFXVolumeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetMusicVolumeValue_ReturnValue) == 0x000098, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetMusicVolumeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue5) == 0x0000A0, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue5' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue6) == 0x0000B8, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue6' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue7) == 0x0000D0, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue7' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue8) == 0x0000E8, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue8' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.InitializeData
// 0x0110 (0x0110 - 0x0000)
struct TabAudioOptions_C_InitializeData final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS4Platform_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue2;             // 0x0030(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue3;             // 0x0048(0x0018)()
	TArray<class FText>                           K2Node_MakeArray_Array2;                           // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue4;             // 0x0070(0x0018)()
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShowChatVolume_ReturnValue;               // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShowQuality_ReturnValue;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue5;             // 0x0090(0x0018)()
	TArray<class FText>                           K2Node_MakeArray_Array3;                           // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue6;             // 0x00B8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue7;             // 0x00D0(0x0018)()
	TArray<class FText>                           K2Node_MakeArray_Array4;                           // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue8;             // 0x00F8(0x0018)()
};
static_assert(alignof(TabAudioOptions_C_InitializeData) == 0x000008, "Wrong alignment on TabAudioOptions_C_InitializeData");
static_assert(sizeof(TabAudioOptions_C_InitializeData) == 0x000110, "Wrong size on TabAudioOptions_C_InitializeData");
static_assert(offsetof(TabAudioOptions_C_InitializeData, Temp_byte_Variable) == 0x000000, "Member 'TabAudioOptions_C_InitializeData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, CallFunc_IsPS4Platform_ReturnValue) == 0x000001, "Member 'TabAudioOptions_C_InitializeData::CallFunc_IsPS4Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, CallFunc_IsXboxPlatform_ReturnValue) == 0x000002, "Member 'TabAudioOptions_C_InitializeData::CallFunc_IsXboxPlatform_ReturnValue' has a wrong offset!");
