#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TooltipHeroBonuses

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function TooltipHeroBonuses.TooltipHeroBonuses_C.ExecuteUbergraph_TooltipHeroBonuses
// 0x0140 (0x0140 - 0x0000)
struct TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULegacyPerkWidget_C*                    CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortUIPerk                            CallFunc_Array_Get_Item;                           // 0x0030(0x0088)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00CC(0x0010)(NoDestructor)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortUIPerk>                    CallFunc_GetSupportBonusPerks_SupportBonusPerks;   // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GetSupportBonusPerks_ReturnValue;         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULegacyPerkWidget_C*                    CallFunc_Create_ReturnValue2;                      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select2_Default;                            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin2;                         // 0x012C(0x0010)(NoDestructor)
};
static_assert(alignof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses) == 0x000008, "Wrong alignment on TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses");
static_assert(sizeof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses) == 0x000140, "Wrong size on TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, EntryPoint) == 0x000000, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::EntryPoint' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, Temp_bool_Variable) == 0x000004, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, Temp_int_Array_Index_Variable) == 0x000010, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, CallFunc_Create_ReturnValue) == 0x000020, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, Temp_int_Variable) == 0x000028, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, CallFunc_Array_Get_Item) == 0x000030, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, CallFunc_Less_IntInt_ReturnValue) == 0x0000BC, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000C0, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, Temp_int_Variable2) == 0x0000C8, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, K2Node_MakeStruct_Margin) == 0x0000CC, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, CallFunc_GetContext_ReturnValue) == 0x0000E0, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, CallFunc_GetOwningPlayer_ReturnValue2) == 0x0000E8, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, CallFunc_GetSupportBonusPerks_SupportBonusPerks) == 0x0000F0, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::CallFunc_GetSupportBonusPerks_SupportBonusPerks' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, CallFunc_GetSupportBonusPerks_ReturnValue) == 0x000100, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::CallFunc_GetSupportBonusPerks_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, CallFunc_Create_ReturnValue2) == 0x000108, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000110, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, Temp_bool_Variable2) == 0x000118, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, Temp_float_Variable) == 0x00011C, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, K2Node_Select_Default) == 0x000120, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, Temp_float_Variable2) == 0x000124, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, K2Node_Select2_Default) == 0x000128, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses, K2Node_MakeStruct_Margin2) == 0x00012C, "Member 'TooltipHeroBonuses_C_ExecuteUbergraph_TooltipHeroBonuses::K2Node_MakeStruct_Margin2' has a wrong offset!");

}

