#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TT_Generic_AdrenalineRush

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function TT_Generic_AdrenalineRush.TT_Generic_AdrenalineRush_C.InitializeAbilityInstanceInternal
// 0x0020 (0x0020 - 0x0000)
struct TT_Generic_AdrenalineRush_C_InitializeAbilityInstanceInternal final
{
public:
	const class UGameplayAbility*                 AbilityInstance;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortTooltipContext*              Context;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGA_Generic_AdrenalineRush_C*           K2Node_DynamicCast_AsGA_Generic_Adrenaline_Rush;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TT_Generic_AdrenalineRush_C_InitializeAbilityInstanceInternal) == 0x000008, "Wrong alignment on TT_Generic_AdrenalineRush_C_InitializeAbilityInstanceInternal");
static_assert(sizeof(TT_Generic_AdrenalineRush_C_InitializeAbilityInstanceInternal) == 0x000020, "Wrong size on TT_Generic_AdrenalineRush_C_InitializeAbilityInstanceInternal");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_InitializeAbilityInstanceInternal, AbilityInstance) == 0x000000, "Member 'TT_Generic_AdrenalineRush_C_InitializeAbilityInstanceInternal::AbilityInstance' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_InitializeAbilityInstanceInternal, Context) == 0x000008, "Member 'TT_Generic_AdrenalineRush_C_InitializeAbilityInstanceInternal::Context' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_InitializeAbilityInstanceInternal, K2Node_DynamicCast_AsGA_Generic_Adrenaline_Rush) == 0x000010, "Member 'TT_Generic_AdrenalineRush_C_InitializeAbilityInstanceInternal::K2Node_DynamicCast_AsGA_Generic_Adrenaline_Rush' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_InitializeAbilityInstanceInternal, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'TT_Generic_AdrenalineRush_C_InitializeAbilityInstanceInternal::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function TT_Generic_AdrenalineRush.TT_Generic_AdrenalineRush_C.GetTextForTokenFromAbilityInstanceInternal
// 0x0150 (0x0150 - 0x0000)
struct TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal final
{
public:
	const class UGameplayAbility*                 AbilityInstance;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	const class UFortTooltipContext*              Context;                                           // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Token;                                             // 0x0018(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class FText                                   OutText;                                           // 0x0020(0x0018)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGA_Generic_AdrenalineRush_C*           AdrenalineRush;                                    // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGA_Generic_AdrenalineRush_C*           K2Node_DynamicCast_AsGA_Generic_Adrenaline_Rush;   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0060(0x0018)()
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0080(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x00B0(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue2;                       // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x00D0(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue2;              // 0x00E8(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0100(0x0018)()
	class FText                                   Temp_text_Variable4;                               // 0x0118(0x0018)()
	bool                                          Temp_bool_Variable2;                               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select2_Default;                            // 0x0138(0x0018)()
};
static_assert(alignof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal) == 0x000008, "Wrong alignment on TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal");
static_assert(sizeof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal) == 0x000150, "Wrong size on TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, AbilityInstance) == 0x000000, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::AbilityInstance' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, Tag) == 0x000008, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::Tag' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, Context) == 0x000010, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::Context' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, Token) == 0x000018, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::Token' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, OutText) == 0x000020, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::OutText' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, ReturnValue) == 0x000038, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::ReturnValue' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, AdrenalineRush) == 0x000040, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::AdrenalineRush' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000048, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, K2Node_DynamicCast_AsGA_Generic_Adrenaline_Rush) == 0x000050, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::K2Node_DynamicCast_AsGA_Generic_Adrenaline_Rush' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, Temp_text_Variable) == 0x000060, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, CallFunc_Round_ReturnValue) == 0x000078, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, CallFunc_Conv_IntToText_ReturnValue) == 0x000080, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, CallFunc_Conv_FloatToText_ReturnValue) == 0x000098, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, Temp_text_Variable2) == 0x0000B0, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, Temp_bool_Variable) == 0x0000C8, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, CallFunc_Round_ReturnValue2) == 0x0000CC, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::CallFunc_Round_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, K2Node_Select_Default) == 0x0000D0, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, CallFunc_Conv_IntToText_ReturnValue2) == 0x0000E8, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::CallFunc_Conv_IntToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, Temp_text_Variable3) == 0x000100, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, Temp_text_Variable4) == 0x000118, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::Temp_text_Variable4' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, Temp_bool_Variable2) == 0x000130, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal, K2Node_Select2_Default) == 0x000138, "Member 'TT_Generic_AdrenalineRush_C_GetTextForTokenFromAbilityInstanceInternal::K2Node_Select2_Default' has a wrong offset!");

// Function TT_Generic_AdrenalineRush.TT_Generic_AdrenalineRush_C.GetApplicationTag
// 0x0028 (0x0028 - 0x0000)
struct TT_Generic_AdrenalineRush_C_GetApplicationTag final
{
public:
	const class UGameplayAbility*                 AbilityInstance;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           OutTag;                                            // 0x0008(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGA_Generic_AdrenalineRush_C*           K2Node_DynamicCast_AsGA_Generic_Adrenaline_Rush;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TT_Generic_AdrenalineRush_C_GetApplicationTag) == 0x000008, "Wrong alignment on TT_Generic_AdrenalineRush_C_GetApplicationTag");
static_assert(sizeof(TT_Generic_AdrenalineRush_C_GetApplicationTag) == 0x000028, "Wrong size on TT_Generic_AdrenalineRush_C_GetApplicationTag");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetApplicationTag, AbilityInstance) == 0x000000, "Member 'TT_Generic_AdrenalineRush_C_GetApplicationTag::AbilityInstance' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetApplicationTag, OutTag) == 0x000008, "Member 'TT_Generic_AdrenalineRush_C_GetApplicationTag::OutTag' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetApplicationTag, ReturnValue) == 0x000010, "Member 'TT_Generic_AdrenalineRush_C_GetApplicationTag::ReturnValue' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetApplicationTag, K2Node_DynamicCast_AsGA_Generic_Adrenaline_Rush) == 0x000018, "Member 'TT_Generic_AdrenalineRush_C_GetApplicationTag::K2Node_DynamicCast_AsGA_Generic_Adrenaline_Rush' has a wrong offset!");
static_assert(offsetof(TT_Generic_AdrenalineRush_C_GetApplicationTag, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'TT_Generic_AdrenalineRush_C_GetApplicationTag::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

