#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VaultCharacterPlacementHelper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass VaultCharacterPlacementHelper.VaultCharacterPlacementHelper_C
// 0x0028 (0x03B0 - 0x0388)
class AVaultCharacterPlacementHelper_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   CharacterPlacement;                                // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   NewEventDispatcher_0;                              // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_VaultCharacterPlacementHelper(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VaultCharacterPlacementHelper_C">();
	}
	static class AVaultCharacterPlacementHelper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVaultCharacterPlacementHelper_C>();
	}
};
static_assert(alignof(AVaultCharacterPlacementHelper_C) == 0x000008, "Wrong alignment on AVaultCharacterPlacementHelper_C");
static_assert(sizeof(AVaultCharacterPlacementHelper_C) == 0x0003B0, "Wrong size on AVaultCharacterPlacementHelper_C");
static_assert(offsetof(AVaultCharacterPlacementHelper_C, UberGraphFrame) == 0x000388, "Member 'AVaultCharacterPlacementHelper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AVaultCharacterPlacementHelper_C, CharacterPlacement) == 0x000390, "Member 'AVaultCharacterPlacementHelper_C::CharacterPlacement' has a wrong offset!");
static_assert(offsetof(AVaultCharacterPlacementHelper_C, Root) == 0x000398, "Member 'AVaultCharacterPlacementHelper_C::Root' has a wrong offset!");
static_assert(offsetof(AVaultCharacterPlacementHelper_C, NewEventDispatcher_0) == 0x0003A0, "Member 'AVaultCharacterPlacementHelper_C::NewEventDispatcher_0' has a wrong offset!");

}

