#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: View3DModel

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function View3DModel.View3DModel_C.ExecuteUbergraph_View3DModel
// 0x0030 (0x0030 - 0x0000)
struct View3DModel_C_ExecuteUbergraph_View3DModel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(View3DModel_C_ExecuteUbergraph_View3DModel) == 0x000008, "Wrong alignment on View3DModel_C_ExecuteUbergraph_View3DModel");
static_assert(sizeof(View3DModel_C_ExecuteUbergraph_View3DModel) == 0x000030, "Wrong size on View3DModel_C_ExecuteUbergraph_View3DModel");
static_assert(offsetof(View3DModel_C_ExecuteUbergraph_View3DModel, EntryPoint) == 0x000000, "Member 'View3DModel_C_ExecuteUbergraph_View3DModel::EntryPoint' has a wrong offset!");
static_assert(offsetof(View3DModel_C_ExecuteUbergraph_View3DModel, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'View3DModel_C_ExecuteUbergraph_View3DModel::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(View3DModel_C_ExecuteUbergraph_View3DModel, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'View3DModel_C_ExecuteUbergraph_View3DModel::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(View3DModel_C_ExecuteUbergraph_View3DModel, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'View3DModel_C_ExecuteUbergraph_View3DModel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function View3DModel.View3DModel_C.HandleBack
// 0x0010 (0x0010 - 0x0000)
struct View3DModel_C_HandleBack final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(View3DModel_C_HandleBack) == 0x000008, "Wrong alignment on View3DModel_C_HandleBack");
static_assert(sizeof(View3DModel_C_HandleBack) == 0x000010, "Wrong size on View3DModel_C_HandleBack");
static_assert(offsetof(View3DModel_C_HandleBack, PassThrough) == 0x000000, "Member 'View3DModel_C_HandleBack::PassThrough' has a wrong offset!");
static_assert(offsetof(View3DModel_C_HandleBack, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'View3DModel_C_HandleBack::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

}

