#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WebPurchase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WebPurchase.WebPurchase_C
// 0x0028 (0x0408 - 0x03E0)
class UWebPurchase_C final : public UCommonActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(Transient, DuplicateTransient)
	class UCircularThrobber*                      Throbber;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                WebContent;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    BackAction;                                        // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_WebPurchase(int32 EntryPoint);
	void OnActivated();
	void Display(class UWidget* WebWidget, const class FString& AttemptedMTXOfferId);
	void Dismiss();
	void BindDelegates();
	void HandleBack(bool* bPassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WebPurchase_C">();
	}
	static class UWebPurchase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWebPurchase_C>();
	}
};
static_assert(alignof(UWebPurchase_C) == 0x000008, "Wrong alignment on UWebPurchase_C");
static_assert(sizeof(UWebPurchase_C) == 0x000408, "Wrong size on UWebPurchase_C");
static_assert(offsetof(UWebPurchase_C, UberGraphFrame) == 0x0003E0, "Member 'UWebPurchase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWebPurchase_C, Throbber) == 0x0003E8, "Member 'UWebPurchase_C::Throbber' has a wrong offset!");
static_assert(offsetof(UWebPurchase_C, WebContent) == 0x0003F0, "Member 'UWebPurchase_C::WebContent' has a wrong offset!");
static_assert(offsetof(UWebPurchase_C, BackAction) == 0x0003F8, "Member 'UWebPurchase_C::BackAction' has a wrong offset!");

}

