#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: XpBoostDailyBonus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass XpBoostDailyBonus.XpBoostDailyBonus_C
// 0x0020 (0x0250 - 0x0230)
class UXpBoostDailyBonus_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       Boost;                                             // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortSZAwareImage*                      BoostIcon;                                         // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsBoosted;                                         // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_XpBoostDailyBonus(int32 EntryPoint);
	void Construct();
	void Update_Daily_Bonus();
	void Get_Current_Boost(int32* Boost_Amount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"XpBoostDailyBonus_C">();
	}
	static class UXpBoostDailyBonus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXpBoostDailyBonus_C>();
	}
};
static_assert(alignof(UXpBoostDailyBonus_C) == 0x000008, "Wrong alignment on UXpBoostDailyBonus_C");
static_assert(sizeof(UXpBoostDailyBonus_C) == 0x000250, "Wrong size on UXpBoostDailyBonus_C");
static_assert(offsetof(UXpBoostDailyBonus_C, UberGraphFrame) == 0x000230, "Member 'UXpBoostDailyBonus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UXpBoostDailyBonus_C, Boost) == 0x000238, "Member 'UXpBoostDailyBonus_C::Boost' has a wrong offset!");
static_assert(offsetof(UXpBoostDailyBonus_C, BoostIcon) == 0x000240, "Member 'UXpBoostDailyBonus_C::BoostIcon' has a wrong offset!");
static_assert(offsetof(UXpBoostDailyBonus_C, IsBoosted) == 0x000248, "Member 'UXpBoostDailyBonus_C::IsBoosted' has a wrong offset!");

}

